AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/*
 * Copyright (c) 2024, Ambiq Micro, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 * notice, this list of conditions and the following disclaimer in the
 * documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 * contributors may be used to endorse or promote products derived from this
 * software without specific prior written permission.
 *
 * Third party software included in this distribution is subject to the
 * additional license terms as defined in the /docs/licenses directory.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * @file     apollo510L_cm4.h
 * @brief    CMSIS HeaderFile
 * @version  1.0
 * @date     13. August 2024
 * @note     Generated by SVDConv V3.3.42 on Tuesday, 13.08.2024 13:30:27
 *           from File './apollo510L_cm4.svd',
 *           last modified on Tuesday, 13.08.2024 18:30:27
 */



/** @addtogroup Ambiq Micro
  * @{
  */


/** @addtogroup apollo510L_cm4
  * @{
  */


#ifndef APOLLO510L_CM4_H
#define APOLLO510L_CM4_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M4 Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn     = -12,              /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                     and No Match                                                              */
  BusFault_IRQn             = -11,              /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                     related Fault                                                             */
  UsageFault_IRQn           = -10,              /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn         =  -4,              /*!< -4 Debug Monitor                                                          */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* =======================================  apollo510L_cm4 Specific Interrupt Numbers  ======================================= */
  BROWNOUT_IRQn             =   0,              /*!< 0  BROWNOUT_IRQ                                                           */
  WDT_IRQn                  =   1,              /*!< 1  WDT_IRQ                                                                */
  RTC_IRQn                  =   2,              /*!< 2  RTC_IRQ                                                                */
  TIMER_IRQn                =   3,              /*!< 3  TIMER_IRQ                                                              */
  STIMER_CMPR0_IRQn         =   4,              /*!< 4  STIMER_CMPR0_IRQ                                                       */
  STIMER_CMPR1_IRQn         =   5,              /*!< 5  STIMER_CMPR1_IRQ                                                       */
  STIMER_CMPR2_IRQn         =   6,              /*!< 6  STIMER_CMPR2_IRQ                                                       */
  STIMER_CMPR3_IRQn         =   7,              /*!< 7  STIMER_CMPR3_IRQ                                                       */
  STIMER_CMPR4_IRQn         =   8,              /*!< 8  STIMER_CMPR4_IRQ                                                       */
  STIMER_CMPR5_IRQn         =   9,              /*!< 9  STIMER_CMPR5_IRQ                                                       */
  STIMER_CMPR6_IRQn         =  10,              /*!< 10 STIMER_CMPR6_IRQ                                                       */
  STIMER_CMPR7_IRQn         =  11,              /*!< 11 STIMER_CMPR7_IRQ                                                       */
  STIMER_OVF_IRQn           =  12,              /*!< 12 STIMER_OVF_IRQ                                                         */
  TIMER0_IRQn               =  13,              /*!< 13 TIMER0_IRQ                                                             */
  TIMER1_IRQn               =  14,              /*!< 14 TIMER1_IRQ                                                             */
  TIMER2_IRQn               =  15,              /*!< 15 TIMER2_IRQ                                                             */
  TIMER3_IRQn               =  16,              /*!< 16 TIMER3_IRQ                                                             */
  IPC_PEND_MSG_IRQn         =  17,              /*!< 17 IPC_PEND_MSG_IRQ                                                       */
  IPC_ERR_IRQn              =  18,              /*!< 18 IPC_ERR_IRQ                                                            */
  MM_FIFO_IRQn              =  23,              /*!< 23 MM_FIFO_IRQ                                                            */
  MM_ERROR_IRQn             =  24,              /*!< 24 MM_ERROR_IRQ                                                           */
  MM_FINETGT_IRQn           =  25,              /*!< 25 MM_FINETGT_IRQ                                                         */
  MM_TS_TGT3_IRQn           =  26,              /*!< 26 MM_TS_TGT3_IRQ                                                         */
  MM_TS_TGT2_IRQn           =  27,              /*!< 27 MM_TS_TGT2_IRQ                                                         */
  MM_TS_TGT1_IRQn           =  28,              /*!< 28 MM_TS_TGT1_IRQ                                                         */
  MM_CRYPT_IRQn             =  29,              /*!< 29 MM_CRYPT_IRQ                                                           */
  MM_SLP_IRQn               =  30,              /*!< 30 MM_SLP_IRQ                                                             */
  MM_HSLOT_IRQn             =  31,              /*!< 31 MM_HSLOT_IRQ                                                           */
  MM_SW_IRQn                =  32,              /*!< 32 MM_SW_IRQ                                                              */
  MM_MAC154_ERR_IRQn        =  33,              /*!< 33 MM_MAC154_ERR_IRQ                                                      */
  BLE_ISOTS0_IRQn           =  36,              /*!< 36 BLE_ISOTS0_IRQ                                                         */
  BLE_ISOTS1_IRQn           =  37,              /*!< 37 BLE_ISOTS1_IRQ                                                         */
  BLE_ISOTS2_IRQn           =  38,              /*!< 38 BLE_ISOTS2_IRQ                                                         */
  BLE_ISOTS3_IRQn           =  39,              /*!< 39 BLE_ISOTS3_IRQ                                                         */
  BLE_ISOTS4_IRQn           =  40,              /*!< 40 BLE_ISOTS4_IRQ                                                         */
  BLE_ISOTS5_IRQn           =  41,              /*!< 41 BLE_ISOTS5_IRQ                                                         */
  BLE_ISOTS6_IRQn           =  42,              /*!< 42 BLE_ISOTS6_IRQ                                                         */
  BLE_ISOTS7_IRQn           =  43,              /*!< 43 BLE_ISOTS7_IRQ                                                         */
  BLE_HOP_IRQn              =  44,              /*!< 44 BLE_HOP_IRQ                                                            */
  BLE_ERROR_IRQn            =  45,              /*!< 45 BLE_ERROR_IRQ                                                          */
  BT_MWS_WCI_RX_IRQn        =  48,              /*!< 48 BT_MWS_WCI_RX_IRQ                                                      */
  BT_MWS_WCI_TX_IRQn        =  49,              /*!< 49 BT_MWS_WCI_TX_IRQ                                                      */
  BT_MWS_MT_OFF1_IRQn       =  50,              /*!< 50 BT_MWS_MT_OFF1_IRQ                                                     */
  BT_MWS_MT_OFF0_IRQn       =  51,              /*!< 51 BT_MWS_MT_OFF0_IRQ                                                     */
  BT_MWS_FR_SYNC_IRQn       =  52,              /*!< 52 BT_MWS_FR_SYNC_IRQ                                                     */
  BT_AUDIO1_IRQn            =  54,              /*!< 54 BT_AUDIO1_IRQ                                                          */
  BT_AUDIO0_IRQn            =  55,              /*!< 55 BT_AUDIO0_IRQ                                                          */
  BT_ERROR_IRQn             =  56,              /*!< 56 BT_ERROR_IRQ                                                           */
  RF_XCVR_RX_START_IRQn     =  59,              /*!< 59 RF_XCVR_RX_START_IRQ                                                   */
  RF_XCVR_RX_END_IRQn       =  60,              /*!< 60 RF_XCVR_RX_END_IRQ                                                     */
  RF_XCVR_RX_SYNC_DETECT_IRQn=  61,             /*!< 61 RF_XCVR_RX_SYNC_DETECT_IRQ                                             */
  RF_XCVR_RX_PH_DATA_IRQn   =  62,              /*!< 62 RF_XCVR_RX_PH_DATA_IRQ                                                 */
  RF_XCVR_RX_PH_END_IRQn    =  63,              /*!< 63 RF_XCVR_RX_PH_END_IRQ                                                  */
  RF_XCVR_TX_START_IRQn     =  64,              /*!< 64 RF_XCVR_TX_START_IRQ                                                   */
  RF_XCVR_TX_END_IRQn       =  65,              /*!< 65 RF_XCVR_TX_END_IRQ                                                     */
  RF_XCVR_TX_PH_READ_IRQn   =  66,              /*!< 66 RF_XCVR_TX_PH_READ_IRQ                                                 */
  RF_XCVR_TX_PH_END_IRQn    =  67,              /*!< 67 RF_XCVR_TX_PH_END_IRQ                                                  */
  RF_XCVR_GEN_BUS_ERR_IRQn  =  68,              /*!< 68 RF_XCVR_GEN_BUS_ERR_IRQ                                                */
  MAC_WAKEUP_TIMERS_IRQn    =  69,              /*!< 69 MAC_WAKEUP_TIMERS_IRQ                                                  */
  CMD_QUEUE_IRQn            =  70,              /*!< 70 CMD_QUEUE_IRQ                                                          */
  MAX_IRQn                  =  71               /*!< 71 Not a valid IRQ. The maximum IRQ is this value - 1.                    */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ===========================  Configuration of the ARM Cortex-M4 Processor and Core Peripherals  =========================== */
#define __CM4_REV                 0x0100U       /*!< CM4 Core Revision                                                         */
#define __NVIC_PRIO_BITS               3        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __VTOR_PRESENT                 1        /*!< Set to 1 if CPU supports Vector Table Offset Register                     */
#define __MPU_PRESENT                  1        /*!< MPU present                                                               */
#define __FPU_PRESENT                  1        /*!< FPU present                                                               */
#define __FPU_DP                       0        /*!< Double Precision FPU                                                      */
#define __DSP_PRESENT                  0        /*!< DSP extension present                                                     */
#define __ICACHE_PRESENT               1        /*!< Instruction Cache present                                                 */
#define __DCACHE_PRESENT               1        /*!< Data Cache present                                                        */
#define __ITCM_PRESENT                 1        /*!< Instruction TCM present                                                   */
#define __DTCM_PRESENT                 1        /*!< Data TCM present                                                          */
#define __SAUREGION_PRESENT            0        /*!< SAU region present                                                        */
#define __PMU_PRESENT                  0        /*!< PMU present                                                               */
#define __PMU_NUM_EVENTCNT             0        /*!< PMU Event Counters                                                        */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm4.h"                           /*!< ARM Cortex-M4 processor and core peripherals                              */
#include "system_apollo510L_cm4.h"              /*!< apollo510L_cm4 System                                                     */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                          CM4IPC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter CPU communication (CM4IPC)
  */

