AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
typedef struct {                                /*!< (@ 0x40034000) CM4IPC Structure                                           */

  union {
    __IOM uint32_t M2DDATA;                     /*!< (@ 0x00000000) CM55 to CM4 message data                                   */

    struct {
      __IOM uint32_t M2DMESSAGE : 32;           /*!< [31..0] CM55 to CM4 message data                                          */
    } M2DDATA_b;
  } ;

  union {
    __IOM uint32_t D2MDATA;                     /*!< (@ 0x00000004) CM4 to CM55 message data                                   */

    struct {
      __IOM uint32_t D2MMESSAGE : 32;           /*!< [31..0] CM4 to CM55 message data                                          */
    } D2MDATA_b;
  } ;

  union {
    __IOM uint32_t STATUS;                      /*!< (@ 0x00000008) Channels status                                            */

    struct {
      __IOM uint32_t D2MEMPTY   : 1;            /*!< [0..0] CM4 to CM55 message data FIFO is empty                             */
      __IOM uint32_t D2MFULL    : 1;            /*!< [1..1] CM4 to CM55 message data FIFO is full                              */
      __IOM uint32_t D2MTHRESHOLDACTIVE : 1;    /*!< [2..2] CM4 to CM55 pending data is over threshold                         */
            uint32_t            : 1;
      __IOM uint32_t D2MPEND    : 6;            /*!< [9..4] CM4 to CM55 pending data number                                    */
            uint32_t            : 6;
      __IOM uint32_t M2DEMPTY   : 1;            /*!< [16..16] CM55 to CM4 message data FIFO is empty                           */
      __IOM uint32_t M2DFULL    : 1;            /*!< [17..17] CM55 to CM4 message data FIFO is full                            */
      __IOM uint32_t M2DTHRESHOLDACTIVE : 1;    /*!< [18..18] CM55 to CM4 pending data is over threshold                       */
            uint32_t            : 1;
      __IOM uint32_t M2DPEND    : 6;            /*!< [25..20] CM55 to CM4 pending data number                                  */
            uint32_t            : 6;
    } STATUS_b;
  } ;

  union {
    __IOM uint32_t M2DERROR;                    /*!< (@ 0x0000000C) CM55 to CM4 channel error                                  */

    struct {
      __IOM uint32_t M2DEMPTYERROR : 1;         /*!< [0..0] CM55 to CM4 message data FIFO underflow. Write '1' to
                                                     clear this bit                                                            */
      __IOM uint32_t M2DFULLERROR : 1;          /*!< [1..1] CM55 to CM4 message data FIFO overflow. Write '1' to
                                                     clear this bit                                                            */
            uint32_t            : 30;
    } M2DERROR_b;
  } ;

  union {
    __IOM uint32_t M2DIT;                       /*!< (@ 0x00000010) CM55 to CM4 channel interrupt threshold                    */

    struct {
      __IOM uint32_t M2DTHRESHOLD : 5;          /*!< [4..0] CM55 to CM4 message data threshold. Valid values: 31
                                                     to 1                                                                      */
            uint32_t            : 27;
    } M2DIT_b;
  } ;

  union {
    __IOM uint32_t M2DIS;                       /*!< (@ 0x00000014) CM55 to CM4 channel interrupt status                       */

    struct {
      __IOM uint32_t M2DTHRESHOLDIRQ : 1;       /*!< [0..0] CM55 to CM4 message threshold interrupt. Write '1' to
                                                     clear this bit                                                            */
      __IOM uint32_t M2DERRORIRQ : 1;           /*!< [1..1] CM55 to CM4 channel error interrupt. Write '1' to clear
                                                     this bit                                                                  */
            uint32_t            : 30;
    } M2DIS_b;
  } ;

  union {
    __IOM uint32_t M2DIE;                       /*!< (@ 0x00000018) CM55 to CM4 channel interrupt enable                       */

    struct {
      __IOM uint32_t M2DTHRESHOLDIRQEN : 1;     /*!< [0..0] CM55 to CM4 message threshold interrupt enable                     */
      __IOM uint32_t M2DERRORIRQEN : 1;         /*!< [1..1] CM55 to CM4 channel error interrupt enable                         */
            uint32_t            : 30;
    } M2DIE_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t D2MIT;                       /*!< (@ 0x00000020) CM4 to CM55 channel interrupt threshold                    */

    struct {
      __IOM uint32_t D2MTHRESHOLD : 5;          /*!< [4..0] CM4 to CM55 message data threshold. Valid values: 31
                                                     to 1                                                                      */
            uint32_t            : 27;
    } D2MIT_b;
  } ;

  union {
    __IOM uint32_t D2MIS;                       /*!< (@ 0x00000024) CM4 to CM55 channel interrupt status                       */

    struct {
      __IOM uint32_t D2MTHRESHOLDIRQ : 1;       /*!< [0..0] CM4 to CM55 message threshold interrupt                            */
      __IOM uint32_t D2MERRORIRQ : 1;           /*!< [1..1] CM4 to CM55 channel error interrupt                                */
            uint32_t            : 30;
    } D2MIS_b;
  } ;

  union {
    __IOM uint32_t D2MIE;                       /*!< (@ 0x00000028) CM4 to CM55 channel interrupt enable                       */

    struct {
      __IOM uint32_t D2MTHRESHOLDIRQEN : 1;     /*!< [0..0] CM4 to CM55 message threshold interrupt enable                     */
      __IOM uint32_t D2MERRORIRQEN : 1;         /*!< [1..1] CM4 to CM55 channel error interrupt enable                         */
            uint32_t            : 30;
    } D2MIE_b;
  } ;
} CM4IPC_Type;                                  /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                        CM4MCUCTRL                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief CM4 MCU Control Logic (CM4MCUCTRL)
  */

typedef struct {                                /*!< (@ 0x4000A800) CM4MCUCTRL Structure                                       */

  union {
    __IOM uint32_t OBSSEL;                      /*!< (@ 0x00000000) OBS BUS Enable and Select options. OBSEN must
                                                                    be set to 1 to observe the Observation signals             */

