AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
    struct {
      __IOM uint32_t OBSEN      : 1;            /*!< [0..0] Enable the OBS BUS                                                 */
      __IOM uint32_t OBSSEL0    : 5;            /*!< [5..1] ERROR: desc VALUE MISSING                                          */
      __IOM uint32_t OBSSEL1    : 5;            /*!< [10..6] ERROR: desc VALUE MISSING                                         */
            uint32_t            : 21;
    } OBSSEL_b;
  } ;
  __IM  uint32_t  RESERVED[8];

  union {
    __IOM uint32_t CQFLAGSOUT;                  /*!< (@ 0x00000024) CQ Flags for consumption by Main Application
                                                                    Processor                                                  */

    struct {
      __IOM uint32_t CQOUTIOM0  : 2;            /*!< [1..0] CQ OUTFLAG for IOM0                                                */
      __IOM uint32_t CQOUTIOM1  : 2;            /*!< [3..2] CQ OUTFLAG for IOM1                                                */
      __IOM uint32_t CQOUTIOM2  : 2;            /*!< [5..4] CQ OUTFLAG for IOM2                                                */
      __IOM uint32_t CQOUTIOM3  : 2;            /*!< [7..6] CQ OUTFLAG for IOM3                                                */
      __IOM uint32_t CQOUTIOM4  : 2;            /*!< [9..8] CQ OUTFLAG for IOM4                                                */
      __IOM uint32_t CQOUTIOM5  : 2;            /*!< [11..10] CQ OUTFLAG for IOM5                                              */
      __IOM uint32_t CQOUTMSPI0 : 2;            /*!< [13..12] CQ OUTFLAG for MSPI0                                             */
      __IOM uint32_t CQOUTMSPI1 : 2;            /*!< [15..14] CQ OUTFLAG for MSPI1                                             */
      __IOM uint32_t CQOUTMSPI2 : 2;            /*!< [17..16] CQ OUTFLAG for MSPI2                                             */
            uint32_t            : 14;
    } CQFLAGSOUT_b;
  } ;

  union {
    __IOM uint32_t CQFLAGSIN;                   /*!< (@ 0x00000028) CQ Flags for consumption by Network Processor              */

    struct {
      __IOM uint32_t CQINIOM0   : 2;            /*!< [1..0] CQ INFLAG for IOM0                                                 */
      __IOM uint32_t CQINIOM1   : 2;            /*!< [3..2] CQ INFLAG for IOM1                                                 */
      __IOM uint32_t CQINIOM2   : 2;            /*!< [5..4] CQ INFLAG for IOM2                                                 */
      __IOM uint32_t CQINIOM3   : 2;            /*!< [7..6] CQ INFLAG for IOM3                                                 */
      __IOM uint32_t CQINIOM4   : 2;            /*!< [9..8] CQ INFLAG for IOM4                                                 */
      __IOM uint32_t CQINIOM5   : 2;            /*!< [11..10] CQ INFLAG for IOM5                                               */
      __IOM uint32_t CQINMSPI0  : 2;            /*!< [13..12] CQ INFLAG for MSPI0                                              */
      __IOM uint32_t CQINMSPI1  : 2;            /*!< [15..14] CQ INFLAG for MSPI1                                              */
      __IOM uint32_t CQINMSPI2  : 2;            /*!< [17..16] CQ INFLAG for MSPI2                                              */
            uint32_t            : 14;
    } CQFLAGSIN_b;
  } ;

  union {
    __IOM uint32_t TCMWPROT;                    /*!< (@ 0x0000002C) TCM Write Protect Bits. Each bit protects one
                                                                    8k region. Total TCM Size is 64K.                          */

    struct {
      __IOM uint32_t TCMWPROT0  : 1;            /*!< [0..0] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMWPROT1  : 1;            /*!< [1..1] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMWPROT2  : 1;            /*!< [2..2] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMWPROT3  : 1;            /*!< [3..3] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMWPROT4  : 1;            /*!< [4..4] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMWPROT5  : 1;            /*!< [5..5] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMWPROT6  : 1;            /*!< [6..6] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMWPROT7  : 1;            /*!< [7..7] TCM Write Protect 8K Region                                        */
            uint32_t            : 24;
    } TCMWPROT_b;
  } ;

  union {
    __IOM uint32_t TCMRPROT;                    /*!< (@ 0x00000030) TCM Read Protect Bits. Each bit protects one
                                                                    8k region. Total TCM Size is 64K.                          */

    struct {
      __IOM uint32_t TCMRPROT0  : 1;            /*!< [0..0] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMRPROT1  : 1;            /*!< [1..1] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMRPROT2  : 1;            /*!< [2..2] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMRPROT3  : 1;            /*!< [3..3] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMRPROT4  : 1;            /*!< [4..4] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMRPROT5  : 1;            /*!< [5..5] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMRPROT6  : 1;            /*!< [6..6] TCM Write Protect 8K Region                                        */
      __IOM uint32_t TCMRPROT7  : 1;            /*!< [7..7] TCM Write Protect 8K Region                                        */
            uint32_t            : 24;
    } TCMRPROT_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t CPUPWRCTRL;                  /*!< (@ 0x00000040) Miscellaneous Controls and Status Register                 */

