AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
    struct {
      __IOM uint32_t DEBUGPWREN : 1;            /*!< [0..0] Software Override to enabled Debug PWR                             */
      __IOM uint32_t SLEEPMODE  : 1;            /*!< [1..1] CM4 SLEEP MODE STATUS                                              */
      __IOM uint32_t PMUCLKSTATE : 1;           /*!< [2..2] State of PMU CLOCK                                                 */
      __IOM uint32_t FCLKSTATE  : 1;            /*!< [3..3] State of MAIN CPU CLOCK                                            */
      __IOM uint32_t CPUCLKOVEREN : 1;          /*!< [4..4] Override CPU CLOCK                                                 */
      __IOM uint32_t PMUEN      : 1;            /*!< [5..5] Enable CM4 PMU                                                     */
      __IOM uint32_t CM4NVMEN   : 1;            /*!< [6..6] CM4 will Enable NVM power domain in Main PWRCTRL                   */
            uint32_t            : 25;
    } CPUPWRCTRL_b;
  } ;

  union {
    __IOM uint32_t COREPWROFF;                  /*!< (@ 0x00000044) CM4 Power Control and Status                               */

    struct {
      __IOM uint32_t CPUPWROFF  : 1;            /*!< [0..0] M4 POWER OFF REQ FROM CPU. This bit is cleard by the
                                                     PWRCTRL after CPU power down is acknowledged by the CM4
                                                     PMU.                                                                      */
            uint32_t            : 31;
    } COREPWROFF_b;
  } ;

  union {
    __IOM uint32_t CM4TIMING0;                  /*!< (@ 0x00000048) CM4 Timing Reg 0                                           */

    struct {
      __IOM uint32_t VALUE0     : 1;            /*!< [0..0] CM4 Timing 0 Value                                                 */
            uint32_t            : 31;
    } CM4TIMING0_b;
  } ;

  union {
    __IOM uint32_t CM4TIMING1;                  /*!< (@ 0x0000004C) CM4 Timing Reg 1                                           */

    struct {
      __IOM uint32_t VALUE1     : 1;            /*!< [0..0] CM4 Timing 1 Value                                                 */
            uint32_t            : 31;
    } CM4TIMING1_b;
  } ;

  union {
    __IOM uint32_t CM4TIMING2;                  /*!< (@ 0x00000050) CM4 Timing Reg 2                                           */

    struct {
      __IOM uint32_t VALUE2     : 1;            /*!< [0..0] CM4 Timing 2 Value                                                 */
            uint32_t            : 31;
    } CM4TIMING2_b;
  } ;

  union {
    __IOM uint32_t CM4TIMING3;                  /*!< (@ 0x00000054) CM4 Timing Reg 3                                           */

    struct {
      __IOM uint32_t VALUE3     : 1;            /*!< [0..0] CM4 Timing 3 Value                                                 */
            uint32_t            : 31;
    } CM4TIMING3_b;
  } ;

  union {
    __IOM uint32_t CM4TIMING4;                  /*!< (@ 0x00000058) CM4 Timing Reg 4                                           */

    struct {
      __IOM uint32_t VALUE4     : 1;            /*!< [0..0] CM4 Timing 4 Value                                                 */
            uint32_t            : 31;
    } CM4TIMING4_b;
  } ;

  union {
    __IOM uint32_t CM4TIMING5;                  /*!< (@ 0x0000005C) CM4 Timing Reg 5                                           */

    struct {
      __IOM uint32_t VALUE5     : 1;            /*!< [0..0] CM4 Timing 5 Value                                                 */
            uint32_t            : 31;
    } CM4TIMING5_b;
  } ;

  union {
    __IOM uint32_t CM4TIMING6;                  /*!< (@ 0x00000060) CM4 Timing Reg 6                                           */

    struct {
      __IOM uint32_t VALUE6     : 1;            /*!< [0..0] CM4 Timing 6 Value                                                 */
            uint32_t            : 31;
    } CM4TIMING6_b;
  } ;

  union {
    __IOM uint32_t CM4TIMING7;                  /*!< (@ 0x00000064) CM4 Timing Reg 7                                           */

    struct {
      __IOM uint32_t VALUE7     : 1;            /*!< [0..0] CM4 Timing 7 Value                                                 */
            uint32_t            : 31;
    } CM4TIMING7_b;
  } ;

  union {
    __IOM uint32_t CM4TIMINGENABLE;             /*!< (@ 0x00000068) CM4 Timing Reg 7                                           */

    struct {
      __IOM uint32_t ENABLE0    : 1;            /*!< [0..0] Enable CM4 Timing Value 0                                          */
      __IOM uint32_t ENABLE1    : 1;            /*!< [1..1] Enable CM4 Timing Value 0                                          */
      __IOM uint32_t ENABLE2    : 1;            /*!< [2..2] Enable CM4 Timing Value 0                                          */
      __IOM uint32_t ENABLE3    : 1;            /*!< [3..3] Enable CM4 Timing Value 0                                          */
      __IOM uint32_t ENABLE4    : 1;            /*!< [4..4] Enable CM4 Timing Value 0                                          */
      __IOM uint32_t ENABLE5    : 1;            /*!< [5..5] Enable CM4 Timing Value 0                                          */
      __IOM uint32_t ENABLE6    : 1;            /*!< [6..6] Enable CM4 Timing Value 0                                          */
      __IOM uint32_t ENABLE7    : 1;            /*!< [7..7] Enable CM4 Timing Value 0                                          */
            uint32_t            : 24;
    } CM4TIMINGENABLE_b;
  } ;
  __IM  uint32_t  RESERVED2[5];

  union {
    __IOM uint32_t INTEN;                       /*!< (@ 0x00000080) Set bits in this register to allow this module
                                                                    to generate the corresponding interrupt.                   */

    struct {
      __IOM uint32_t INT0       : 1;            /*!< [0..0] INTERRUPT 0                                                        */
      __IOM uint32_t INT1       : 1;            /*!< [1..1] INTERRUPT 1                                                        */
      __IOM uint32_t INT2       : 1;            /*!< [2..2] INTERRUPT 2                                                        */
      __IOM uint32_t INT3       : 1;            /*!< [3..3] INTERRUPT 3                                                        */
      __IOM uint32_t INT4       : 1;            /*!< [4..4] INTERRUPT 4                                                        */
      __IOM uint32_t INT5       : 1;            /*!< [5..5] INTERRUPT 5                                                        */
      __IOM uint32_t INT6       : 1;            /*!< [6..6] INTERRUPT 6                                                        */
      __IOM uint32_t INT7       : 1;            /*!< [7..7] INTERRUPT 7                                                        */
      __IOM uint32_t INT8       : 1;            /*!< [8..8] INTERRUPT 8                                                        */
      __IOM uint32_t INT9       : 1;            /*!< [9..9] INTERRUPT 9                                                        */
      __IOM uint32_t INT10      : 1;            /*!< [10..10] INTERRUPT 10                                                     */
      __IOM uint32_t INT11      : 1;            /*!< [11..11] INTERRUPT 11                                                     */
      __IOM uint32_t INT12      : 1;            /*!< [12..12] INTERRUPT 12                                                     */
      __IOM uint32_t INT13      : 1;            /*!< [13..13] INTERRUPT 13                                                     */
      __IOM uint32_t INT14      : 1;            /*!< [14..14] INTERRUPT 14                                                     */
            uint32_t            : 17;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< (@ 0x00000084) Read bits from this register to discover the
                                                                    cause of a recent interrupt.                               */

