AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
    struct {
      __IOM uint32_t INT0       : 1;            /*!< [0..0] INTERRUPT 0                                                        */
      __IOM uint32_t INT1       : 1;            /*!< [1..1] INTERRUPT 1                                                        */
      __IOM uint32_t INT2       : 1;            /*!< [2..2] INTERRUPT 2                                                        */
      __IOM uint32_t INT3       : 1;            /*!< [3..3] INTERRUPT 3                                                        */
      __IOM uint32_t INT4       : 1;            /*!< [4..4] INTERRUPT 4                                                        */
      __IOM uint32_t INT5       : 1;            /*!< [5..5] INTERRUPT 5                                                        */
      __IOM uint32_t INT6       : 1;            /*!< [6..6] INTERRUPT 6                                                        */
      __IOM uint32_t INT7       : 1;            /*!< [7..7] INTERRUPT 7                                                        */
      __IOM uint32_t INT8       : 1;            /*!< [8..8] INTERRUPT 8                                                        */
      __IOM uint32_t INT9       : 1;            /*!< [9..9] INTERRUPT 9                                                        */
      __IOM uint32_t INT10      : 1;            /*!< [10..10] INTERRUPT 10                                                     */
      __IOM uint32_t INT11      : 1;            /*!< [11..11] INTERRUPT 11                                                     */
      __IOM uint32_t INT12      : 1;            /*!< [12..12] INTERRUPT 12                                                     */
      __IOM uint32_t INT13      : 1;            /*!< [13..13] INTERRUPT 13                                                     */
      __IOM uint32_t INT14      : 1;            /*!< [14..14] INTERRUPT 14                                                     */
            uint32_t            : 17;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< (@ 0x00000088) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t INT0       : 1;            /*!< [0..0] INTERRUPT 0                                                        */
      __IOM uint32_t INT1       : 1;            /*!< [1..1] INTERRUPT 1                                                        */
      __IOM uint32_t INT2       : 1;            /*!< [2..2] INTERRUPT 2                                                        */
      __IOM uint32_t INT3       : 1;            /*!< [3..3] INTERRUPT 3                                                        */
      __IOM uint32_t INT4       : 1;            /*!< [4..4] INTERRUPT 4                                                        */
      __IOM uint32_t INT5       : 1;            /*!< [5..5] INTERRUPT 5                                                        */
      __IOM uint32_t INT6       : 1;            /*!< [6..6] INTERRUPT 6                                                        */
      __IOM uint32_t INT7       : 1;            /*!< [7..7] INTERRUPT 7                                                        */
      __IOM uint32_t INT8       : 1;            /*!< [8..8] INTERRUPT 8                                                        */
      __IOM uint32_t INT9       : 1;            /*!< [9..9] INTERRUPT 9                                                        */
      __IOM uint32_t INT10      : 1;            /*!< [10..10] INTERRUPT 10                                                     */
      __IOM uint32_t INT11      : 1;            /*!< [11..11] INTERRUPT 11                                                     */
      __IOM uint32_t INT12      : 1;            /*!< [12..12] INTERRUPT 12                                                     */
      __IOM uint32_t INT13      : 1;            /*!< [13..13] INTERRUPT 13                                                     */
      __IOM uint32_t INT14      : 1;            /*!< [14..14] INTERRUPT 14                                                     */
            uint32_t            : 17;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< (@ 0x0000008C) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

    struct {
      __IOM uint32_t INT0       : 1;            /*!< [0..0] INTERRUPT 0                                                        */
      __IOM uint32_t INT1       : 1;            /*!< [1..1] INTERRUPT 1                                                        */
      __IOM uint32_t INT2       : 1;            /*!< [2..2] INTERRUPT 2                                                        */
      __IOM uint32_t INT3       : 1;            /*!< [3..3] INTERRUPT 3                                                        */
      __IOM uint32_t INT4       : 1;            /*!< [4..4] INTERRUPT 4                                                        */
      __IOM uint32_t INT5       : 1;            /*!< [5..5] INTERRUPT 5                                                        */
      __IOM uint32_t INT6       : 1;            /*!< [6..6] INTERRUPT 6                                                        */
      __IOM uint32_t INT7       : 1;            /*!< [7..7] INTERRUPT 7                                                        */
      __IOM uint32_t INT8       : 1;            /*!< [8..8] INTERRUPT 8                                                        */
      __IOM uint32_t INT9       : 1;            /*!< [9..9] INTERRUPT 9                                                        */
      __IOM uint32_t INT10      : 1;            /*!< [10..10] INTERRUPT 10                                                     */
      __IOM uint32_t INT11      : 1;            /*!< [11..11] INTERRUPT 11                                                     */
      __IOM uint32_t INT12      : 1;            /*!< [12..12] INTERRUPT 12                                                     */
      __IOM uint32_t INT13      : 1;            /*!< [13..13] INTERRUPT 13                                                     */
      __IOM uint32_t INT14      : 1;            /*!< [14..14] INTERRUPT 14                                                     */
            uint32_t            : 17;
    } INTSET_b;
  } ;
} CM4MCUCTRL_Type;                              /*!< Size = 144 (0x90)                                                         */



/* =========================================================================================================================== */
/* ================                                         CM4RADIO                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Bluetooth/IEEE 802.15.4 Radio (CM4RADIO)
  */

typedef struct {                                /*!< (@ 0x40030000) CM4RADIO Structure                                         */

  union {
    __IOM uint32_t RCLKCONTROL;                 /*!< (@ 0x00000000) This register contains the control bits for the
                                                                    Radio clocks                                               */

