AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
    struct {
      __IOM uint32_t BBCLKSEL   : 2;            /*!< [1..0] Baseband master clock select                                       */
      __IOM uint32_t BBCLKOVERRIDE : 1;         /*!< [2..2] Baseband master clock override control                             */
      __IOM uint32_t MCUCLKSEL  : 1;            /*!< [3..3] MCU clock select (CM4)                                             */
      __IOM uint32_t TPIUCLKSEL : 2;            /*!< [5..4] TPIU clock select (CM4)                                            */
      __IOM uint32_t TPIUCLKEN  : 1;            /*!< [6..6] TPIU clock enable (CM4)                                            */
            uint32_t            : 25;
    } RCLKCONTROL_b;
  } ;

  union {
    __IOM uint32_t RCONTROL;                    /*!< (@ 0x00000004) This register contains the control bits for the
                                                                    Radio                                                      */

    struct {
      __IOM uint32_t XOCONFIG   : 26;           /*!< [25..0] IcyTRX XTAL Config, see IcyTRX integration guide for
                                                     more information                                                          */
      __IOM uint32_t OSCEN      : 1;            /*!< [26..26] Enable the RF XTAL oscillator                                    */
            uint32_t            : 5;
    } RCONTROL_b;
  } ;

  union {
    __IOM uint32_t BBCONTROL;                   /*!< (@ 0x00000008) This register contains the control bits for the
                                                                    Baseband                                                   */

    struct {
      __IOM uint32_t WAKEUPREQ  : 1;            /*!< [0..0] Wakeup request. Write a 1 to request that the Baseband
                                                     wake up from Deep Sleep mode. This bit automatically clears
                                                     when the wake up is complete. Refer to RW-DM-CORE-FS for
                                                     details of wake up from Deep Sleep                                        */
            uint32_t            : 31;
    } BBCONTROL_b;
  } ;

  union {
    __IOM uint32_t NPCONTROL;                   /*!< (@ 0x0000000C) This register contains the control bits for the
                                                                    Network Processor                                          */

    struct {
      __IOM uint32_t NPSWRSTDBG : 1;            /*!< [0..0] Software reset for CM4 DEBUG                                       */
      __IOM uint32_t NPWDREN    : 1;            /*!< [1..1] Watchdog Timer Reset Enable. NOTE: The WDT module must
                                                     also be configured for WDT reset. This includes enabling
                                                     the RESEN bit in WDTCFG register in Watch dog timer block                 */
      __IOM uint32_t TXENABLED  : 1;            /*!< [2..2] Transmit enabled status from the baseband (radio_out[6])           */
      __IOM uint32_t RXENABLED  : 1;            /*!< [3..3] Receive enabled status from the baseband (radio_out[7])            */
            uint32_t            : 28;
    } NPCONTROL_b;
  } ;

  union {
    __IOM uint32_t RADIOSTAT;                   /*!< (@ 0x00000010) This register contains the status bits for the
                                                                    Radio Subsystem                                            */

    struct {
      __IOM uint32_t NPCLRSTAT  : 1;            /*!< [0..0] Writing a 1 to this bit clears all the status bits in
                                                     this register                                                             */
      __IOM uint32_t NPAIRCRSTAT : 1;           /*!< [1..1] System reset request occurred (SYSRESETREQ from CM4)               */
      __IOM uint32_t NPDBGRSTAT : 1;            /*!< [2..2] Debugger reset occurred (CDBGRSTREQ from CM4 Debugger)             */
      __IOM uint32_t NPWDRSTAT  : 1;            /*!< [3..3] Watchdog timer reset occurred                                      */
      __IOM uint32_t NPSWPORSTAT : 1;           /*!< [4..4] Software POR reset occurred                                        */
            uint32_t            : 27;
    } RADIOSTAT_b;
  } ;

  union {
    __IOM uint32_t NPSWPOR;                     /*!< (@ 0x00000014) This is the CM4 software POR reset. Writing the
                                                                    key value to this register will trigger
                                                                    a POR to the system. This will cause a reset
                                                                    to all blocks except for registers in clock
                                                                    gen, RTC, power management unit, the stimer,
                                                                    and the power management unit                              */

    struct {
      __IOM uint32_t NPSWPORKEY : 8;            /*!< [7..0] 0xD4 generates a CM4 software POR reset                            */
            uint32_t            : 24;
    } NPSWPOR_b;
  } ;

  union {
    __IOM uint32_t RTUNE;                       /*!< (@ 0x00000018) This register contains the tune bits for the
                                                                    Radio                                                      */

    struct {
      __IOM uint32_t DIGLDOVREF : 7;            /*!< [6..0] Tune the reference voltage of the digital power domain
                                                     LDO (vddd power domain)                                                   */
      __IOM uint32_t DIGLDOCTRL : 3;            /*!< [9..7] Bias control of LDO OTA                                            */
      __IOM uint32_t REFELDOVREF : 7;           /*!< [16..10] Tune the reference voltage of the 'misc' power domain
                                                     LDO (vddmisc power domain)                                                */
      __IOM uint32_t REFELDOMISC : 3;           /*!< [19..17] Control LDO for the 'misc' power domain (vddmisc power
                                                     domain)                                                                   */
            uint32_t            : 12;
    } RTUNE_b;
  } ;

  union {
    __IOM uint32_t DBGCTRL;                     /*!< (@ 0x0000001C) This register controls the observe bus debug
                                                                    interface                                                  */

