AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
    struct {
      __IOM uint32_t OBSSEL     : 4;            /*!< [3..0] Select the bus to observe on the 16-bit GPIO debug bus             */
      __IOM uint32_t OBSEN      : 1;            /*!< [4..4] Enable the Radio observe bus                                       */
            uint32_t            : 27;
    } DBGCTRL_b;
  } ;

  union {
    __IOM uint32_t WLANCOEXCTRL;                /*!< (@ 0x00000020) This register controls WLAN coexisting interface
                                                                    (PTA)                                                      */

    struct {
      __IOM uint32_t WLANCOEXIFEN : 1;          /*!< [0..0] Enable WLAN COEX interface                                         */
      __IOM uint32_t FREQINV    : 1;            /*!< [1..1] Polarity Inverted for WLAN_COEX_FREQ when true                     */
      __IOM uint32_t PRIORITYINV : 1;           /*!< [2..2] Polarity Inverted for WLAN_COEX_PRIORITY when true                 */
      __IOM uint32_t REQINV     : 1;            /*!< [3..3] Polarity Inverted for WLAN_COEX_REQ when true                      */
      __IOM uint32_t GRANTINV   : 1;            /*!< [4..4] Polarity Inverted for WLAN_COEX_GRANT when true                    */
            uint32_t            : 11;
      __IOM uint32_t CHANRANGEBOTTOM : 8;       /*!< [23..16] WLAN channel range's bottom, range k is from 2402 +
                                                     kMHz, k = 0 ~ 78                                                          */
      __IOM uint32_t CHANRANGETOP : 8;          /*!< [31..24] WLAN channel range's top, range k is from 2402 + kMHz,
                                                     k = 0 ~ 78                                                                */
    } WLANCOEXCTRL_b;
  } ;

  union {
    __IOM uint32_t WCICOEXCTRL;                 /*!< (@ 0x00000024) This register controls the WCI coexisting interface
                                                                    (PTA)                                                      */

    struct {
      __IOM uint32_t WCICOEXIFSEL : 2;          /*!< [1..0] Select WCI COEX interface                                          */
            uint32_t            : 30;
    } WCICOEXCTRL_b;
  } ;

  union {
    __IOM uint32_t EXTRFDIRCTRL;                /*!< (@ 0x00000028) This register controls the external RF detection           */

    struct {
      __IOM uint32_t TXENBIT    : 1;            /*!< [0..0] Value to send on the TXEN GPIO (when selected)                     */
      __IOM uint32_t RXENBIT    : 1;            /*!< [1..1] Value to send on the RXEN GPIO (when selected)                     */
            uint32_t            : 23;
      __IOM uint32_t TXENSEL    : 2;            /*!< [26..25] Selects the signal transmitted on the TXEN GPIO                  */
      __IOM uint32_t RXENSEL    : 2;            /*!< [28..27] Selects the signal transmitted on the RXEN GPIO                  */
            uint32_t            : 3;
    } EXTRFDIRCTRL_b;
  } ;
} CM4RADIO_Type;                                /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real Time Clock (RTC)
  */

typedef struct {                                /*!< (@ 0x40004800) RTC Structure                                              */

  union {
    __IOM uint32_t RTCCTL;                      /*!< (@ 0x00000000) This is the register control for the RTC module.
                                                                    It enables counter writes and sets the alarm
                                                                    repeat interval.                                           */

    struct {
      __IOM uint32_t WRTC       : 1;            /*!< [0..0] Counter write control                                              */
      __IOM uint32_t RPT        : 3;            /*!< [3..1] Alarm repeat interval                                              */
      __IOM uint32_t RSTOP      : 1;            /*!< [4..4] RTC input clock control                                            */
      __IOM uint32_t HR1224     : 1;            /*!< [5..5] Hours Counter mode Only 24HR mode supported                        */
            uint32_t            : 26;
    } RTCCTL_b;
  } ;

  union {
    __IOM uint32_t RTCSTAT;                     /*!< (@ 0x00000004) This is the register status for the RTC module.            */

    struct {
      __IOM uint32_t WRITEBUSY  : 1;            /*!< [0..0] Indicates that an RTC update (write) is still in progress.
                                                     Writes are initiated by writing the CTTLOW register - CTRUP
                                                     must be written before CTRLOW to be updated (otherwise
                                                     it will retain its current value)                                         */
            uint32_t            : 31;
    } RTCSTAT_b;
  } ;
  __IM  uint32_t  RESERVED[6];

  union {
    __IOM uint32_t CTRLOW;                      /*!< (@ 0x00000020) This counter contains the values for hour, minutes,
                                                                    seconds and 100ths of a second Counter.                    */

    struct {
      __IOM uint32_t CTR100     : 8;            /*!< [7..0] 100ths of a second Counter. Contains the current value
                                                     for hundredths of a second.                                               */
      __IOM uint32_t CTRSEC     : 7;            /*!< [14..8] Seconds Counter. Contains the current value for seconds.          */
            uint32_t            : 1;
      __IOM uint32_t CTRMIN     : 7;            /*!< [22..16] Minutes Counter. Contains the current value for minutes.         */
            uint32_t            : 1;
      __IOM uint32_t CTRHR      : 6;            /*!< [29..24] Hours Counter. Contains the current value for hour.              */
            uint32_t            : 2;
    } CTRLOW_b;
  } ;

  union {
    __IOM uint32_t CTRUP;                       /*!< (@ 0x00000024) This register contains the day, month and year
                                                                    information. It contains which day in the
                                                                    week, and the century as well. The information
                                                                    of the century can also be derived from
                                                                    the year information. The 31st bit contains
                                                                    the error bit. See description in the register
                                                                    bit for condition when error is triggered.                 */

