AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
    struct {
      __IOM uint32_t COUNT      : 8;            /*!< [7..0] Read-Only current value of the WDT counter                         */
            uint32_t            : 24;
    } COUNT_b;
  } ;
  __IM  uint32_t  RESERVED[124];

  union {
    __IOM uint32_t WDTIEREN;                    /*!< (@ 0x00000200) Set bits in this register to allow this module
                                                                    to generate the corresponding interrupt.                   */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< [0..0] Watchdog Timer Interrupt.                                          */
            uint32_t            : 31;
    } WDTIEREN_b;
  } ;

  union {
    __IOM uint32_t WDTIERSTAT;                  /*!< (@ 0x00000204) Read bits from this register to discover the
                                                                    cause of a recent interrupt.                               */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< [0..0] Watchdog Timer Interrupt.                                          */
            uint32_t            : 31;
    } WDTIERSTAT_b;
  } ;

  union {
    __IOM uint32_t WDTIERCLR;                   /*!< (@ 0x00000208) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< [0..0] Watchdog Timer Interrupt.                                          */
            uint32_t            : 31;
    } WDTIERCLR_b;
  } ;

  union {
    __IOM uint32_t WDTIERSET;                   /*!< (@ 0x0000020C) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< [0..0] Watchdog Timer Interrupt.                                          */
            uint32_t            : 31;
    } WDTIERSET_b;
  } ;
} CM4WDT_Type;                                  /*!< Size = 528 (0x210)                                                        */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define CM4IPC_BASE                 0x40034000UL
#define CM4MCUCTRL_BASE             0x4000A800UL
#define CM4RADIO_BASE               0x40030000UL
#define RTC_BASE                    0x40004800UL
#define CM4STIMER_BASE              0x40008800UL
#define CM4TIMER_BASE               0x40008000UL
#define CM4WDT_BASE                 0x40006000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define CM4IPC                      ((CM4IPC_Type*)            CM4IPC_BASE)
#define CM4MCUCTRL                  ((CM4MCUCTRL_Type*)        CM4MCUCTRL_BASE)
#define CM4RADIO                    ((CM4RADIO_Type*)          CM4RADIO_BASE)
#define RTC                         ((RTC_Type*)               RTC_BASE)
#define CM4STIMER                   ((CM4STIMER_Type*)         CM4STIMER_BASE)
#define CM4TIMER                    ((CM4TIMER_Type*)          CM4TIMER_BASE)
#define CM4WDT                      ((CM4WDT_Type*)            CM4WDT_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                          CM4IPC                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  M2DDATA  ======================================================== */
#define CM4IPC_M2DDATA_M2DMESSAGE_Pos     (0UL)                     /*!< M2DMESSAGE (Bit 0)                                    */
#define CM4IPC_M2DDATA_M2DMESSAGE_Msk     (0xffffffffUL)            /*!< M2DMESSAGE (Bitfield-Mask: 0xffffffff)                */
/* ========================================================  D2MDATA  ======================================================== */
#define CM4IPC_D2MDATA_D2MMESSAGE_Pos     (0UL)                     /*!< D2MMESSAGE (Bit 0)                                    */
#define CM4IPC_D2MDATA_D2MMESSAGE_Msk     (0xffffffffUL)            /*!< D2MMESSAGE (Bitfield-Mask: 0xffffffff)                */
/* ========================================================  STATUS  ========================================================= */
#define CM4IPC_STATUS_M2DPEND_Pos         (20UL)                    /*!< M2DPEND (Bit 20)                                      */
#define CM4IPC_STATUS_M2DPEND_Msk         (0x3f00000UL)             /*!< M2DPEND (Bitfield-Mask: 0x3f)                         */
#define CM4IPC_STATUS_M2DTHRESHOLDACTIVE_Pos (18UL)                 /*!< M2DTHRESHOLDACTIVE (Bit 18)                           */
#define CM4IPC_STATUS_M2DTHRESHOLDACTIVE_Msk (0x40000UL)            /*!< M2DTHRESHOLDACTIVE (Bitfield-Mask: 0x01)              */
#define CM4IPC_STATUS_M2DFULL_Pos         (17UL)                    /*!< M2DFULL (Bit 17)                                      */
#define CM4IPC_STATUS_M2DFULL_Msk         (0x20000UL)               /*!< M2DFULL (Bitfield-Mask: 0x01)                         */
#define CM4IPC_STATUS_M2DEMPTY_Pos        (16UL)                    /*!< M2DEMPTY (Bit 16)                                     */
#define CM4IPC_STATUS_M2DEMPTY_Msk        (0x10000UL)               /*!< M2DEMPTY (Bitfield-Mask: 0x01)                        */
#define CM4IPC_STATUS_D2MPEND_Pos         (4UL)                     /*!< D2MPEND (Bit 4)                                       */
#define CM4IPC_STATUS_D2MPEND_Msk         (0x3f0UL)                 /*!< D2MPEND (Bitfield-Mask: 0x3f)                         */
#define CM4IPC_STATUS_D2MTHRESHOLDACTIVE_Pos (2UL)                  /*!< D2MTHRESHOLDACTIVE (Bit 2)                            */
#define CM4IPC_STATUS_D2MTHRESHOLDACTIVE_Msk (0x4UL)                /*!< D2MTHRESHOLDACTIVE (Bitfield-Mask: 0x01)              */
#define CM4IPC_STATUS_D2MFULL_Pos         (1UL)                     /*!< D2MFULL (Bit 1)                                       */
#define CM4IPC_STATUS_D2MFULL_Msk         (0x2UL)                   /*!< D2MFULL (Bitfield-Mask: 0x01)                         */
#define CM4IPC_STATUS_D2MEMPTY_Pos        (0UL)                     /*!< D2MEMPTY (Bit 0)                                      */
#define CM4IPC_STATUS_D2MEMPTY_Msk        (0x1UL)                   /*!< D2MEMPTY (Bitfield-Mask: 0x01)                        */
/* =======================================================  M2DERROR  ======================================================== */
#define CM4IPC_M2DERROR_M2DFULLERROR_Pos  (1UL)                     /*!< M2DFULLERROR (Bit 1)                                  */
#define CM4IPC_M2DERROR_M2DFULLERROR_Msk  (0x2UL)                   /*!< M2DFULLERROR (Bitfield-Mask: 0x01)                    */
#define CM4IPC_M2DERROR_M2DEMPTYERROR_Pos (0UL)                     /*!< M2DEMPTYERROR (Bit 0)                                 */
#define CM4IPC_M2DERROR_M2DEMPTYERROR_Msk (0x1UL)                   /*!< M2DEMPTYERROR (Bitfield-Mask: 0x01)                   */
/* =========================================================  M2DIT  ========================================================= */
#define CM4IPC_M2DIT_M2DTHRESHOLD_Pos     (0UL)                     /*!< M2DTHRESHOLD (Bit 0)                                  */
#define CM4IPC_M2DIT_M2DTHRESHOLD_Msk     (0x1fUL)                  /*!< M2DTHRESHOLD (Bitfield-Mask: 0x1f)                    */
/* =========================================================  M2DIS  ========================================================= */
#define CM4IPC_M2DIS_M2DERRORIRQ_Pos      (1UL)                     /*!< M2DERRORIRQ (Bit 1)                                   */
#define CM4IPC_M2DIS_M2DERRORIRQ_Msk      (0x2UL)                   /*!< M2DERRORIRQ (Bitfield-Mask: 0x01)                     */
#define CM4IPC_M2DIS_M2DTHRESHOLDIRQ_Pos  (0UL)                     /*!< M2DTHRESHOLDIRQ (Bit 0)                               */
#define CM4IPC_M2DIS_M2DTHRESHOLDIRQ_Msk  (0x1UL)                   /*!< M2DTHRESHOLDIRQ (Bitfield-Mask: 0x01)                 */
/* =========================================================  M2DIE  ========================================================= */
#define CM4IPC_M2DIE_M2DERRORIRQEN_Pos    (1UL)                     /*!< M2DERRORIRQEN (Bit 1)                                 */
#define CM4IPC_M2DIE_M2DERRORIRQEN_Msk    (0x2UL)                   /*!< M2DERRORIRQEN (Bitfield-Mask: 0x01)                   */
#define CM4IPC_M2DIE_M2DTHRESHOLDIRQEN_Pos (0UL)                    /*!< M2DTHRESHOLDIRQEN (Bit 0)                             */
#define CM4IPC_M2DIE_M2DTHRESHOLDIRQEN_Msk (0x1UL)                  /*!< M2DTHRESHOLDIRQEN (Bitfield-Mask: 0x01)               */
/* =========================================================  D2MIT  ========================================================= */
#define CM4IPC_D2MIT_D2MTHRESHOLD_Pos     (0UL)                     /*!< D2MTHRESHOLD (Bit 0)                                  */
#define CM4IPC_D2MIT_D2MTHRESHOLD_Msk     (0x1fUL)                  /*!< D2MTHRESHOLD (Bitfield-Mask: 0x1f)                    */
/* =========================================================  D2MIS  ========================================================= */
#define CM4IPC_D2MIS_D2MERRORIRQ_Pos      (1UL)                     /*!< D2MERRORIRQ (Bit 1)                                   */
#define CM4IPC_D2MIS_D2MERRORIRQ_Msk      (0x2UL)                   /*!< D2MERRORIRQ (Bitfield-Mask: 0x01)                     */
#define CM4IPC_D2MIS_D2MTHRESHOLDIRQ_Pos  (0UL)                     /*!< D2MTHRESHOLDIRQ (Bit 0)                               */
#define CM4IPC_D2MIS_D2MTHRESHOLDIRQ_Msk  (0x1UL)                   /*!< D2MTHRESHOLDIRQ (Bitfield-Mask: 0x01)                 */
/* =========================================================  D2MIE  ========================================================= */
#define CM4IPC_D2MIE_D2MERRORIRQEN_Pos    (1UL)                     /*!< D2MERRORIRQEN (Bit 1)                                 */
#define CM4IPC_D2MIE_D2MERRORIRQEN_Msk    (0x2UL)                   /*!< D2MERRORIRQEN (Bitfield-Mask: 0x01)                   */
#define CM4IPC_D2MIE_D2MTHRESHOLDIRQEN_Pos (0UL)                    /*!< D2MTHRESHOLDIRQEN (Bit 0)                             */
#define CM4IPC_D2MIE_D2MTHRESHOLDIRQEN_Msk (0x1UL)                  /*!< D2MTHRESHOLDIRQEN (Bitfield-Mask: 0x01)               */


/* =========================================================================================================================== */
/* ================                                        CM4MCUCTRL                                         ================ */
/* =========================================================================================================================== */

