AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ========================================================  OBSSEL  ========================================================= */
#define CM4MCUCTRL_OBSSEL_OBSSEL1_Pos     (6UL)                     /*!< OBSSEL1 (Bit 6)                                       */
#define CM4MCUCTRL_OBSSEL_OBSSEL1_Msk     (0x7c0UL)                 /*!< OBSSEL1 (Bitfield-Mask: 0x1f)                         */
#define CM4MCUCTRL_OBSSEL_OBSSEL0_Pos     (1UL)                     /*!< OBSSEL0 (Bit 1)                                       */
#define CM4MCUCTRL_OBSSEL_OBSSEL0_Msk     (0x3eUL)                  /*!< OBSSEL0 (Bitfield-Mask: 0x1f)                         */
#define CM4MCUCTRL_OBSSEL_OBSEN_Pos       (0UL)                     /*!< OBSEN (Bit 0)                                         */
#define CM4MCUCTRL_OBSSEL_OBSEN_Msk       (0x1UL)                   /*!< OBSEN (Bitfield-Mask: 0x01)                           */
/* ======================================================  CQFLAGSOUT  ======================================================= */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTMSPI2_Pos (16UL)                 /*!< CQOUTMSPI2 (Bit 16)                                   */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTMSPI2_Msk (0x30000UL)            /*!< CQOUTMSPI2 (Bitfield-Mask: 0x03)                      */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTMSPI1_Pos (14UL)                 /*!< CQOUTMSPI1 (Bit 14)                                   */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTMSPI1_Msk (0xc000UL)             /*!< CQOUTMSPI1 (Bitfield-Mask: 0x03)                      */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTMSPI0_Pos (12UL)                 /*!< CQOUTMSPI0 (Bit 12)                                   */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTMSPI0_Msk (0x3000UL)             /*!< CQOUTMSPI0 (Bitfield-Mask: 0x03)                      */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTIOM5_Pos (10UL)                  /*!< CQOUTIOM5 (Bit 10)                                    */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTIOM5_Msk (0xc00UL)               /*!< CQOUTIOM5 (Bitfield-Mask: 0x03)                       */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTIOM4_Pos (8UL)                   /*!< CQOUTIOM4 (Bit 8)                                     */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTIOM4_Msk (0x300UL)               /*!< CQOUTIOM4 (Bitfield-Mask: 0x03)                       */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTIOM3_Pos (6UL)                   /*!< CQOUTIOM3 (Bit 6)                                     */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTIOM3_Msk (0xc0UL)                /*!< CQOUTIOM3 (Bitfield-Mask: 0x03)                       */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTIOM2_Pos (4UL)                   /*!< CQOUTIOM2 (Bit 4)                                     */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTIOM2_Msk (0x30UL)                /*!< CQOUTIOM2 (Bitfield-Mask: 0x03)                       */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTIOM1_Pos (2UL)                   /*!< CQOUTIOM1 (Bit 2)                                     */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTIOM1_Msk (0xcUL)                 /*!< CQOUTIOM1 (Bitfield-Mask: 0x03)                       */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTIOM0_Pos (0UL)                   /*!< CQOUTIOM0 (Bit 0)                                     */
#define CM4MCUCTRL_CQFLAGSOUT_CQOUTIOM0_Msk (0x3UL)                 /*!< CQOUTIOM0 (Bitfield-Mask: 0x03)                       */
/* =======================================================  CQFLAGSIN  ======================================================= */
#define CM4MCUCTRL_CQFLAGSIN_CQINMSPI2_Pos (16UL)                   /*!< CQINMSPI2 (Bit 16)                                    */
#define CM4MCUCTRL_CQFLAGSIN_CQINMSPI2_Msk (0x30000UL)              /*!< CQINMSPI2 (Bitfield-Mask: 0x03)                       */
#define CM4MCUCTRL_CQFLAGSIN_CQINMSPI1_Pos (14UL)                   /*!< CQINMSPI1 (Bit 14)                                    */
#define CM4MCUCTRL_CQFLAGSIN_CQINMSPI1_Msk (0xc000UL)               /*!< CQINMSPI1 (Bitfield-Mask: 0x03)                       */
#define CM4MCUCTRL_CQFLAGSIN_CQINMSPI0_Pos (12UL)                   /*!< CQINMSPI0 (Bit 12)                                    */
#define CM4MCUCTRL_CQFLAGSIN_CQINMSPI0_Msk (0x3000UL)               /*!< CQINMSPI0 (Bitfield-Mask: 0x03)                       */
#define CM4MCUCTRL_CQFLAGSIN_CQINIOM5_Pos (10UL)                    /*!< CQINIOM5 (Bit 10)                                     */
#define CM4MCUCTRL_CQFLAGSIN_CQINIOM5_Msk (0xc00UL)                 /*!< CQINIOM5 (Bitfield-Mask: 0x03)                        */
#define CM4MCUCTRL_CQFLAGSIN_CQINIOM4_Pos (8UL)                     /*!< CQINIOM4 (Bit 8)                                      */
#define CM4MCUCTRL_CQFLAGSIN_CQINIOM4_Msk (0x300UL)                 /*!< CQINIOM4 (Bitfield-Mask: 0x03)                        */
#define CM4MCUCTRL_CQFLAGSIN_CQINIOM3_Pos (6UL)                     /*!< CQINIOM3 (Bit 6)                                      */
#define CM4MCUCTRL_CQFLAGSIN_CQINIOM3_Msk (0xc0UL)                  /*!< CQINIOM3 (Bitfield-Mask: 0x03)                        */
#define CM4MCUCTRL_CQFLAGSIN_CQINIOM2_Pos (4UL)                     /*!< CQINIOM2 (Bit 4)                                      */
#define CM4MCUCTRL_CQFLAGSIN_CQINIOM2_Msk (0x30UL)                  /*!< CQINIOM2 (Bitfield-Mask: 0x03)                        */
#define CM4MCUCTRL_CQFLAGSIN_CQINIOM1_Pos (2UL)                     /*!< CQINIOM1 (Bit 2)                                      */
#define CM4MCUCTRL_CQFLAGSIN_CQINIOM1_Msk (0xcUL)                   /*!< CQINIOM1 (Bitfield-Mask: 0x03)                        */
#define CM4MCUCTRL_CQFLAGSIN_CQINIOM0_Pos (0UL)                     /*!< CQINIOM0 (Bit 0)                                      */
#define CM4MCUCTRL_CQFLAGSIN_CQINIOM0_Msk (0x3UL)                   /*!< CQINIOM0 (Bitfield-Mask: 0x03)                        */
/* =======================================================  TCMWPROT  ======================================================== */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT7_Pos (7UL)                     /*!< TCMWPROT7 (Bit 7)                                     */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT7_Msk (0x80UL)                  /*!< TCMWPROT7 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT6_Pos (6UL)                     /*!< TCMWPROT6 (Bit 6)                                     */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT6_Msk (0x40UL)                  /*!< TCMWPROT6 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT5_Pos (5UL)                     /*!< TCMWPROT5 (Bit 5)                                     */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT5_Msk (0x20UL)                  /*!< TCMWPROT5 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT4_Pos (4UL)                     /*!< TCMWPROT4 (Bit 4)                                     */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT4_Msk (0x10UL)                  /*!< TCMWPROT4 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT3_Pos (3UL)                     /*!< TCMWPROT3 (Bit 3)                                     */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT3_Msk (0x8UL)                   /*!< TCMWPROT3 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT2_Pos (2UL)                     /*!< TCMWPROT2 (Bit 2)                                     */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT2_Msk (0x4UL)                   /*!< TCMWPROT2 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT1_Pos (1UL)                     /*!< TCMWPROT1 (Bit 1)                                     */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT1_Msk (0x2UL)                   /*!< TCMWPROT1 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT0_Pos (0UL)                     /*!< TCMWPROT0 (Bit 0)                                     */
#define CM4MCUCTRL_TCMWPROT_TCMWPROT0_Msk (0x1UL)                   /*!< TCMWPROT0 (Bitfield-Mask: 0x01)                       */
/* =======================================================  TCMRPROT  ======================================================== */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT7_Pos (7UL)                     /*!< TCMRPROT7 (Bit 7)                                     */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT7_Msk (0x80UL)                  /*!< TCMRPROT7 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT6_Pos (6UL)                     /*!< TCMRPROT6 (Bit 6)                                     */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT6_Msk (0x40UL)                  /*!< TCMRPROT6 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT5_Pos (5UL)                     /*!< TCMRPROT5 (Bit 5)                                     */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT5_Msk (0x20UL)                  /*!< TCMRPROT5 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT4_Pos (4UL)                     /*!< TCMRPROT4 (Bit 4)                                     */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT4_Msk (0x10UL)                  /*!< TCMRPROT4 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT3_Pos (3UL)                     /*!< TCMRPROT3 (Bit 3)                                     */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT3_Msk (0x8UL)                   /*!< TCMRPROT3 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT2_Pos (2UL)                     /*!< TCMRPROT2 (Bit 2)                                     */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT2_Msk (0x4UL)                   /*!< TCMRPROT2 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT1_Pos (1UL)                     /*!< TCMRPROT1 (Bit 1)                                     */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT1_Msk (0x2UL)                   /*!< TCMRPROT1 (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT0_Pos (0UL)                     /*!< TCMRPROT0 (Bit 0)                                     */
#define CM4MCUCTRL_TCMRPROT_TCMRPROT0_Msk (0x1UL)                   /*!< TCMRPROT0 (Bitfield-Mask: 0x01)                       */
/* ======================================================  CPUPWRCTRL  ======================================================= */
#define CM4MCUCTRL_CPUPWRCTRL_CM4NVMEN_Pos (6UL)                    /*!< CM4NVMEN (Bit 6)                                      */
#define CM4MCUCTRL_CPUPWRCTRL_CM4NVMEN_Msk (0x40UL)                 /*!< CM4NVMEN (Bitfield-Mask: 0x01)                        */
#define CM4MCUCTRL_CPUPWRCTRL_PMUEN_Pos   (5UL)                     /*!< PMUEN (Bit 5)                                         */
#define CM4MCUCTRL_CPUPWRCTRL_PMUEN_Msk   (0x20UL)                  /*!< PMUEN (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_CPUPWRCTRL_CPUCLKOVEREN_Pos (4UL)                /*!< CPUCLKOVEREN (Bit 4)                                  */
#define CM4MCUCTRL_CPUPWRCTRL_CPUCLKOVEREN_Msk (0x10UL)             /*!< CPUCLKOVEREN (Bitfield-Mask: 0x01)                    */
#define CM4MCUCTRL_CPUPWRCTRL_FCLKSTATE_Pos (3UL)                   /*!< FCLKSTATE (Bit 3)                                     */
#define CM4MCUCTRL_CPUPWRCTRL_FCLKSTATE_Msk (0x8UL)                 /*!< FCLKSTATE (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_CPUPWRCTRL_PMUCLKSTATE_Pos (2UL)                 /*!< PMUCLKSTATE (Bit 2)                                   */
#define CM4MCUCTRL_CPUPWRCTRL_PMUCLKSTATE_Msk (0x4UL)               /*!< PMUCLKSTATE (Bitfield-Mask: 0x01)                     */
#define CM4MCUCTRL_CPUPWRCTRL_SLEEPMODE_Pos (1UL)                   /*!< SLEEPMODE (Bit 1)                                     */
#define CM4MCUCTRL_CPUPWRCTRL_SLEEPMODE_Msk (0x2UL)                 /*!< SLEEPMODE (Bitfield-Mask: 0x01)                       */
#define CM4MCUCTRL_CPUPWRCTRL_DEBUGPWREN_Pos (0UL)                  /*!< DEBUGPWREN (Bit 0)                                    */
#define CM4MCUCTRL_CPUPWRCTRL_DEBUGPWREN_Msk (0x1UL)                /*!< DEBUGPWREN (Bitfield-Mask: 0x01)                      */
/* ======================================================  COREPWROFF  ======================================================= */
#define CM4MCUCTRL_COREPWROFF_CPUPWROFF_Pos (0UL)                   /*!< CPUPWROFF (Bit 0)                                     */
#define CM4MCUCTRL_COREPWROFF_CPUPWROFF_Msk (0x1UL)                 /*!< CPUPWROFF (Bitfield-Mask: 0x01)                       */
/* ======================================================  CM4TIMING0  ======================================================= */
#define CM4MCUCTRL_CM4TIMING0_VALUE0_Pos  (0UL)                     /*!< VALUE0 (Bit 0)                                        */
#define CM4MCUCTRL_CM4TIMING0_VALUE0_Msk  (0x1UL)                   /*!< VALUE0 (Bitfield-Mask: 0x01)                          */
/* ======================================================  CM4TIMING1  ======================================================= */
#define CM4MCUCTRL_CM4TIMING1_VALUE1_Pos  (0UL)                     /*!< VALUE1 (Bit 0)                                        */
#define CM4MCUCTRL_CM4TIMING1_VALUE1_Msk  (0x1UL)                   /*!< VALUE1 (Bitfield-Mask: 0x01)                          */
/* ======================================================  CM4TIMING2  ======================================================= */
#define CM4MCUCTRL_CM4TIMING2_VALUE2_Pos  (0UL)                     /*!< VALUE2 (Bit 0)                                        */
#define CM4MCUCTRL_CM4TIMING2_VALUE2_Msk  (0x1UL)                   /*!< VALUE2 (Bitfield-Mask: 0x01)                          */
/* ======================================================  CM4TIMING3  ======================================================= */
#define CM4MCUCTRL_CM4TIMING3_VALUE3_Pos  (0UL)                     /*!< VALUE3 (Bit 0)                                        */
#define CM4MCUCTRL_CM4TIMING3_VALUE3_Msk  (0x1UL)                   /*!< VALUE3 (Bitfield-Mask: 0x01)                          */
/* ======================================================  CM4TIMING4  ======================================================= */
#define CM4MCUCTRL_CM4TIMING4_VALUE4_Pos  (0UL)                     /*!< VALUE4 (Bit 0)                                        */
#define CM4MCUCTRL_CM4TIMING4_VALUE4_Msk  (0x1UL)                   /*!< VALUE4 (Bitfield-Mask: 0x01)                          */
/* ======================================================  CM4TIMING5  ======================================================= */
#define CM4MCUCTRL_CM4TIMING5_VALUE5_Pos  (0UL)                     /*!< VALUE5 (Bit 0)                                        */
#define CM4MCUCTRL_CM4TIMING5_VALUE5_Msk  (0x1UL)                   /*!< VALUE5 (Bitfield-Mask: 0x01)                          */
/* ======================================================  CM4TIMING6  ======================================================= */
#define CM4MCUCTRL_CM4TIMING6_VALUE6_Pos  (0UL)                     /*!< VALUE6 (Bit 0)                                        */
#define CM4MCUCTRL_CM4TIMING6_VALUE6_Msk  (0x1UL)                   /*!< VALUE6 (Bitfield-Mask: 0x01)                          */
/* ======================================================  CM4TIMING7  ======================================================= */
#define CM4MCUCTRL_CM4TIMING7_VALUE7_Pos  (0UL)                     /*!< VALUE7 (Bit 0)                                        */
#define CM4MCUCTRL_CM4TIMING7_VALUE7_Msk  (0x1UL)                   /*!< VALUE7 (Bitfield-Mask: 0x01)                          */
/* ====================================================  CM4TIMINGENABLE  ==================================================== */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE7_Pos (7UL)                /*!< ENABLE7 (Bit 7)                                       */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE7_Msk (0x80UL)             /*!< ENABLE7 (Bitfield-Mask: 0x01)                         */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE6_Pos (6UL)                /*!< ENABLE6 (Bit 6)                                       */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE6_Msk (0x40UL)             /*!< ENABLE6 (Bitfield-Mask: 0x01)                         */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE5_Pos (5UL)                /*!< ENABLE5 (Bit 5)                                       */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE5_Msk (0x20UL)             /*!< ENABLE5 (Bitfield-Mask: 0x01)                         */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE4_Pos (4UL)                /*!< ENABLE4 (Bit 4)                                       */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE4_Msk (0x10UL)             /*!< ENABLE4 (Bitfield-Mask: 0x01)                         */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE3_Pos (3UL)                /*!< ENABLE3 (Bit 3)                                       */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE3_Msk (0x8UL)              /*!< ENABLE3 (Bitfield-Mask: 0x01)                         */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE2_Pos (2UL)                /*!< ENABLE2 (Bit 2)                                       */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE2_Msk (0x4UL)              /*!< ENABLE2 (Bitfield-Mask: 0x01)                         */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE1_Pos (1UL)                /*!< ENABLE1 (Bit 1)                                       */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE1_Msk (0x2UL)              /*!< ENABLE1 (Bitfield-Mask: 0x01)                         */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE0_Pos (0UL)                /*!< ENABLE0 (Bit 0)                                       */
#define CM4MCUCTRL_CM4TIMINGENABLE_ENABLE0_Msk (0x1UL)              /*!< ENABLE0 (Bitfield-Mask: 0x01)                         */
/* =========================================================  INTEN  ========================================================= */
#define CM4MCUCTRL_INTEN_INT14_Pos        (14UL)                    /*!< INT14 (Bit 14)                                        */
#define CM4MCUCTRL_INTEN_INT14_Msk        (0x4000UL)                /*!< INT14 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTEN_INT13_Pos        (13UL)                    /*!< INT13 (Bit 13)                                        */
#define CM4MCUCTRL_INTEN_INT13_Msk        (0x2000UL)                /*!< INT13 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTEN_INT12_Pos        (12UL)                    /*!< INT12 (Bit 12)                                        */
#define CM4MCUCTRL_INTEN_INT12_Msk        (0x1000UL)                /*!< INT12 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTEN_INT11_Pos        (11UL)                    /*!< INT11 (Bit 11)                                        */
#define CM4MCUCTRL_INTEN_INT11_Msk        (0x800UL)                 /*!< INT11 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTEN_INT10_Pos        (10UL)                    /*!< INT10 (Bit 10)                                        */
#define CM4MCUCTRL_INTEN_INT10_Msk        (0x400UL)                 /*!< INT10 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTEN_INT9_Pos         (9UL)                     /*!< INT9 (Bit 9)                                          */
#define CM4MCUCTRL_INTEN_INT9_Msk         (0x200UL)                 /*!< INT9 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTEN_INT8_Pos         (8UL)                     /*!< INT8 (Bit 8)                                          */
#define CM4MCUCTRL_INTEN_INT8_Msk         (0x100UL)                 /*!< INT8 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTEN_INT7_Pos         (7UL)                     /*!< INT7 (Bit 7)                                          */
#define CM4MCUCTRL_INTEN_INT7_Msk         (0x80UL)                  /*!< INT7 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTEN_INT6_Pos         (6UL)                     /*!< INT6 (Bit 6)                                          */
#define CM4MCUCTRL_INTEN_INT6_Msk         (0x40UL)                  /*!< INT6 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTEN_INT5_Pos         (5UL)                     /*!< INT5 (Bit 5)                                          */
#define CM4MCUCTRL_INTEN_INT5_Msk         (0x20UL)                  /*!< INT5 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTEN_INT4_Pos         (4UL)                     /*!< INT4 (Bit 4)                                          */
#define CM4MCUCTRL_INTEN_INT4_Msk         (0x10UL)                  /*!< INT4 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTEN_INT3_Pos         (3UL)                     /*!< INT3 (Bit 3)                                          */
#define CM4MCUCTRL_INTEN_INT3_Msk         (0x8UL)                   /*!< INT3 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTEN_INT2_Pos         (2UL)                     /*!< INT2 (Bit 2)                                          */
#define CM4MCUCTRL_INTEN_INT2_Msk         (0x4UL)                   /*!< INT2 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTEN_INT1_Pos         (1UL)                     /*!< INT1 (Bit 1)                                          */
#define CM4MCUCTRL_INTEN_INT1_Msk         (0x2UL)                   /*!< INT1 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTEN_INT0_Pos         (0UL)                     /*!< INT0 (Bit 0)                                          */
#define CM4MCUCTRL_INTEN_INT0_Msk         (0x1UL)                   /*!< INT0 (Bitfield-Mask: 0x01)                            */
/* ========================================================  INTSTAT  ======================================================== */
#define CM4MCUCTRL_INTSTAT_INT14_Pos      (14UL)                    /*!< INT14 (Bit 14)                                        */
#define CM4MCUCTRL_INTSTAT_INT14_Msk      (0x4000UL)                /*!< INT14 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTSTAT_INT13_Pos      (13UL)                    /*!< INT13 (Bit 13)                                        */
#define CM4MCUCTRL_INTSTAT_INT13_Msk      (0x2000UL)                /*!< INT13 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTSTAT_INT12_Pos      (12UL)                    /*!< INT12 (Bit 12)                                        */
#define CM4MCUCTRL_INTSTAT_INT12_Msk      (0x1000UL)                /*!< INT12 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTSTAT_INT11_Pos      (11UL)                    /*!< INT11 (Bit 11)                                        */
#define CM4MCUCTRL_INTSTAT_INT11_Msk      (0x800UL)                 /*!< INT11 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTSTAT_INT10_Pos      (10UL)                    /*!< INT10 (Bit 10)                                        */
#define CM4MCUCTRL_INTSTAT_INT10_Msk      (0x400UL)                 /*!< INT10 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTSTAT_INT9_Pos       (9UL)                     /*!< INT9 (Bit 9)                                          */
#define CM4MCUCTRL_INTSTAT_INT9_Msk       (0x200UL)                 /*!< INT9 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSTAT_INT8_Pos       (8UL)                     /*!< INT8 (Bit 8)                                          */
#define CM4MCUCTRL_INTSTAT_INT8_Msk       (0x100UL)                 /*!< INT8 (Bitfield-Mask: 0x01)                            */
