AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
#define CM4MCUCTRL_INTSTAT_INT7_Pos       (7UL)                     /*!< INT7 (Bit 7)                                          */
#define CM4MCUCTRL_INTSTAT_INT7_Msk       (0x80UL)                  /*!< INT7 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSTAT_INT6_Pos       (6UL)                     /*!< INT6 (Bit 6)                                          */
#define CM4MCUCTRL_INTSTAT_INT6_Msk       (0x40UL)                  /*!< INT6 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSTAT_INT5_Pos       (5UL)                     /*!< INT5 (Bit 5)                                          */
#define CM4MCUCTRL_INTSTAT_INT5_Msk       (0x20UL)                  /*!< INT5 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSTAT_INT4_Pos       (4UL)                     /*!< INT4 (Bit 4)                                          */
#define CM4MCUCTRL_INTSTAT_INT4_Msk       (0x10UL)                  /*!< INT4 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSTAT_INT3_Pos       (3UL)                     /*!< INT3 (Bit 3)                                          */
#define CM4MCUCTRL_INTSTAT_INT3_Msk       (0x8UL)                   /*!< INT3 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSTAT_INT2_Pos       (2UL)                     /*!< INT2 (Bit 2)                                          */
#define CM4MCUCTRL_INTSTAT_INT2_Msk       (0x4UL)                   /*!< INT2 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSTAT_INT1_Pos       (1UL)                     /*!< INT1 (Bit 1)                                          */
#define CM4MCUCTRL_INTSTAT_INT1_Msk       (0x2UL)                   /*!< INT1 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSTAT_INT0_Pos       (0UL)                     /*!< INT0 (Bit 0)                                          */
#define CM4MCUCTRL_INTSTAT_INT0_Msk       (0x1UL)                   /*!< INT0 (Bitfield-Mask: 0x01)                            */
/* ========================================================  INTCLR  ========================================================= */
#define CM4MCUCTRL_INTCLR_INT14_Pos       (14UL)                    /*!< INT14 (Bit 14)                                        */
#define CM4MCUCTRL_INTCLR_INT14_Msk       (0x4000UL)                /*!< INT14 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTCLR_INT13_Pos       (13UL)                    /*!< INT13 (Bit 13)                                        */
#define CM4MCUCTRL_INTCLR_INT13_Msk       (0x2000UL)                /*!< INT13 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTCLR_INT12_Pos       (12UL)                    /*!< INT12 (Bit 12)                                        */
#define CM4MCUCTRL_INTCLR_INT12_Msk       (0x1000UL)                /*!< INT12 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTCLR_INT11_Pos       (11UL)                    /*!< INT11 (Bit 11)                                        */
#define CM4MCUCTRL_INTCLR_INT11_Msk       (0x800UL)                 /*!< INT11 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTCLR_INT10_Pos       (10UL)                    /*!< INT10 (Bit 10)                                        */
#define CM4MCUCTRL_INTCLR_INT10_Msk       (0x400UL)                 /*!< INT10 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTCLR_INT9_Pos        (9UL)                     /*!< INT9 (Bit 9)                                          */
#define CM4MCUCTRL_INTCLR_INT9_Msk        (0x200UL)                 /*!< INT9 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTCLR_INT8_Pos        (8UL)                     /*!< INT8 (Bit 8)                                          */
#define CM4MCUCTRL_INTCLR_INT8_Msk        (0x100UL)                 /*!< INT8 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTCLR_INT7_Pos        (7UL)                     /*!< INT7 (Bit 7)                                          */
#define CM4MCUCTRL_INTCLR_INT7_Msk        (0x80UL)                  /*!< INT7 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTCLR_INT6_Pos        (6UL)                     /*!< INT6 (Bit 6)                                          */
#define CM4MCUCTRL_INTCLR_INT6_Msk        (0x40UL)                  /*!< INT6 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTCLR_INT5_Pos        (5UL)                     /*!< INT5 (Bit 5)                                          */
#define CM4MCUCTRL_INTCLR_INT5_Msk        (0x20UL)                  /*!< INT5 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTCLR_INT4_Pos        (4UL)                     /*!< INT4 (Bit 4)                                          */
#define CM4MCUCTRL_INTCLR_INT4_Msk        (0x10UL)                  /*!< INT4 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTCLR_INT3_Pos        (3UL)                     /*!< INT3 (Bit 3)                                          */
#define CM4MCUCTRL_INTCLR_INT3_Msk        (0x8UL)                   /*!< INT3 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTCLR_INT2_Pos        (2UL)                     /*!< INT2 (Bit 2)                                          */
#define CM4MCUCTRL_INTCLR_INT2_Msk        (0x4UL)                   /*!< INT2 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTCLR_INT1_Pos        (1UL)                     /*!< INT1 (Bit 1)                                          */
#define CM4MCUCTRL_INTCLR_INT1_Msk        (0x2UL)                   /*!< INT1 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTCLR_INT0_Pos        (0UL)                     /*!< INT0 (Bit 0)                                          */
#define CM4MCUCTRL_INTCLR_INT0_Msk        (0x1UL)                   /*!< INT0 (Bitfield-Mask: 0x01)                            */
/* ========================================================  INTSET  ========================================================= */
#define CM4MCUCTRL_INTSET_INT14_Pos       (14UL)                    /*!< INT14 (Bit 14)                                        */
#define CM4MCUCTRL_INTSET_INT14_Msk       (0x4000UL)                /*!< INT14 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTSET_INT13_Pos       (13UL)                    /*!< INT13 (Bit 13)                                        */
#define CM4MCUCTRL_INTSET_INT13_Msk       (0x2000UL)                /*!< INT13 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTSET_INT12_Pos       (12UL)                    /*!< INT12 (Bit 12)                                        */
#define CM4MCUCTRL_INTSET_INT12_Msk       (0x1000UL)                /*!< INT12 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTSET_INT11_Pos       (11UL)                    /*!< INT11 (Bit 11)                                        */
#define CM4MCUCTRL_INTSET_INT11_Msk       (0x800UL)                 /*!< INT11 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTSET_INT10_Pos       (10UL)                    /*!< INT10 (Bit 10)                                        */
#define CM4MCUCTRL_INTSET_INT10_Msk       (0x400UL)                 /*!< INT10 (Bitfield-Mask: 0x01)                           */
#define CM4MCUCTRL_INTSET_INT9_Pos        (9UL)                     /*!< INT9 (Bit 9)                                          */
#define CM4MCUCTRL_INTSET_INT9_Msk        (0x200UL)                 /*!< INT9 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSET_INT8_Pos        (8UL)                     /*!< INT8 (Bit 8)                                          */
#define CM4MCUCTRL_INTSET_INT8_Msk        (0x100UL)                 /*!< INT8 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSET_INT7_Pos        (7UL)                     /*!< INT7 (Bit 7)                                          */
#define CM4MCUCTRL_INTSET_INT7_Msk        (0x80UL)                  /*!< INT7 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSET_INT6_Pos        (6UL)                     /*!< INT6 (Bit 6)                                          */
#define CM4MCUCTRL_INTSET_INT6_Msk        (0x40UL)                  /*!< INT6 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSET_INT5_Pos        (5UL)                     /*!< INT5 (Bit 5)                                          */
#define CM4MCUCTRL_INTSET_INT5_Msk        (0x20UL)                  /*!< INT5 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSET_INT4_Pos        (4UL)                     /*!< INT4 (Bit 4)                                          */
#define CM4MCUCTRL_INTSET_INT4_Msk        (0x10UL)                  /*!< INT4 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSET_INT3_Pos        (3UL)                     /*!< INT3 (Bit 3)                                          */
#define CM4MCUCTRL_INTSET_INT3_Msk        (0x8UL)                   /*!< INT3 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSET_INT2_Pos        (2UL)                     /*!< INT2 (Bit 2)                                          */
#define CM4MCUCTRL_INTSET_INT2_Msk        (0x4UL)                   /*!< INT2 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSET_INT1_Pos        (1UL)                     /*!< INT1 (Bit 1)                                          */
#define CM4MCUCTRL_INTSET_INT1_Msk        (0x2UL)                   /*!< INT1 (Bitfield-Mask: 0x01)                            */
#define CM4MCUCTRL_INTSET_INT0_Pos        (0UL)                     /*!< INT0 (Bit 0)                                          */
#define CM4MCUCTRL_INTSET_INT0_Msk        (0x1UL)                   /*!< INT0 (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                         CM4RADIO                                          ================ */
/* =========================================================================================================================== */

/* ======================================================  RCLKCONTROL  ====================================================== */
#define CM4RADIO_RCLKCONTROL_TPIUCLKEN_Pos (6UL)                    /*!< TPIUCLKEN (Bit 6)                                     */
#define CM4RADIO_RCLKCONTROL_TPIUCLKEN_Msk (0x40UL)                 /*!< TPIUCLKEN (Bitfield-Mask: 0x01)                       */
#define CM4RADIO_RCLKCONTROL_TPIUCLKSEL_Pos (4UL)                   /*!< TPIUCLKSEL (Bit 4)                                    */
#define CM4RADIO_RCLKCONTROL_TPIUCLKSEL_Msk (0x30UL)                /*!< TPIUCLKSEL (Bitfield-Mask: 0x03)                      */
#define CM4RADIO_RCLKCONTROL_MCUCLKSEL_Pos (3UL)                    /*!< MCUCLKSEL (Bit 3)                                     */
#define CM4RADIO_RCLKCONTROL_MCUCLKSEL_Msk (0x8UL)                  /*!< MCUCLKSEL (Bitfield-Mask: 0x01)                       */
#define CM4RADIO_RCLKCONTROL_BBCLKOVERRIDE_Pos (2UL)                /*!< BBCLKOVERRIDE (Bit 2)                                 */
#define CM4RADIO_RCLKCONTROL_BBCLKOVERRIDE_Msk (0x4UL)              /*!< BBCLKOVERRIDE (Bitfield-Mask: 0x01)                   */
#define CM4RADIO_RCLKCONTROL_BBCLKSEL_Pos (0UL)                     /*!< BBCLKSEL (Bit 0)                                      */
#define CM4RADIO_RCLKCONTROL_BBCLKSEL_Msk (0x3UL)                   /*!< BBCLKSEL (Bitfield-Mask: 0x03)                        */
/* =======================================================  RCONTROL  ======================================================== */
#define CM4RADIO_RCONTROL_OSCEN_Pos       (26UL)                    /*!< OSCEN (Bit 26)                                        */
#define CM4RADIO_RCONTROL_OSCEN_Msk       (0x4000000UL)             /*!< OSCEN (Bitfield-Mask: 0x01)                           */
#define CM4RADIO_RCONTROL_XOCONFIG_Pos    (0UL)                     /*!< XOCONFIG (Bit 0)                                      */
#define CM4RADIO_RCONTROL_XOCONFIG_Msk    (0x3ffffffUL)             /*!< XOCONFIG (Bitfield-Mask: 0x3ffffff)                   */
/* =======================================================  BBCONTROL  ======================================================= */
#define CM4RADIO_BBCONTROL_WAKEUPREQ_Pos  (0UL)                     /*!< WAKEUPREQ (Bit 0)                                     */
#define CM4RADIO_BBCONTROL_WAKEUPREQ_Msk  (0x1UL)                   /*!< WAKEUPREQ (Bitfield-Mask: 0x01)                       */
/* =======================================================  NPCONTROL  ======================================================= */
#define CM4RADIO_NPCONTROL_RXENABLED_Pos  (3UL)                     /*!< RXENABLED (Bit 3)                                     */
#define CM4RADIO_NPCONTROL_RXENABLED_Msk  (0x8UL)                   /*!< RXENABLED (Bitfield-Mask: 0x01)                       */
#define CM4RADIO_NPCONTROL_TXENABLED_Pos  (2UL)                     /*!< TXENABLED (Bit 2)                                     */
#define CM4RADIO_NPCONTROL_TXENABLED_Msk  (0x4UL)                   /*!< TXENABLED (Bitfield-Mask: 0x01)                       */
#define CM4RADIO_NPCONTROL_NPWDREN_Pos    (1UL)                     /*!< NPWDREN (Bit 1)                                       */
#define CM4RADIO_NPCONTROL_NPWDREN_Msk    (0x2UL)                   /*!< NPWDREN (Bitfield-Mask: 0x01)                         */
#define CM4RADIO_NPCONTROL_NPSWRSTDBG_Pos (0UL)                     /*!< NPSWRSTDBG (Bit 0)                                    */
#define CM4RADIO_NPCONTROL_NPSWRSTDBG_Msk (0x1UL)                   /*!< NPSWRSTDBG (Bitfield-Mask: 0x01)                      */
/* =======================================================  RADIOSTAT  ======================================================= */
#define CM4RADIO_RADIOSTAT_NPSWPORSTAT_Pos (4UL)                    /*!< NPSWPORSTAT (Bit 4)                                   */
#define CM4RADIO_RADIOSTAT_NPSWPORSTAT_Msk (0x10UL)                 /*!< NPSWPORSTAT (Bitfield-Mask: 0x01)                     */
#define CM4RADIO_RADIOSTAT_NPWDRSTAT_Pos  (3UL)                     /*!< NPWDRSTAT (Bit 3)                                     */
#define CM4RADIO_RADIOSTAT_NPWDRSTAT_Msk  (0x8UL)                   /*!< NPWDRSTAT (Bitfield-Mask: 0x01)                       */
#define CM4RADIO_RADIOSTAT_NPDBGRSTAT_Pos (2UL)                     /*!< NPDBGRSTAT (Bit 2)                                    */
#define CM4RADIO_RADIOSTAT_NPDBGRSTAT_Msk (0x4UL)                   /*!< NPDBGRSTAT (Bitfield-Mask: 0x01)                      */
#define CM4RADIO_RADIOSTAT_NPAIRCRSTAT_Pos (1UL)                    /*!< NPAIRCRSTAT (Bit 1)                                   */
#define CM4RADIO_RADIOSTAT_NPAIRCRSTAT_Msk (0x2UL)                  /*!< NPAIRCRSTAT (Bitfield-Mask: 0x01)                     */
#define CM4RADIO_RADIOSTAT_NPCLRSTAT_Pos  (0UL)                     /*!< NPCLRSTAT (Bit 0)                                     */
#define CM4RADIO_RADIOSTAT_NPCLRSTAT_Msk  (0x1UL)                   /*!< NPCLRSTAT (Bitfield-Mask: 0x01)                       */
/* ========================================================  NPSWPOR  ======================================================== */
#define CM4RADIO_NPSWPOR_NPSWPORKEY_Pos   (0UL)                     /*!< NPSWPORKEY (Bit 0)                                    */
#define CM4RADIO_NPSWPOR_NPSWPORKEY_Msk   (0xffUL)                  /*!< NPSWPORKEY (Bitfield-Mask: 0xff)                      */
/* =========================================================  RTUNE  ========================================================= */
#define CM4RADIO_RTUNE_REFELDOMISC_Pos    (17UL)                    /*!< REFELDOMISC (Bit 17)                                  */
#define CM4RADIO_RTUNE_REFELDOMISC_Msk    (0xe0000UL)               /*!< REFELDOMISC (Bitfield-Mask: 0x07)                     */
#define CM4RADIO_RTUNE_REFELDOVREF_Pos    (10UL)                    /*!< REFELDOVREF (Bit 10)                                  */
#define CM4RADIO_RTUNE_REFELDOVREF_Msk    (0x1fc00UL)               /*!< REFELDOVREF (Bitfield-Mask: 0x7f)                     */
#define CM4RADIO_RTUNE_DIGLDOCTRL_Pos     (7UL)                     /*!< DIGLDOCTRL (Bit 7)                                    */
#define CM4RADIO_RTUNE_DIGLDOCTRL_Msk     (0x380UL)                 /*!< DIGLDOCTRL (Bitfield-Mask: 0x07)                      */
#define CM4RADIO_RTUNE_DIGLDOVREF_Pos     (0UL)                     /*!< DIGLDOVREF (Bit 0)                                    */
#define CM4RADIO_RTUNE_DIGLDOVREF_Msk     (0x7fUL)                  /*!< DIGLDOVREF (Bitfield-Mask: 0x7f)                      */
/* ========================================================  DBGCTRL  ======================================================== */
#define CM4RADIO_DBGCTRL_OBSEN_Pos        (4UL)                     /*!< OBSEN (Bit 4)                                         */
#define CM4RADIO_DBGCTRL_OBSEN_Msk        (0x10UL)                  /*!< OBSEN (Bitfield-Mask: 0x01)                           */
#define CM4RADIO_DBGCTRL_OBSSEL_Pos       (0UL)                     /*!< OBSSEL (Bit 0)                                        */
#define CM4RADIO_DBGCTRL_OBSSEL_Msk       (0xfUL)                   /*!< OBSSEL (Bitfield-Mask: 0x0f)                          */
/* =====================================================  WLANCOEXCTRL  ====================================================== */
#define CM4RADIO_WLANCOEXCTRL_CHANRANGETOP_Pos (24UL)               /*!< CHANRANGETOP (Bit 24)                                 */
#define CM4RADIO_WLANCOEXCTRL_CHANRANGETOP_Msk (0xff000000UL)       /*!< CHANRANGETOP (Bitfield-Mask: 0xff)                    */
#define CM4RADIO_WLANCOEXCTRL_CHANRANGEBOTTOM_Pos (16UL)            /*!< CHANRANGEBOTTOM (Bit 16)                              */
#define CM4RADIO_WLANCOEXCTRL_CHANRANGEBOTTOM_Msk (0xff0000UL)      /*!< CHANRANGEBOTTOM (Bitfield-Mask: 0xff)                 */
#define CM4RADIO_WLANCOEXCTRL_GRANTINV_Pos (4UL)                    /*!< GRANTINV (Bit 4)                                      */
#define CM4RADIO_WLANCOEXCTRL_GRANTINV_Msk (0x10UL)                 /*!< GRANTINV (Bitfield-Mask: 0x01)                        */
#define CM4RADIO_WLANCOEXCTRL_REQINV_Pos  (3UL)                     /*!< REQINV (Bit 3)                                        */
#define CM4RADIO_WLANCOEXCTRL_REQINV_Msk  (0x8UL)                   /*!< REQINV (Bitfield-Mask: 0x01)                          */
#define CM4RADIO_WLANCOEXCTRL_PRIORITYINV_Pos (2UL)                 /*!< PRIORITYINV (Bit 2)                                   */
#define CM4RADIO_WLANCOEXCTRL_PRIORITYINV_Msk (0x4UL)               /*!< PRIORITYINV (Bitfield-Mask: 0x01)                     */
#define CM4RADIO_WLANCOEXCTRL_FREQINV_Pos (1UL)                     /*!< FREQINV (Bit 1)                                       */
#define CM4RADIO_WLANCOEXCTRL_FREQINV_Msk (0x2UL)                   /*!< FREQINV (Bitfield-Mask: 0x01)                         */
#define CM4RADIO_WLANCOEXCTRL_WLANCOEXIFEN_Pos (0UL)                /*!< WLANCOEXIFEN (Bit 0)                                  */
#define CM4RADIO_WLANCOEXCTRL_WLANCOEXIFEN_Msk (0x1UL)              /*!< WLANCOEXIFEN (Bitfield-Mask: 0x01)                    */
/* ======================================================  WCICOEXCTRL  ====================================================== */
#define CM4RADIO_WCICOEXCTRL_WCICOEXIFSEL_Pos (0UL)                 /*!< WCICOEXIFSEL (Bit 0)                                  */
#define CM4RADIO_WCICOEXCTRL_WCICOEXIFSEL_Msk (0x3UL)               /*!< WCICOEXIFSEL (Bitfield-Mask: 0x03)                    */
/* =====================================================  EXTRFDIRCTRL  ====================================================== */
#define CM4RADIO_EXTRFDIRCTRL_RXENSEL_Pos (27UL)                    /*!< RXENSEL (Bit 27)                                      */
#define CM4RADIO_EXTRFDIRCTRL_RXENSEL_Msk (0x18000000UL)            /*!< RXENSEL (Bitfield-Mask: 0x03)                         */
#define CM4RADIO_EXTRFDIRCTRL_TXENSEL_Pos (25UL)                    /*!< TXENSEL (Bit 25)                                      */
#define CM4RADIO_EXTRFDIRCTRL_TXENSEL_Msk (0x6000000UL)             /*!< TXENSEL (Bitfield-Mask: 0x03)                         */
#define CM4RADIO_EXTRFDIRCTRL_RXENBIT_Pos (1UL)                     /*!< RXENBIT (Bit 1)                                       */
#define CM4RADIO_EXTRFDIRCTRL_RXENBIT_Msk (0x2UL)                   /*!< RXENBIT (Bitfield-Mask: 0x01)                         */
#define CM4RADIO_EXTRFDIRCTRL_TXENBIT_Pos (0UL)                     /*!< TXENBIT (Bit 0)                                       */
#define CM4RADIO_EXTRFDIRCTRL_TXENBIT_Msk (0x1UL)                   /*!< TXENBIT (Bitfield-Mask: 0x01)                         */


/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

