AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* =========================================================  STCFG  ========================================================= */
#define CM4STIMER_STCFG_FREEZE_Pos        (31UL)                    /*!< FREEZE (Bit 31)                                       */
#define CM4STIMER_STCFG_FREEZE_Msk        (0x80000000UL)            /*!< FREEZE (Bitfield-Mask: 0x01)                          */
#define CM4STIMER_STCFG_CLEAR_Pos         (30UL)                    /*!< CLEAR (Bit 30)                                        */
#define CM4STIMER_STCFG_CLEAR_Msk         (0x40000000UL)            /*!< CLEAR (Bitfield-Mask: 0x01)                           */
#define CM4STIMER_STCFG_COMPAREHEN_Pos    (15UL)                    /*!< COMPAREHEN (Bit 15)                                   */
#define CM4STIMER_STCFG_COMPAREHEN_Msk    (0x8000UL)                /*!< COMPAREHEN (Bitfield-Mask: 0x01)                      */
#define CM4STIMER_STCFG_COMPAREGEN_Pos    (14UL)                    /*!< COMPAREGEN (Bit 14)                                   */
#define CM4STIMER_STCFG_COMPAREGEN_Msk    (0x4000UL)                /*!< COMPAREGEN (Bitfield-Mask: 0x01)                      */
#define CM4STIMER_STCFG_COMPAREFEN_Pos    (13UL)                    /*!< COMPAREFEN (Bit 13)                                   */
#define CM4STIMER_STCFG_COMPAREFEN_Msk    (0x2000UL)                /*!< COMPAREFEN (Bitfield-Mask: 0x01)                      */
#define CM4STIMER_STCFG_COMPAREEEN_Pos    (12UL)                    /*!< COMPAREEEN (Bit 12)                                   */
#define CM4STIMER_STCFG_COMPAREEEN_Msk    (0x1000UL)                /*!< COMPAREEEN (Bitfield-Mask: 0x01)                      */
#define CM4STIMER_STCFG_COMPAREDEN_Pos    (11UL)                    /*!< COMPAREDEN (Bit 11)                                   */
#define CM4STIMER_STCFG_COMPAREDEN_Msk    (0x800UL)                 /*!< COMPAREDEN (Bitfield-Mask: 0x01)                      */
#define CM4STIMER_STCFG_COMPARECEN_Pos    (10UL)                    /*!< COMPARECEN (Bit 10)                                   */
#define CM4STIMER_STCFG_COMPARECEN_Msk    (0x400UL)                 /*!< COMPARECEN (Bitfield-Mask: 0x01)                      */
#define CM4STIMER_STCFG_COMPAREBEN_Pos    (9UL)                     /*!< COMPAREBEN (Bit 9)                                    */
#define CM4STIMER_STCFG_COMPAREBEN_Msk    (0x200UL)                 /*!< COMPAREBEN (Bitfield-Mask: 0x01)                      */
#define CM4STIMER_STCFG_COMPAREAEN_Pos    (8UL)                     /*!< COMPAREAEN (Bit 8)                                    */
#define CM4STIMER_STCFG_COMPAREAEN_Msk    (0x100UL)                 /*!< COMPAREAEN (Bitfield-Mask: 0x01)                      */
#define CM4STIMER_STCFG_CLKSEL_Pos        (0UL)                     /*!< CLKSEL (Bit 0)                                        */
#define CM4STIMER_STCFG_CLKSEL_Msk        (0xfUL)                   /*!< CLKSEL (Bitfield-Mask: 0x0f)                          */
/* =========================================================  STTMR  ========================================================= */
#define CM4STIMER_STTMR_STTMR_Pos         (0UL)                     /*!< STTMR (Bit 0)                                         */
#define CM4STIMER_STTMR_STTMR_Msk         (0xffffffffUL)            /*!< STTMR (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  SCAPCTRL0  ======================================================= */
#define CM4STIMER_SCAPCTRL0_CAPTURE0_Pos  (9UL)                     /*!< CAPTURE0 (Bit 9)                                      */
#define CM4STIMER_SCAPCTRL0_CAPTURE0_Msk  (0x200UL)                 /*!< CAPTURE0 (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_SCAPCTRL0_STPOL0_Pos    (8UL)                     /*!< STPOL0 (Bit 8)                                        */
#define CM4STIMER_SCAPCTRL0_STPOL0_Msk    (0x100UL)                 /*!< STPOL0 (Bitfield-Mask: 0x01)                          */
#define CM4STIMER_SCAPCTRL0_STSEL0_Pos    (0UL)                     /*!< STSEL0 (Bit 0)                                        */
#define CM4STIMER_SCAPCTRL0_STSEL0_Msk    (0x7fUL)                  /*!< STSEL0 (Bitfield-Mask: 0x7f)                          */
/* =======================================================  SCAPCTRL1  ======================================================= */
#define CM4STIMER_SCAPCTRL1_CAPTURE1_Pos  (9UL)                     /*!< CAPTURE1 (Bit 9)                                      */
#define CM4STIMER_SCAPCTRL1_CAPTURE1_Msk  (0x200UL)                 /*!< CAPTURE1 (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_SCAPCTRL1_STPOL1_Pos    (8UL)                     /*!< STPOL1 (Bit 8)                                        */
#define CM4STIMER_SCAPCTRL1_STPOL1_Msk    (0x100UL)                 /*!< STPOL1 (Bitfield-Mask: 0x01)                          */
#define CM4STIMER_SCAPCTRL1_STSEL1_Pos    (0UL)                     /*!< STSEL1 (Bit 0)                                        */
#define CM4STIMER_SCAPCTRL1_STSEL1_Msk    (0x7fUL)                  /*!< STSEL1 (Bitfield-Mask: 0x7f)                          */
/* =======================================================  SCAPCTRL2  ======================================================= */
#define CM4STIMER_SCAPCTRL2_CAPTURE2_Pos  (9UL)                     /*!< CAPTURE2 (Bit 9)                                      */
#define CM4STIMER_SCAPCTRL2_CAPTURE2_Msk  (0x200UL)                 /*!< CAPTURE2 (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_SCAPCTRL2_STPOL2_Pos    (8UL)                     /*!< STPOL2 (Bit 8)                                        */
#define CM4STIMER_SCAPCTRL2_STPOL2_Msk    (0x100UL)                 /*!< STPOL2 (Bitfield-Mask: 0x01)                          */
#define CM4STIMER_SCAPCTRL2_STSEL2_Pos    (0UL)                     /*!< STSEL2 (Bit 0)                                        */
#define CM4STIMER_SCAPCTRL2_STSEL2_Msk    (0x7fUL)                  /*!< STSEL2 (Bitfield-Mask: 0x7f)                          */
/* =======================================================  SCAPCTRL3  ======================================================= */
#define CM4STIMER_SCAPCTRL3_CAPTURE3_Pos  (9UL)                     /*!< CAPTURE3 (Bit 9)                                      */
#define CM4STIMER_SCAPCTRL3_CAPTURE3_Msk  (0x200UL)                 /*!< CAPTURE3 (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_SCAPCTRL3_STPOL3_Pos    (8UL)                     /*!< STPOL3 (Bit 8)                                        */
#define CM4STIMER_SCAPCTRL3_STPOL3_Msk    (0x100UL)                 /*!< STPOL3 (Bitfield-Mask: 0x01)                          */
#define CM4STIMER_SCAPCTRL3_STSEL3_Pos    (0UL)                     /*!< STSEL3 (Bit 0)                                        */
#define CM4STIMER_SCAPCTRL3_STSEL3_Msk    (0x7fUL)                  /*!< STSEL3 (Bitfield-Mask: 0x7f)                          */
/* ========================================================  SCMPR0  ========================================================= */
#define CM4STIMER_SCMPR0_SCMPR0_Pos       (0UL)                     /*!< SCMPR0 (Bit 0)                                        */
#define CM4STIMER_SCMPR0_SCMPR0_Msk       (0xffffffffUL)            /*!< SCMPR0 (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  SCMPR1  ========================================================= */
#define CM4STIMER_SCMPR1_SCMPR1_Pos       (0UL)                     /*!< SCMPR1 (Bit 0)                                        */
#define CM4STIMER_SCMPR1_SCMPR1_Msk       (0xffffffffUL)            /*!< SCMPR1 (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  SCMPR2  ========================================================= */
#define CM4STIMER_SCMPR2_SCMPR2_Pos       (0UL)                     /*!< SCMPR2 (Bit 0)                                        */
#define CM4STIMER_SCMPR2_SCMPR2_Msk       (0xffffffffUL)            /*!< SCMPR2 (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  SCMPR3  ========================================================= */
#define CM4STIMER_SCMPR3_SCMPR3_Pos       (0UL)                     /*!< SCMPR3 (Bit 0)                                        */
#define CM4STIMER_SCMPR3_SCMPR3_Msk       (0xffffffffUL)            /*!< SCMPR3 (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  SCMPR4  ========================================================= */
#define CM4STIMER_SCMPR4_SCMPR4_Pos       (0UL)                     /*!< SCMPR4 (Bit 0)                                        */
#define CM4STIMER_SCMPR4_SCMPR4_Msk       (0xffffffffUL)            /*!< SCMPR4 (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  SCMPR5  ========================================================= */
#define CM4STIMER_SCMPR5_SCMPR5_Pos       (0UL)                     /*!< SCMPR5 (Bit 0)                                        */
#define CM4STIMER_SCMPR5_SCMPR5_Msk       (0xffffffffUL)            /*!< SCMPR5 (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  SCMPR6  ========================================================= */
#define CM4STIMER_SCMPR6_SCMPR6_Pos       (0UL)                     /*!< SCMPR6 (Bit 0)                                        */
#define CM4STIMER_SCMPR6_SCMPR6_Msk       (0xffffffffUL)            /*!< SCMPR6 (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  SCMPR7  ========================================================= */
#define CM4STIMER_SCMPR7_SCMPR7_Pos       (0UL)                     /*!< SCMPR7 (Bit 0)                                        */
#define CM4STIMER_SCMPR7_SCMPR7_Msk       (0xffffffffUL)            /*!< SCMPR7 (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  SCAPT0  ========================================================= */
#define CM4STIMER_SCAPT0_SCAPT0_Pos       (0UL)                     /*!< SCAPT0 (Bit 0)                                        */
#define CM4STIMER_SCAPT0_SCAPT0_Msk       (0xffffffffUL)            /*!< SCAPT0 (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  SCAPT1  ========================================================= */
#define CM4STIMER_SCAPT1_SCAPT1_Pos       (0UL)                     /*!< SCAPT1 (Bit 0)                                        */
#define CM4STIMER_SCAPT1_SCAPT1_Msk       (0xffffffffUL)            /*!< SCAPT1 (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  SCAPT2  ========================================================= */
#define CM4STIMER_SCAPT2_SCAPT2_Pos       (0UL)                     /*!< SCAPT2 (Bit 0)                                        */
#define CM4STIMER_SCAPT2_SCAPT2_Msk       (0xffffffffUL)            /*!< SCAPT2 (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  SCAPT3  ========================================================= */
#define CM4STIMER_SCAPT3_SCAPT3_Pos       (0UL)                     /*!< SCAPT3 (Bit 0)                                        */
#define CM4STIMER_SCAPT3_SCAPT3_Msk       (0xffffffffUL)            /*!< SCAPT3 (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  SNVR0  ========================================================= */
#define CM4STIMER_SNVR0_SNVR0_Pos         (0UL)                     /*!< SNVR0 (Bit 0)                                         */
#define CM4STIMER_SNVR0_SNVR0_Msk         (0xffffffffUL)            /*!< SNVR0 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  SNVR1  ========================================================= */
#define CM4STIMER_SNVR1_SNVR1_Pos         (0UL)                     /*!< SNVR1 (Bit 0)                                         */
#define CM4STIMER_SNVR1_SNVR1_Msk         (0xffffffffUL)            /*!< SNVR1 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  SNVR2  ========================================================= */
#define CM4STIMER_SNVR2_SNVR2_Pos         (0UL)                     /*!< SNVR2 (Bit 0)                                         */
#define CM4STIMER_SNVR2_SNVR2_Msk         (0xffffffffUL)            /*!< SNVR2 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  SNVR3  ========================================================= */
#define CM4STIMER_SNVR3_SNVR3_Pos         (0UL)                     /*!< SNVR3 (Bit 0)                                         */
#define CM4STIMER_SNVR3_SNVR3_Msk         (0xffffffffUL)            /*!< SNVR3 (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  STMINTEN  ======================================================== */
#define CM4STIMER_STMINTEN_CAPTURED_Pos   (12UL)                    /*!< CAPTURED (Bit 12)                                     */
#define CM4STIMER_STMINTEN_CAPTURED_Msk   (0x1000UL)                /*!< CAPTURED (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTEN_CAPTUREC_Pos   (11UL)                    /*!< CAPTUREC (Bit 11)                                     */
#define CM4STIMER_STMINTEN_CAPTUREC_Msk   (0x800UL)                 /*!< CAPTUREC (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTEN_CAPTUREB_Pos   (10UL)                    /*!< CAPTUREB (Bit 10)                                     */
#define CM4STIMER_STMINTEN_CAPTUREB_Msk   (0x400UL)                 /*!< CAPTUREB (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTEN_CAPTUREA_Pos   (9UL)                     /*!< CAPTUREA (Bit 9)                                      */
#define CM4STIMER_STMINTEN_CAPTUREA_Msk   (0x200UL)                 /*!< CAPTUREA (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTEN_OVERFLOW_Pos   (8UL)                     /*!< OVERFLOW (Bit 8)                                      */
#define CM4STIMER_STMINTEN_OVERFLOW_Msk   (0x100UL)                 /*!< OVERFLOW (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTEN_COMPAREH_Pos   (7UL)                     /*!< COMPAREH (Bit 7)                                      */
#define CM4STIMER_STMINTEN_COMPAREH_Msk   (0x80UL)                  /*!< COMPAREH (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTEN_COMPAREG_Pos   (6UL)                     /*!< COMPAREG (Bit 6)                                      */
#define CM4STIMER_STMINTEN_COMPAREG_Msk   (0x40UL)                  /*!< COMPAREG (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTEN_COMPAREF_Pos   (5UL)                     /*!< COMPAREF (Bit 5)                                      */
#define CM4STIMER_STMINTEN_COMPAREF_Msk   (0x20UL)                  /*!< COMPAREF (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTEN_COMPAREE_Pos   (4UL)                     /*!< COMPAREE (Bit 4)                                      */
#define CM4STIMER_STMINTEN_COMPAREE_Msk   (0x10UL)                  /*!< COMPAREE (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTEN_COMPARED_Pos   (3UL)                     /*!< COMPARED (Bit 3)                                      */
#define CM4STIMER_STMINTEN_COMPARED_Msk   (0x8UL)                   /*!< COMPARED (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTEN_COMPAREC_Pos   (2UL)                     /*!< COMPAREC (Bit 2)                                      */
#define CM4STIMER_STMINTEN_COMPAREC_Msk   (0x4UL)                   /*!< COMPAREC (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTEN_COMPAREB_Pos   (1UL)                     /*!< COMPAREB (Bit 1)                                      */
#define CM4STIMER_STMINTEN_COMPAREB_Msk   (0x2UL)                   /*!< COMPAREB (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTEN_COMPAREA_Pos   (0UL)                     /*!< COMPAREA (Bit 0)                                      */
#define CM4STIMER_STMINTEN_COMPAREA_Msk   (0x1UL)                   /*!< COMPAREA (Bitfield-Mask: 0x01)                        */
/* ======================================================  STMINTSTAT  ======================================================= */
#define CM4STIMER_STMINTSTAT_CAPTURED_Pos (12UL)                    /*!< CAPTURED (Bit 12)                                     */
#define CM4STIMER_STMINTSTAT_CAPTURED_Msk (0x1000UL)                /*!< CAPTURED (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSTAT_CAPTUREC_Pos (11UL)                    /*!< CAPTUREC (Bit 11)                                     */
#define CM4STIMER_STMINTSTAT_CAPTUREC_Msk (0x800UL)                 /*!< CAPTUREC (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSTAT_CAPTUREB_Pos (10UL)                    /*!< CAPTUREB (Bit 10)                                     */
#define CM4STIMER_STMINTSTAT_CAPTUREB_Msk (0x400UL)                 /*!< CAPTUREB (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSTAT_CAPTUREA_Pos (9UL)                     /*!< CAPTUREA (Bit 9)                                      */
#define CM4STIMER_STMINTSTAT_CAPTUREA_Msk (0x200UL)                 /*!< CAPTUREA (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSTAT_OVERFLOW_Pos (8UL)                     /*!< OVERFLOW (Bit 8)                                      */
#define CM4STIMER_STMINTSTAT_OVERFLOW_Msk (0x100UL)                 /*!< OVERFLOW (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSTAT_COMPAREH_Pos (7UL)                     /*!< COMPAREH (Bit 7)                                      */
#define CM4STIMER_STMINTSTAT_COMPAREH_Msk (0x80UL)                  /*!< COMPAREH (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSTAT_COMPAREG_Pos (6UL)                     /*!< COMPAREG (Bit 6)                                      */
#define CM4STIMER_STMINTSTAT_COMPAREG_Msk (0x40UL)                  /*!< COMPAREG (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSTAT_COMPAREF_Pos (5UL)                     /*!< COMPAREF (Bit 5)                                      */
#define CM4STIMER_STMINTSTAT_COMPAREF_Msk (0x20UL)                  /*!< COMPAREF (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSTAT_COMPAREE_Pos (4UL)                     /*!< COMPAREE (Bit 4)                                      */
#define CM4STIMER_STMINTSTAT_COMPAREE_Msk (0x10UL)                  /*!< COMPAREE (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSTAT_COMPARED_Pos (3UL)                     /*!< COMPARED (Bit 3)                                      */
#define CM4STIMER_STMINTSTAT_COMPARED_Msk (0x8UL)                   /*!< COMPARED (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSTAT_COMPAREC_Pos (2UL)                     /*!< COMPAREC (Bit 2)                                      */
#define CM4STIMER_STMINTSTAT_COMPAREC_Msk (0x4UL)                   /*!< COMPAREC (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSTAT_COMPAREB_Pos (1UL)                     /*!< COMPAREB (Bit 1)                                      */
#define CM4STIMER_STMINTSTAT_COMPAREB_Msk (0x2UL)                   /*!< COMPAREB (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSTAT_COMPAREA_Pos (0UL)                     /*!< COMPAREA (Bit 0)                                      */
#define CM4STIMER_STMINTSTAT_COMPAREA_Msk (0x1UL)                   /*!< COMPAREA (Bitfield-Mask: 0x01)                        */
/* =======================================================  STMINTCLR  ======================================================= */
#define CM4STIMER_STMINTCLR_CAPTURED_Pos  (12UL)                    /*!< CAPTURED (Bit 12)                                     */
#define CM4STIMER_STMINTCLR_CAPTURED_Msk  (0x1000UL)                /*!< CAPTURED (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTCLR_CAPTUREC_Pos  (11UL)                    /*!< CAPTUREC (Bit 11)                                     */
#define CM4STIMER_STMINTCLR_CAPTUREC_Msk  (0x800UL)                 /*!< CAPTUREC (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTCLR_CAPTUREB_Pos  (10UL)                    /*!< CAPTUREB (Bit 10)                                     */
#define CM4STIMER_STMINTCLR_CAPTUREB_Msk  (0x400UL)                 /*!< CAPTUREB (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTCLR_CAPTUREA_Pos  (9UL)                     /*!< CAPTUREA (Bit 9)                                      */
#define CM4STIMER_STMINTCLR_CAPTUREA_Msk  (0x200UL)                 /*!< CAPTUREA (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTCLR_OVERFLOW_Pos  (8UL)                     /*!< OVERFLOW (Bit 8)                                      */
#define CM4STIMER_STMINTCLR_OVERFLOW_Msk  (0x100UL)                 /*!< OVERFLOW (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTCLR_COMPAREH_Pos  (7UL)                     /*!< COMPAREH (Bit 7)                                      */
#define CM4STIMER_STMINTCLR_COMPAREH_Msk  (0x80UL)                  /*!< COMPAREH (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTCLR_COMPAREG_Pos  (6UL)                     /*!< COMPAREG (Bit 6)                                      */
#define CM4STIMER_STMINTCLR_COMPAREG_Msk  (0x40UL)                  /*!< COMPAREG (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTCLR_COMPAREF_Pos  (5UL)                     /*!< COMPAREF (Bit 5)                                      */
#define CM4STIMER_STMINTCLR_COMPAREF_Msk  (0x20UL)                  /*!< COMPAREF (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTCLR_COMPAREE_Pos  (4UL)                     /*!< COMPAREE (Bit 4)                                      */
#define CM4STIMER_STMINTCLR_COMPAREE_Msk  (0x10UL)                  /*!< COMPAREE (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTCLR_COMPARED_Pos  (3UL)                     /*!< COMPARED (Bit 3)                                      */
#define CM4STIMER_STMINTCLR_COMPARED_Msk  (0x8UL)                   /*!< COMPARED (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTCLR_COMPAREC_Pos  (2UL)                     /*!< COMPAREC (Bit 2)                                      */
#define CM4STIMER_STMINTCLR_COMPAREC_Msk  (0x4UL)                   /*!< COMPAREC (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTCLR_COMPAREB_Pos  (1UL)                     /*!< COMPAREB (Bit 1)                                      */
#define CM4STIMER_STMINTCLR_COMPAREB_Msk  (0x2UL)                   /*!< COMPAREB (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTCLR_COMPAREA_Pos  (0UL)                     /*!< COMPAREA (Bit 0)                                      */
#define CM4STIMER_STMINTCLR_COMPAREA_Msk  (0x1UL)                   /*!< COMPAREA (Bitfield-Mask: 0x01)                        */
/* =======================================================  STMINTSET  ======================================================= */
