AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
#define CM4STIMER_STMINTSET_CAPTURED_Pos  (12UL)                    /*!< CAPTURED (Bit 12)                                     */
#define CM4STIMER_STMINTSET_CAPTURED_Msk  (0x1000UL)                /*!< CAPTURED (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSET_CAPTUREC_Pos  (11UL)                    /*!< CAPTUREC (Bit 11)                                     */
#define CM4STIMER_STMINTSET_CAPTUREC_Msk  (0x800UL)                 /*!< CAPTUREC (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSET_CAPTUREB_Pos  (10UL)                    /*!< CAPTUREB (Bit 10)                                     */
#define CM4STIMER_STMINTSET_CAPTUREB_Msk  (0x400UL)                 /*!< CAPTUREB (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSET_CAPTUREA_Pos  (9UL)                     /*!< CAPTUREA (Bit 9)                                      */
#define CM4STIMER_STMINTSET_CAPTUREA_Msk  (0x200UL)                 /*!< CAPTUREA (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSET_OVERFLOW_Pos  (8UL)                     /*!< OVERFLOW (Bit 8)                                      */
#define CM4STIMER_STMINTSET_OVERFLOW_Msk  (0x100UL)                 /*!< OVERFLOW (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSET_COMPAREH_Pos  (7UL)                     /*!< COMPAREH (Bit 7)                                      */
#define CM4STIMER_STMINTSET_COMPAREH_Msk  (0x80UL)                  /*!< COMPAREH (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSET_COMPAREG_Pos  (6UL)                     /*!< COMPAREG (Bit 6)                                      */
#define CM4STIMER_STMINTSET_COMPAREG_Msk  (0x40UL)                  /*!< COMPAREG (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSET_COMPAREF_Pos  (5UL)                     /*!< COMPAREF (Bit 5)                                      */
#define CM4STIMER_STMINTSET_COMPAREF_Msk  (0x20UL)                  /*!< COMPAREF (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSET_COMPAREE_Pos  (4UL)                     /*!< COMPAREE (Bit 4)                                      */
#define CM4STIMER_STMINTSET_COMPAREE_Msk  (0x10UL)                  /*!< COMPAREE (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSET_COMPARED_Pos  (3UL)                     /*!< COMPARED (Bit 3)                                      */
#define CM4STIMER_STMINTSET_COMPARED_Msk  (0x8UL)                   /*!< COMPARED (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSET_COMPAREC_Pos  (2UL)                     /*!< COMPAREC (Bit 2)                                      */
#define CM4STIMER_STMINTSET_COMPAREC_Msk  (0x4UL)                   /*!< COMPAREC (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSET_COMPAREB_Pos  (1UL)                     /*!< COMPAREB (Bit 1)                                      */
#define CM4STIMER_STMINTSET_COMPAREB_Msk  (0x2UL)                   /*!< COMPAREB (Bitfield-Mask: 0x01)                        */
#define CM4STIMER_STMINTSET_COMPAREA_Pos  (0UL)                     /*!< COMPAREA (Bit 0)                                      */
#define CM4STIMER_STMINTSET_COMPAREA_Msk  (0x1UL)                   /*!< COMPAREA (Bitfield-Mask: 0x01)                        */


/* =========================================================================================================================== */
/* ================                                         CM4TIMER                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
#define CM4TIMER_CTRL_RESET_Pos           (31UL)                    /*!< RESET (Bit 31)                                        */
#define CM4TIMER_CTRL_RESET_Msk           (0x80000000UL)            /*!< RESET (Bitfield-Mask: 0x01)                           */
/* ========================================================  STATUS  ========================================================= */
#define CM4TIMER_STATUS_NTIMERS_Pos       (16UL)                    /*!< NTIMERS (Bit 16)                                      */
#define CM4TIMER_STATUS_NTIMERS_Msk       (0x1f0000UL)              /*!< NTIMERS (Bitfield-Mask: 0x1f)                         */
#define CM4TIMER_STATUS_ACTIVE_Pos        (0UL)                     /*!< ACTIVE (Bit 0)                                        */
#define CM4TIMER_STATUS_ACTIVE_Msk        (0xffffUL)                /*!< ACTIVE (Bitfield-Mask: 0xffff)                        */
/* ========================================================  GLOBEN  ========================================================= */
#define CM4TIMER_GLOBEN_ADCEN_Pos         (30UL)                    /*!< ADCEN (Bit 30)                                        */
#define CM4TIMER_GLOBEN_ADCEN_Msk         (0x40000000UL)            /*!< ADCEN (Bitfield-Mask: 0x01)                           */
#define CM4TIMER_GLOBEN_ENABLEALLINPUTS_Pos (29UL)                  /*!< ENABLEALLINPUTS (Bit 29)                              */
#define CM4TIMER_GLOBEN_ENABLEALLINPUTS_Msk (0x20000000UL)          /*!< ENABLEALLINPUTS (Bitfield-Mask: 0x01)                 */
#define CM4TIMER_GLOBEN_ENB3_Pos          (3UL)                     /*!< ENB3 (Bit 3)                                          */
#define CM4TIMER_GLOBEN_ENB3_Msk          (0x8UL)                   /*!< ENB3 (Bitfield-Mask: 0x01)                            */
#define CM4TIMER_GLOBEN_ENB2_Pos          (2UL)                     /*!< ENB2 (Bit 2)                                          */
#define CM4TIMER_GLOBEN_ENB2_Msk          (0x4UL)                   /*!< ENB2 (Bitfield-Mask: 0x01)                            */
#define CM4TIMER_GLOBEN_ENB1_Pos          (1UL)                     /*!< ENB1 (Bit 1)                                          */
#define CM4TIMER_GLOBEN_ENB1_Msk          (0x2UL)                   /*!< ENB1 (Bitfield-Mask: 0x01)                            */
#define CM4TIMER_GLOBEN_ENB0_Pos          (0UL)                     /*!< ENB0 (Bit 0)                                          */
#define CM4TIMER_GLOBEN_ENB0_Msk          (0x1UL)                   /*!< ENB0 (Bitfield-Mask: 0x01)                            */
/* =========================================================  INTEN  ========================================================= */
#define CM4TIMER_INTEN_TMR31INT_Pos       (7UL)                     /*!< TMR31INT (Bit 7)                                      */
#define CM4TIMER_INTEN_TMR31INT_Msk       (0x80UL)                  /*!< TMR31INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTEN_TMR30INT_Pos       (6UL)                     /*!< TMR30INT (Bit 6)                                      */
#define CM4TIMER_INTEN_TMR30INT_Msk       (0x40UL)                  /*!< TMR30INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTEN_TMR21INT_Pos       (5UL)                     /*!< TMR21INT (Bit 5)                                      */
#define CM4TIMER_INTEN_TMR21INT_Msk       (0x20UL)                  /*!< TMR21INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTEN_TMR20INT_Pos       (4UL)                     /*!< TMR20INT (Bit 4)                                      */
#define CM4TIMER_INTEN_TMR20INT_Msk       (0x10UL)                  /*!< TMR20INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTEN_TMR11INT_Pos       (3UL)                     /*!< TMR11INT (Bit 3)                                      */
#define CM4TIMER_INTEN_TMR11INT_Msk       (0x8UL)                   /*!< TMR11INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTEN_TMR10INT_Pos       (2UL)                     /*!< TMR10INT (Bit 2)                                      */
#define CM4TIMER_INTEN_TMR10INT_Msk       (0x4UL)                   /*!< TMR10INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTEN_TMR01INT_Pos       (1UL)                     /*!< TMR01INT (Bit 1)                                      */
#define CM4TIMER_INTEN_TMR01INT_Msk       (0x2UL)                   /*!< TMR01INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTEN_TMR00INT_Pos       (0UL)                     /*!< TMR00INT (Bit 0)                                      */
#define CM4TIMER_INTEN_TMR00INT_Msk       (0x1UL)                   /*!< TMR00INT (Bitfield-Mask: 0x01)                        */
/* ========================================================  INTSTAT  ======================================================== */
#define CM4TIMER_INTSTAT_TMR31INT_Pos     (7UL)                     /*!< TMR31INT (Bit 7)                                      */
#define CM4TIMER_INTSTAT_TMR31INT_Msk     (0x80UL)                  /*!< TMR31INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSTAT_TMR30INT_Pos     (6UL)                     /*!< TMR30INT (Bit 6)                                      */
#define CM4TIMER_INTSTAT_TMR30INT_Msk     (0x40UL)                  /*!< TMR30INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSTAT_TMR21INT_Pos     (5UL)                     /*!< TMR21INT (Bit 5)                                      */
#define CM4TIMER_INTSTAT_TMR21INT_Msk     (0x20UL)                  /*!< TMR21INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSTAT_TMR20INT_Pos     (4UL)                     /*!< TMR20INT (Bit 4)                                      */
#define CM4TIMER_INTSTAT_TMR20INT_Msk     (0x10UL)                  /*!< TMR20INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSTAT_TMR11INT_Pos     (3UL)                     /*!< TMR11INT (Bit 3)                                      */
#define CM4TIMER_INTSTAT_TMR11INT_Msk     (0x8UL)                   /*!< TMR11INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSTAT_TMR10INT_Pos     (2UL)                     /*!< TMR10INT (Bit 2)                                      */
#define CM4TIMER_INTSTAT_TMR10INT_Msk     (0x4UL)                   /*!< TMR10INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSTAT_TMR01INT_Pos     (1UL)                     /*!< TMR01INT (Bit 1)                                      */
#define CM4TIMER_INTSTAT_TMR01INT_Msk     (0x2UL)                   /*!< TMR01INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSTAT_TMR00INT_Pos     (0UL)                     /*!< TMR00INT (Bit 0)                                      */
#define CM4TIMER_INTSTAT_TMR00INT_Msk     (0x1UL)                   /*!< TMR00INT (Bitfield-Mask: 0x01)                        */
/* ========================================================  INTCLR  ========================================================= */
#define CM4TIMER_INTCLR_TMR31INT_Pos      (7UL)                     /*!< TMR31INT (Bit 7)                                      */
#define CM4TIMER_INTCLR_TMR31INT_Msk      (0x80UL)                  /*!< TMR31INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTCLR_TMR30INT_Pos      (6UL)                     /*!< TMR30INT (Bit 6)                                      */
#define CM4TIMER_INTCLR_TMR30INT_Msk      (0x40UL)                  /*!< TMR30INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTCLR_TMR21INT_Pos      (5UL)                     /*!< TMR21INT (Bit 5)                                      */
#define CM4TIMER_INTCLR_TMR21INT_Msk      (0x20UL)                  /*!< TMR21INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTCLR_TMR20INT_Pos      (4UL)                     /*!< TMR20INT (Bit 4)                                      */
#define CM4TIMER_INTCLR_TMR20INT_Msk      (0x10UL)                  /*!< TMR20INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTCLR_TMR11INT_Pos      (3UL)                     /*!< TMR11INT (Bit 3)                                      */
#define CM4TIMER_INTCLR_TMR11INT_Msk      (0x8UL)                   /*!< TMR11INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTCLR_TMR10INT_Pos      (2UL)                     /*!< TMR10INT (Bit 2)                                      */
#define CM4TIMER_INTCLR_TMR10INT_Msk      (0x4UL)                   /*!< TMR10INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTCLR_TMR01INT_Pos      (1UL)                     /*!< TMR01INT (Bit 1)                                      */
#define CM4TIMER_INTCLR_TMR01INT_Msk      (0x2UL)                   /*!< TMR01INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTCLR_TMR00INT_Pos      (0UL)                     /*!< TMR00INT (Bit 0)                                      */
#define CM4TIMER_INTCLR_TMR00INT_Msk      (0x1UL)                   /*!< TMR00INT (Bitfield-Mask: 0x01)                        */
/* ========================================================  INTSET  ========================================================= */
#define CM4TIMER_INTSET_TMR31INT_Pos      (7UL)                     /*!< TMR31INT (Bit 7)                                      */
#define CM4TIMER_INTSET_TMR31INT_Msk      (0x80UL)                  /*!< TMR31INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSET_TMR30INT_Pos      (6UL)                     /*!< TMR30INT (Bit 6)                                      */
#define CM4TIMER_INTSET_TMR30INT_Msk      (0x40UL)                  /*!< TMR30INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSET_TMR21INT_Pos      (5UL)                     /*!< TMR21INT (Bit 5)                                      */
#define CM4TIMER_INTSET_TMR21INT_Msk      (0x20UL)                  /*!< TMR21INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSET_TMR20INT_Pos      (4UL)                     /*!< TMR20INT (Bit 4)                                      */
#define CM4TIMER_INTSET_TMR20INT_Msk      (0x10UL)                  /*!< TMR20INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSET_TMR11INT_Pos      (3UL)                     /*!< TMR11INT (Bit 3)                                      */
#define CM4TIMER_INTSET_TMR11INT_Msk      (0x8UL)                   /*!< TMR11INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSET_TMR10INT_Pos      (2UL)                     /*!< TMR10INT (Bit 2)                                      */
#define CM4TIMER_INTSET_TMR10INT_Msk      (0x4UL)                   /*!< TMR10INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSET_TMR01INT_Pos      (1UL)                     /*!< TMR01INT (Bit 1)                                      */
#define CM4TIMER_INTSET_TMR01INT_Msk      (0x2UL)                   /*!< TMR01INT (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_INTSET_TMR00INT_Pos      (0UL)                     /*!< TMR00INT (Bit 0)                                      */
#define CM4TIMER_INTSET_TMR00INT_Msk      (0x1UL)                   /*!< TMR00INT (Bitfield-Mask: 0x01)                        */
/* ========================================================  OUTCFG0  ======================================================== */
#define CM4TIMER_OUTCFG0_OUTCFG3_Pos      (24UL)                    /*!< OUTCFG3 (Bit 24)                                      */
#define CM4TIMER_OUTCFG0_OUTCFG3_Msk      (0x3f000000UL)            /*!< OUTCFG3 (Bitfield-Mask: 0x3f)                         */
#define CM4TIMER_OUTCFG0_OUTCFG2_Pos      (16UL)                    /*!< OUTCFG2 (Bit 16)                                      */
#define CM4TIMER_OUTCFG0_OUTCFG2_Msk      (0x3f0000UL)              /*!< OUTCFG2 (Bitfield-Mask: 0x3f)                         */
#define CM4TIMER_OUTCFG0_OUTCFG1_Pos      (8UL)                     /*!< OUTCFG1 (Bit 8)                                       */
#define CM4TIMER_OUTCFG0_OUTCFG1_Msk      (0x3f00UL)                /*!< OUTCFG1 (Bitfield-Mask: 0x3f)                         */
#define CM4TIMER_OUTCFG0_OUTCFG0_Pos      (0UL)                     /*!< OUTCFG0 (Bit 0)                                       */
#define CM4TIMER_OUTCFG0_OUTCFG0_Msk      (0x3fUL)                  /*!< OUTCFG0 (Bitfield-Mask: 0x3f)                         */
/* ========================================================  OUTCFG1  ======================================================== */
#define CM4TIMER_OUTCFG1_OUTCFG7_Pos      (24UL)                    /*!< OUTCFG7 (Bit 24)                                      */
#define CM4TIMER_OUTCFG1_OUTCFG7_Msk      (0x3f000000UL)            /*!< OUTCFG7 (Bitfield-Mask: 0x3f)                         */
#define CM4TIMER_OUTCFG1_OUTCFG6_Pos      (16UL)                    /*!< OUTCFG6 (Bit 16)                                      */
#define CM4TIMER_OUTCFG1_OUTCFG6_Msk      (0x3f0000UL)              /*!< OUTCFG6 (Bitfield-Mask: 0x3f)                         */
#define CM4TIMER_OUTCFG1_OUTCFG5_Pos      (8UL)                     /*!< OUTCFG5 (Bit 8)                                       */
#define CM4TIMER_OUTCFG1_OUTCFG5_Msk      (0x3f00UL)                /*!< OUTCFG5 (Bitfield-Mask: 0x3f)                         */
#define CM4TIMER_OUTCFG1_OUTCFG4_Pos      (0UL)                     /*!< OUTCFG4 (Bit 0)                                       */
#define CM4TIMER_OUTCFG1_OUTCFG4_Msk      (0x3fUL)                  /*!< OUTCFG4 (Bitfield-Mask: 0x3f)                         */
/* ========================================================  OUTCFG2  ======================================================== */
#define CM4TIMER_OUTCFG2_OUTCFG11_Pos     (24UL)                    /*!< OUTCFG11 (Bit 24)                                     */
#define CM4TIMER_OUTCFG2_OUTCFG11_Msk     (0x3f000000UL)            /*!< OUTCFG11 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG2_OUTCFG10_Pos     (16UL)                    /*!< OUTCFG10 (Bit 16)                                     */
#define CM4TIMER_OUTCFG2_OUTCFG10_Msk     (0x3f0000UL)              /*!< OUTCFG10 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG2_OUTCFG9_Pos      (8UL)                     /*!< OUTCFG9 (Bit 8)                                       */
#define CM4TIMER_OUTCFG2_OUTCFG9_Msk      (0x3f00UL)                /*!< OUTCFG9 (Bitfield-Mask: 0x3f)                         */
#define CM4TIMER_OUTCFG2_OUTCFG8_Pos      (0UL)                     /*!< OUTCFG8 (Bit 0)                                       */
#define CM4TIMER_OUTCFG2_OUTCFG8_Msk      (0x3fUL)                  /*!< OUTCFG8 (Bitfield-Mask: 0x3f)                         */
/* ========================================================  OUTCFG3  ======================================================== */
#define CM4TIMER_OUTCFG3_OUTCFG15_Pos     (24UL)                    /*!< OUTCFG15 (Bit 24)                                     */
#define CM4TIMER_OUTCFG3_OUTCFG15_Msk     (0x3f000000UL)            /*!< OUTCFG15 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG3_OUTCFG14_Pos     (16UL)                    /*!< OUTCFG14 (Bit 16)                                     */
#define CM4TIMER_OUTCFG3_OUTCFG14_Msk     (0x3f0000UL)              /*!< OUTCFG14 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG3_OUTCFG13_Pos     (8UL)                     /*!< OUTCFG13 (Bit 8)                                      */
#define CM4TIMER_OUTCFG3_OUTCFG13_Msk     (0x3f00UL)                /*!< OUTCFG13 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG3_OUTCFG12_Pos     (0UL)                     /*!< OUTCFG12 (Bit 0)                                      */
#define CM4TIMER_OUTCFG3_OUTCFG12_Msk     (0x3fUL)                  /*!< OUTCFG12 (Bitfield-Mask: 0x3f)                        */
/* ========================================================  OUTCFG4  ======================================================== */
#define CM4TIMER_OUTCFG4_OUTCFG19_Pos     (24UL)                    /*!< OUTCFG19 (Bit 24)                                     */
#define CM4TIMER_OUTCFG4_OUTCFG19_Msk     (0x3f000000UL)            /*!< OUTCFG19 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG4_OUTCFG18_Pos     (16UL)                    /*!< OUTCFG18 (Bit 16)                                     */
#define CM4TIMER_OUTCFG4_OUTCFG18_Msk     (0x3f0000UL)              /*!< OUTCFG18 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG4_OUTCFG17_Pos     (8UL)                     /*!< OUTCFG17 (Bit 8)                                      */
#define CM4TIMER_OUTCFG4_OUTCFG17_Msk     (0x3f00UL)                /*!< OUTCFG17 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG4_OUTCFG16_Pos     (0UL)                     /*!< OUTCFG16 (Bit 0)                                      */
#define CM4TIMER_OUTCFG4_OUTCFG16_Msk     (0x3fUL)                  /*!< OUTCFG16 (Bitfield-Mask: 0x3f)                        */
/* ========================================================  OUTCFG5  ======================================================== */
#define CM4TIMER_OUTCFG5_OUTCFG23_Pos     (24UL)                    /*!< OUTCFG23 (Bit 24)                                     */
#define CM4TIMER_OUTCFG5_OUTCFG23_Msk     (0x3f000000UL)            /*!< OUTCFG23 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG5_OUTCFG22_Pos     (16UL)                    /*!< OUTCFG22 (Bit 16)                                     */
#define CM4TIMER_OUTCFG5_OUTCFG22_Msk     (0x3f0000UL)              /*!< OUTCFG22 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG5_OUTCFG21_Pos     (8UL)                     /*!< OUTCFG21 (Bit 8)                                      */
#define CM4TIMER_OUTCFG5_OUTCFG21_Msk     (0x3f00UL)                /*!< OUTCFG21 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG5_OUTCFG20_Pos     (0UL)                     /*!< OUTCFG20 (Bit 0)                                      */
#define CM4TIMER_OUTCFG5_OUTCFG20_Msk     (0x3fUL)                  /*!< OUTCFG20 (Bitfield-Mask: 0x3f)                        */
/* ========================================================  OUTCFG6  ======================================================== */
#define CM4TIMER_OUTCFG6_OUTCFG27_Pos     (24UL)                    /*!< OUTCFG27 (Bit 24)                                     */
#define CM4TIMER_OUTCFG6_OUTCFG27_Msk     (0x3f000000UL)            /*!< OUTCFG27 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG6_OUTCFG26_Pos     (16UL)                    /*!< OUTCFG26 (Bit 16)                                     */
#define CM4TIMER_OUTCFG6_OUTCFG26_Msk     (0x3f0000UL)              /*!< OUTCFG26 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG6_OUTCFG25_Pos     (8UL)                     /*!< OUTCFG25 (Bit 8)                                      */
#define CM4TIMER_OUTCFG6_OUTCFG25_Msk     (0x3f00UL)                /*!< OUTCFG25 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG6_OUTCFG24_Pos     (0UL)                     /*!< OUTCFG24 (Bit 0)                                      */
#define CM4TIMER_OUTCFG6_OUTCFG24_Msk     (0x3fUL)                  /*!< OUTCFG24 (Bitfield-Mask: 0x3f)                        */
/* ========================================================  OUTCFG7  ======================================================== */
#define CM4TIMER_OUTCFG7_OUTCFG31_Pos     (24UL)                    /*!< OUTCFG31 (Bit 24)                                     */
#define CM4TIMER_OUTCFG7_OUTCFG31_Msk     (0x3f000000UL)            /*!< OUTCFG31 (Bitfield-Mask: 0x3f)                        */
