AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
#define CM4TIMER_OUTCFG7_OUTCFG30_Pos     (16UL)                    /*!< OUTCFG30 (Bit 16)                                     */
#define CM4TIMER_OUTCFG7_OUTCFG30_Msk     (0x3f0000UL)              /*!< OUTCFG30 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG7_OUTCFG29_Pos     (8UL)                     /*!< OUTCFG29 (Bit 8)                                      */
#define CM4TIMER_OUTCFG7_OUTCFG29_Msk     (0x3f00UL)                /*!< OUTCFG29 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG7_OUTCFG28_Pos     (0UL)                     /*!< OUTCFG28 (Bit 0)                                      */
#define CM4TIMER_OUTCFG7_OUTCFG28_Msk     (0x3fUL)                  /*!< OUTCFG28 (Bitfield-Mask: 0x3f)                        */
/* ========================================================  OUTCFG8  ======================================================== */
#define CM4TIMER_OUTCFG8_OUTCFG35_Pos     (24UL)                    /*!< OUTCFG35 (Bit 24)                                     */
#define CM4TIMER_OUTCFG8_OUTCFG35_Msk     (0x3f000000UL)            /*!< OUTCFG35 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG8_OUTCFG34_Pos     (16UL)                    /*!< OUTCFG34 (Bit 16)                                     */
#define CM4TIMER_OUTCFG8_OUTCFG34_Msk     (0x3f0000UL)              /*!< OUTCFG34 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG8_OUTCFG33_Pos     (8UL)                     /*!< OUTCFG33 (Bit 8)                                      */
#define CM4TIMER_OUTCFG8_OUTCFG33_Msk     (0x3f00UL)                /*!< OUTCFG33 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG8_OUTCFG32_Pos     (0UL)                     /*!< OUTCFG32 (Bit 0)                                      */
#define CM4TIMER_OUTCFG8_OUTCFG32_Msk     (0x3fUL)                  /*!< OUTCFG32 (Bitfield-Mask: 0x3f)                        */
/* ========================================================  OUTCFG9  ======================================================== */
#define CM4TIMER_OUTCFG9_OUTCFG39_Pos     (24UL)                    /*!< OUTCFG39 (Bit 24)                                     */
#define CM4TIMER_OUTCFG9_OUTCFG39_Msk     (0x3f000000UL)            /*!< OUTCFG39 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG9_OUTCFG38_Pos     (16UL)                    /*!< OUTCFG38 (Bit 16)                                     */
#define CM4TIMER_OUTCFG9_OUTCFG38_Msk     (0x3f0000UL)              /*!< OUTCFG38 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG9_OUTCFG37_Pos     (8UL)                     /*!< OUTCFG37 (Bit 8)                                      */
#define CM4TIMER_OUTCFG9_OUTCFG37_Msk     (0x3f00UL)                /*!< OUTCFG37 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG9_OUTCFG36_Pos     (0UL)                     /*!< OUTCFG36 (Bit 0)                                      */
#define CM4TIMER_OUTCFG9_OUTCFG36_Msk     (0x3fUL)                  /*!< OUTCFG36 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG10  ======================================================== */
#define CM4TIMER_OUTCFG10_OUTCFG43_Pos    (24UL)                    /*!< OUTCFG43 (Bit 24)                                     */
#define CM4TIMER_OUTCFG10_OUTCFG43_Msk    (0x3f000000UL)            /*!< OUTCFG43 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG10_OUTCFG42_Pos    (16UL)                    /*!< OUTCFG42 (Bit 16)                                     */
#define CM4TIMER_OUTCFG10_OUTCFG42_Msk    (0x3f0000UL)              /*!< OUTCFG42 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG10_OUTCFG41_Pos    (8UL)                     /*!< OUTCFG41 (Bit 8)                                      */
#define CM4TIMER_OUTCFG10_OUTCFG41_Msk    (0x3f00UL)                /*!< OUTCFG41 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG10_OUTCFG40_Pos    (0UL)                     /*!< OUTCFG40 (Bit 0)                                      */
#define CM4TIMER_OUTCFG10_OUTCFG40_Msk    (0x3fUL)                  /*!< OUTCFG40 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG11  ======================================================== */
#define CM4TIMER_OUTCFG11_OUTCFG47_Pos    (24UL)                    /*!< OUTCFG47 (Bit 24)                                     */
#define CM4TIMER_OUTCFG11_OUTCFG47_Msk    (0x3f000000UL)            /*!< OUTCFG47 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG11_OUTCFG46_Pos    (16UL)                    /*!< OUTCFG46 (Bit 16)                                     */
#define CM4TIMER_OUTCFG11_OUTCFG46_Msk    (0x3f0000UL)              /*!< OUTCFG46 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG11_OUTCFG45_Pos    (8UL)                     /*!< OUTCFG45 (Bit 8)                                      */
#define CM4TIMER_OUTCFG11_OUTCFG45_Msk    (0x3f00UL)                /*!< OUTCFG45 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG11_OUTCFG44_Pos    (0UL)                     /*!< OUTCFG44 (Bit 0)                                      */
#define CM4TIMER_OUTCFG11_OUTCFG44_Msk    (0x3fUL)                  /*!< OUTCFG44 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG12  ======================================================== */
#define CM4TIMER_OUTCFG12_OUTCFG51_Pos    (24UL)                    /*!< OUTCFG51 (Bit 24)                                     */
#define CM4TIMER_OUTCFG12_OUTCFG51_Msk    (0x3f000000UL)            /*!< OUTCFG51 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG12_OUTCFG50_Pos    (16UL)                    /*!< OUTCFG50 (Bit 16)                                     */
#define CM4TIMER_OUTCFG12_OUTCFG50_Msk    (0x3f0000UL)              /*!< OUTCFG50 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG12_OUTCFG49_Pos    (8UL)                     /*!< OUTCFG49 (Bit 8)                                      */
#define CM4TIMER_OUTCFG12_OUTCFG49_Msk    (0x3f00UL)                /*!< OUTCFG49 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG12_OUTCFG48_Pos    (0UL)                     /*!< OUTCFG48 (Bit 0)                                      */
#define CM4TIMER_OUTCFG12_OUTCFG48_Msk    (0x3fUL)                  /*!< OUTCFG48 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG13  ======================================================== */
#define CM4TIMER_OUTCFG13_OUTCFG55_Pos    (24UL)                    /*!< OUTCFG55 (Bit 24)                                     */
#define CM4TIMER_OUTCFG13_OUTCFG55_Msk    (0x3f000000UL)            /*!< OUTCFG55 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG13_OUTCFG54_Pos    (16UL)                    /*!< OUTCFG54 (Bit 16)                                     */
#define CM4TIMER_OUTCFG13_OUTCFG54_Msk    (0x3f0000UL)              /*!< OUTCFG54 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG13_OUTCFG53_Pos    (8UL)                     /*!< OUTCFG53 (Bit 8)                                      */
#define CM4TIMER_OUTCFG13_OUTCFG53_Msk    (0x3f00UL)                /*!< OUTCFG53 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG13_OUTCFG52_Pos    (0UL)                     /*!< OUTCFG52 (Bit 0)                                      */
#define CM4TIMER_OUTCFG13_OUTCFG52_Msk    (0x3fUL)                  /*!< OUTCFG52 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG14  ======================================================== */
#define CM4TIMER_OUTCFG14_OUTCFG59_Pos    (24UL)                    /*!< OUTCFG59 (Bit 24)                                     */
#define CM4TIMER_OUTCFG14_OUTCFG59_Msk    (0x3f000000UL)            /*!< OUTCFG59 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG14_OUTCFG58_Pos    (16UL)                    /*!< OUTCFG58 (Bit 16)                                     */
#define CM4TIMER_OUTCFG14_OUTCFG58_Msk    (0x3f0000UL)              /*!< OUTCFG58 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG14_OUTCFG57_Pos    (8UL)                     /*!< OUTCFG57 (Bit 8)                                      */
#define CM4TIMER_OUTCFG14_OUTCFG57_Msk    (0x3f00UL)                /*!< OUTCFG57 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG14_OUTCFG56_Pos    (0UL)                     /*!< OUTCFG56 (Bit 0)                                      */
#define CM4TIMER_OUTCFG14_OUTCFG56_Msk    (0x3fUL)                  /*!< OUTCFG56 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG15  ======================================================== */
#define CM4TIMER_OUTCFG15_OUTCFG63_Pos    (24UL)                    /*!< OUTCFG63 (Bit 24)                                     */
#define CM4TIMER_OUTCFG15_OUTCFG63_Msk    (0x3f000000UL)            /*!< OUTCFG63 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG15_OUTCFG62_Pos    (16UL)                    /*!< OUTCFG62 (Bit 16)                                     */
#define CM4TIMER_OUTCFG15_OUTCFG62_Msk    (0x3f0000UL)              /*!< OUTCFG62 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG15_OUTCFG61_Pos    (8UL)                     /*!< OUTCFG61 (Bit 8)                                      */
#define CM4TIMER_OUTCFG15_OUTCFG61_Msk    (0x3f00UL)                /*!< OUTCFG61 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG15_OUTCFG60_Pos    (0UL)                     /*!< OUTCFG60 (Bit 0)                                      */
#define CM4TIMER_OUTCFG15_OUTCFG60_Msk    (0x3fUL)                  /*!< OUTCFG60 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG16  ======================================================== */
#define CM4TIMER_OUTCFG16_OUTCFG67_Pos    (24UL)                    /*!< OUTCFG67 (Bit 24)                                     */
#define CM4TIMER_OUTCFG16_OUTCFG67_Msk    (0x3f000000UL)            /*!< OUTCFG67 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG16_OUTCFG66_Pos    (16UL)                    /*!< OUTCFG66 (Bit 16)                                     */
#define CM4TIMER_OUTCFG16_OUTCFG66_Msk    (0x3f0000UL)              /*!< OUTCFG66 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG16_OUTCFG65_Pos    (8UL)                     /*!< OUTCFG65 (Bit 8)                                      */
#define CM4TIMER_OUTCFG16_OUTCFG65_Msk    (0x3f00UL)                /*!< OUTCFG65 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG16_OUTCFG64_Pos    (0UL)                     /*!< OUTCFG64 (Bit 0)                                      */
#define CM4TIMER_OUTCFG16_OUTCFG64_Msk    (0x3fUL)                  /*!< OUTCFG64 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG17  ======================================================== */
#define CM4TIMER_OUTCFG17_OUTCFG71_Pos    (24UL)                    /*!< OUTCFG71 (Bit 24)                                     */
#define CM4TIMER_OUTCFG17_OUTCFG71_Msk    (0x3f000000UL)            /*!< OUTCFG71 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG17_OUTCFG70_Pos    (16UL)                    /*!< OUTCFG70 (Bit 16)                                     */
#define CM4TIMER_OUTCFG17_OUTCFG70_Msk    (0x3f0000UL)              /*!< OUTCFG70 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG17_OUTCFG69_Pos    (8UL)                     /*!< OUTCFG69 (Bit 8)                                      */
#define CM4TIMER_OUTCFG17_OUTCFG69_Msk    (0x3f00UL)                /*!< OUTCFG69 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG17_OUTCFG68_Pos    (0UL)                     /*!< OUTCFG68 (Bit 0)                                      */
#define CM4TIMER_OUTCFG17_OUTCFG68_Msk    (0x3fUL)                  /*!< OUTCFG68 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG18  ======================================================== */
#define CM4TIMER_OUTCFG18_OUTCFG75_Pos    (24UL)                    /*!< OUTCFG75 (Bit 24)                                     */
#define CM4TIMER_OUTCFG18_OUTCFG75_Msk    (0x3f000000UL)            /*!< OUTCFG75 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG18_OUTCFG74_Pos    (16UL)                    /*!< OUTCFG74 (Bit 16)                                     */
#define CM4TIMER_OUTCFG18_OUTCFG74_Msk    (0x3f0000UL)              /*!< OUTCFG74 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG18_OUTCFG73_Pos    (8UL)                     /*!< OUTCFG73 (Bit 8)                                      */
#define CM4TIMER_OUTCFG18_OUTCFG73_Msk    (0x3f00UL)                /*!< OUTCFG73 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG18_OUTCFG72_Pos    (0UL)                     /*!< OUTCFG72 (Bit 0)                                      */
#define CM4TIMER_OUTCFG18_OUTCFG72_Msk    (0x3fUL)                  /*!< OUTCFG72 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG19  ======================================================== */
#define CM4TIMER_OUTCFG19_OUTCFG79_Pos    (24UL)                    /*!< OUTCFG79 (Bit 24)                                     */
#define CM4TIMER_OUTCFG19_OUTCFG79_Msk    (0x3f000000UL)            /*!< OUTCFG79 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG19_OUTCFG78_Pos    (16UL)                    /*!< OUTCFG78 (Bit 16)                                     */
#define CM4TIMER_OUTCFG19_OUTCFG78_Msk    (0x3f0000UL)              /*!< OUTCFG78 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG19_OUTCFG77_Pos    (8UL)                     /*!< OUTCFG77 (Bit 8)                                      */
#define CM4TIMER_OUTCFG19_OUTCFG77_Msk    (0x3f00UL)                /*!< OUTCFG77 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG19_OUTCFG76_Pos    (0UL)                     /*!< OUTCFG76 (Bit 0)                                      */
#define CM4TIMER_OUTCFG19_OUTCFG76_Msk    (0x3fUL)                  /*!< OUTCFG76 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG20  ======================================================== */
#define CM4TIMER_OUTCFG20_OUTCFG83_Pos    (24UL)                    /*!< OUTCFG83 (Bit 24)                                     */
#define CM4TIMER_OUTCFG20_OUTCFG83_Msk    (0x3f000000UL)            /*!< OUTCFG83 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG20_OUTCFG82_Pos    (16UL)                    /*!< OUTCFG82 (Bit 16)                                     */
#define CM4TIMER_OUTCFG20_OUTCFG82_Msk    (0x3f0000UL)              /*!< OUTCFG82 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG20_OUTCFG81_Pos    (8UL)                     /*!< OUTCFG81 (Bit 8)                                      */
#define CM4TIMER_OUTCFG20_OUTCFG81_Msk    (0x3f00UL)                /*!< OUTCFG81 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG20_OUTCFG80_Pos    (0UL)                     /*!< OUTCFG80 (Bit 0)                                      */
#define CM4TIMER_OUTCFG20_OUTCFG80_Msk    (0x3fUL)                  /*!< OUTCFG80 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG21  ======================================================== */
#define CM4TIMER_OUTCFG21_OUTCFG87_Pos    (24UL)                    /*!< OUTCFG87 (Bit 24)                                     */
#define CM4TIMER_OUTCFG21_OUTCFG87_Msk    (0x3f000000UL)            /*!< OUTCFG87 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG21_OUTCFG86_Pos    (16UL)                    /*!< OUTCFG86 (Bit 16)                                     */
#define CM4TIMER_OUTCFG21_OUTCFG86_Msk    (0x3f0000UL)              /*!< OUTCFG86 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG21_OUTCFG85_Pos    (8UL)                     /*!< OUTCFG85 (Bit 8)                                      */
#define CM4TIMER_OUTCFG21_OUTCFG85_Msk    (0x3f00UL)                /*!< OUTCFG85 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG21_OUTCFG84_Pos    (0UL)                     /*!< OUTCFG84 (Bit 0)                                      */
#define CM4TIMER_OUTCFG21_OUTCFG84_Msk    (0x3fUL)                  /*!< OUTCFG84 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG22  ======================================================== */
#define CM4TIMER_OUTCFG22_OUTCFG91_Pos    (24UL)                    /*!< OUTCFG91 (Bit 24)                                     */
#define CM4TIMER_OUTCFG22_OUTCFG91_Msk    (0x3f000000UL)            /*!< OUTCFG91 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG22_OUTCFG90_Pos    (16UL)                    /*!< OUTCFG90 (Bit 16)                                     */
#define CM4TIMER_OUTCFG22_OUTCFG90_Msk    (0x3f0000UL)              /*!< OUTCFG90 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG22_OUTCFG89_Pos    (8UL)                     /*!< OUTCFG89 (Bit 8)                                      */
#define CM4TIMER_OUTCFG22_OUTCFG89_Msk    (0x3f00UL)                /*!< OUTCFG89 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG22_OUTCFG88_Pos    (0UL)                     /*!< OUTCFG88 (Bit 0)                                      */
#define CM4TIMER_OUTCFG22_OUTCFG88_Msk    (0x3fUL)                  /*!< OUTCFG88 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG23  ======================================================== */
#define CM4TIMER_OUTCFG23_OUTCFG95_Pos    (24UL)                    /*!< OUTCFG95 (Bit 24)                                     */
#define CM4TIMER_OUTCFG23_OUTCFG95_Msk    (0x3f000000UL)            /*!< OUTCFG95 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG23_OUTCFG94_Pos    (16UL)                    /*!< OUTCFG94 (Bit 16)                                     */
#define CM4TIMER_OUTCFG23_OUTCFG94_Msk    (0x3f0000UL)              /*!< OUTCFG94 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG23_OUTCFG93_Pos    (8UL)                     /*!< OUTCFG93 (Bit 8)                                      */
#define CM4TIMER_OUTCFG23_OUTCFG93_Msk    (0x3f00UL)                /*!< OUTCFG93 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG23_OUTCFG92_Pos    (0UL)                     /*!< OUTCFG92 (Bit 0)                                      */
#define CM4TIMER_OUTCFG23_OUTCFG92_Msk    (0x3fUL)                  /*!< OUTCFG92 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG24  ======================================================== */
#define CM4TIMER_OUTCFG24_OUTCFG99_Pos    (24UL)                    /*!< OUTCFG99 (Bit 24)                                     */
#define CM4TIMER_OUTCFG24_OUTCFG99_Msk    (0x3f000000UL)            /*!< OUTCFG99 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG24_OUTCFG98_Pos    (16UL)                    /*!< OUTCFG98 (Bit 16)                                     */
#define CM4TIMER_OUTCFG24_OUTCFG98_Msk    (0x3f0000UL)              /*!< OUTCFG98 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG24_OUTCFG97_Pos    (8UL)                     /*!< OUTCFG97 (Bit 8)                                      */
#define CM4TIMER_OUTCFG24_OUTCFG97_Msk    (0x3f00UL)                /*!< OUTCFG97 (Bitfield-Mask: 0x3f)                        */
#define CM4TIMER_OUTCFG24_OUTCFG96_Pos    (0UL)                     /*!< OUTCFG96 (Bit 0)                                      */
#define CM4TIMER_OUTCFG24_OUTCFG96_Msk    (0x3fUL)                  /*!< OUTCFG96 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG25  ======================================================== */
#define CM4TIMER_OUTCFG25_OUTCFG103_Pos   (24UL)                    /*!< OUTCFG103 (Bit 24)                                    */
#define CM4TIMER_OUTCFG25_OUTCFG103_Msk   (0x3f000000UL)            /*!< OUTCFG103 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG25_OUTCFG102_Pos   (16UL)                    /*!< OUTCFG102 (Bit 16)                                    */
#define CM4TIMER_OUTCFG25_OUTCFG102_Msk   (0x3f0000UL)              /*!< OUTCFG102 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG25_OUTCFG101_Pos   (8UL)                     /*!< OUTCFG101 (Bit 8)                                     */
#define CM4TIMER_OUTCFG25_OUTCFG101_Msk   (0x3f00UL)                /*!< OUTCFG101 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG25_OUTCFG100_Pos   (0UL)                     /*!< OUTCFG100 (Bit 0)                                     */
#define CM4TIMER_OUTCFG25_OUTCFG100_Msk   (0x3fUL)                  /*!< OUTCFG100 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG26  ======================================================== */
#define CM4TIMER_OUTCFG26_OUTCFG107_Pos   (24UL)                    /*!< OUTCFG107 (Bit 24)                                    */
#define CM4TIMER_OUTCFG26_OUTCFG107_Msk   (0x3f000000UL)            /*!< OUTCFG107 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG26_OUTCFG106_Pos   (16UL)                    /*!< OUTCFG106 (Bit 16)                                    */
#define CM4TIMER_OUTCFG26_OUTCFG106_Msk   (0x3f0000UL)              /*!< OUTCFG106 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG26_OUTCFG105_Pos   (8UL)                     /*!< OUTCFG105 (Bit 8)                                     */
#define CM4TIMER_OUTCFG26_OUTCFG105_Msk   (0x3f00UL)                /*!< OUTCFG105 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG26_OUTCFG104_Pos   (0UL)                     /*!< OUTCFG104 (Bit 0)                                     */
#define CM4TIMER_OUTCFG26_OUTCFG104_Msk   (0x3fUL)                  /*!< OUTCFG104 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG27  ======================================================== */
#define CM4TIMER_OUTCFG27_OUTCFG111_Pos   (24UL)                    /*!< OUTCFG111 (Bit 24)                                    */
#define CM4TIMER_OUTCFG27_OUTCFG111_Msk   (0x3f000000UL)            /*!< OUTCFG111 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG27_OUTCFG110_Pos   (16UL)                    /*!< OUTCFG110 (Bit 16)                                    */
#define CM4TIMER_OUTCFG27_OUTCFG110_Msk   (0x3f0000UL)              /*!< OUTCFG110 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG27_OUTCFG109_Pos   (8UL)                     /*!< OUTCFG109 (Bit 8)                                     */
#define CM4TIMER_OUTCFG27_OUTCFG109_Msk   (0x3f00UL)                /*!< OUTCFG109 (Bitfield-Mask: 0x3f)                       */
