AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
#define CM4TIMER_OUTCFG27_OUTCFG108_Pos   (0UL)                     /*!< OUTCFG108 (Bit 0)                                     */
#define CM4TIMER_OUTCFG27_OUTCFG108_Msk   (0x3fUL)                  /*!< OUTCFG108 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG28  ======================================================== */
#define CM4TIMER_OUTCFG28_OUTCFG115_Pos   (24UL)                    /*!< OUTCFG115 (Bit 24)                                    */
#define CM4TIMER_OUTCFG28_OUTCFG115_Msk   (0x3f000000UL)            /*!< OUTCFG115 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG28_OUTCFG114_Pos   (16UL)                    /*!< OUTCFG114 (Bit 16)                                    */
#define CM4TIMER_OUTCFG28_OUTCFG114_Msk   (0x3f0000UL)              /*!< OUTCFG114 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG28_OUTCFG113_Pos   (8UL)                     /*!< OUTCFG113 (Bit 8)                                     */
#define CM4TIMER_OUTCFG28_OUTCFG113_Msk   (0x3f00UL)                /*!< OUTCFG113 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG28_OUTCFG112_Pos   (0UL)                     /*!< OUTCFG112 (Bit 0)                                     */
#define CM4TIMER_OUTCFG28_OUTCFG112_Msk   (0x3fUL)                  /*!< OUTCFG112 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG29  ======================================================== */
#define CM4TIMER_OUTCFG29_OUTCFG119_Pos   (24UL)                    /*!< OUTCFG119 (Bit 24)                                    */
#define CM4TIMER_OUTCFG29_OUTCFG119_Msk   (0x3f000000UL)            /*!< OUTCFG119 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG29_OUTCFG118_Pos   (16UL)                    /*!< OUTCFG118 (Bit 16)                                    */
#define CM4TIMER_OUTCFG29_OUTCFG118_Msk   (0x3f0000UL)              /*!< OUTCFG118 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG29_OUTCFG117_Pos   (8UL)                     /*!< OUTCFG117 (Bit 8)                                     */
#define CM4TIMER_OUTCFG29_OUTCFG117_Msk   (0x3f00UL)                /*!< OUTCFG117 (Bitfield-Mask: 0x3f)                       */
#define CM4TIMER_OUTCFG29_OUTCFG116_Pos   (0UL)                     /*!< OUTCFG116 (Bit 0)                                     */
#define CM4TIMER_OUTCFG29_OUTCFG116_Msk   (0x3fUL)                  /*!< OUTCFG116 (Bitfield-Mask: 0x3f)                       */
/* =========================================================  CTRL0  ========================================================= */
#define CM4TIMER_CTRL0_TMR0LMT_Pos        (24UL)                    /*!< TMR0LMT (Bit 24)                                      */
#define CM4TIMER_CTRL0_TMR0LMT_Msk        (0xff000000UL)            /*!< TMR0LMT (Bitfield-Mask: 0xff)                         */
#define CM4TIMER_CTRL0_TMR0TMODE_Pos      (16UL)                    /*!< TMR0TMODE (Bit 16)                                    */
#define CM4TIMER_CTRL0_TMR0TMODE_Msk      (0x30000UL)               /*!< TMR0TMODE (Bitfield-Mask: 0x03)                       */
#define CM4TIMER_CTRL0_TMR0CLK_Pos        (8UL)                     /*!< TMR0CLK (Bit 8)                                       */
#define CM4TIMER_CTRL0_TMR0CLK_Msk        (0xff00UL)                /*!< TMR0CLK (Bitfield-Mask: 0xff)                         */
#define CM4TIMER_CTRL0_TMR0FN_Pos         (4UL)                     /*!< TMR0FN (Bit 4)                                        */
#define CM4TIMER_CTRL0_TMR0FN_Msk         (0xf0UL)                  /*!< TMR0FN (Bitfield-Mask: 0x0f)                          */
#define CM4TIMER_CTRL0_TMR0POL1_Pos       (3UL)                     /*!< TMR0POL1 (Bit 3)                                      */
#define CM4TIMER_CTRL0_TMR0POL1_Msk       (0x8UL)                   /*!< TMR0POL1 (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_CTRL0_TMR0POL0_Pos       (2UL)                     /*!< TMR0POL0 (Bit 2)                                      */
#define CM4TIMER_CTRL0_TMR0POL0_Msk       (0x4UL)                   /*!< TMR0POL0 (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_CTRL0_TMR0CLR_Pos        (1UL)                     /*!< TMR0CLR (Bit 1)                                       */
#define CM4TIMER_CTRL0_TMR0CLR_Msk        (0x2UL)                   /*!< TMR0CLR (Bitfield-Mask: 0x01)                         */
#define CM4TIMER_CTRL0_TMR0EN_Pos         (0UL)                     /*!< TMR0EN (Bit 0)                                        */
#define CM4TIMER_CTRL0_TMR0EN_Msk         (0x1UL)                   /*!< TMR0EN (Bitfield-Mask: 0x01)                          */
/* ========================================================  TIMER0  ========================================================= */
#define CM4TIMER_TIMER0_TIMER0_Pos        (0UL)                     /*!< TIMER0 (Bit 0)                                        */
#define CM4TIMER_TIMER0_TIMER0_Msk        (0xffffffffUL)            /*!< TIMER0 (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  TMR0CMP0  ======================================================== */
#define CM4TIMER_TMR0CMP0_TMR0CMP0_Pos    (0UL)                     /*!< TMR0CMP0 (Bit 0)                                      */
#define CM4TIMER_TMR0CMP0_TMR0CMP0_Msk    (0xffffffffUL)            /*!< TMR0CMP0 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  TMR0CMP1  ======================================================== */
#define CM4TIMER_TMR0CMP1_TMR0CMP1_Pos    (0UL)                     /*!< TMR0CMP1 (Bit 0)                                      */
#define CM4TIMER_TMR0CMP1_TMR0CMP1_Msk    (0xffffffffUL)            /*!< TMR0CMP1 (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  MODE0  ========================================================= */
#define CM4TIMER_MODE0_TMR0TRIGSEL_Pos    (8UL)                     /*!< TMR0TRIGSEL (Bit 8)                                   */
#define CM4TIMER_MODE0_TMR0TRIGSEL_Msk    (0xff00UL)                /*!< TMR0TRIGSEL (Bitfield-Mask: 0xff)                     */
/* ======================================================  TMR0LMTVAL  ======================================================= */
#define CM4TIMER_TMR0LMTVAL_TMR0LMTVAL_Pos (0UL)                    /*!< TMR0LMTVAL (Bit 0)                                    */
#define CM4TIMER_TMR0LMTVAL_TMR0LMTVAL_Msk (0xffUL)                 /*!< TMR0LMTVAL (Bitfield-Mask: 0xff)                      */
/* =========================================================  CTRL1  ========================================================= */
#define CM4TIMER_CTRL1_TMR1LMT_Pos        (24UL)                    /*!< TMR1LMT (Bit 24)                                      */
#define CM4TIMER_CTRL1_TMR1LMT_Msk        (0xff000000UL)            /*!< TMR1LMT (Bitfield-Mask: 0xff)                         */
#define CM4TIMER_CTRL1_TMR1TMODE_Pos      (16UL)                    /*!< TMR1TMODE (Bit 16)                                    */
#define CM4TIMER_CTRL1_TMR1TMODE_Msk      (0x30000UL)               /*!< TMR1TMODE (Bitfield-Mask: 0x03)                       */
#define CM4TIMER_CTRL1_TMR1CLK_Pos        (8UL)                     /*!< TMR1CLK (Bit 8)                                       */
#define CM4TIMER_CTRL1_TMR1CLK_Msk        (0xff00UL)                /*!< TMR1CLK (Bitfield-Mask: 0xff)                         */
#define CM4TIMER_CTRL1_TMR1FN_Pos         (4UL)                     /*!< TMR1FN (Bit 4)                                        */
#define CM4TIMER_CTRL1_TMR1FN_Msk         (0xf0UL)                  /*!< TMR1FN (Bitfield-Mask: 0x0f)                          */
#define CM4TIMER_CTRL1_TMR1POL1_Pos       (3UL)                     /*!< TMR1POL1 (Bit 3)                                      */
#define CM4TIMER_CTRL1_TMR1POL1_Msk       (0x8UL)                   /*!< TMR1POL1 (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_CTRL1_TMR1POL0_Pos       (2UL)                     /*!< TMR1POL0 (Bit 2)                                      */
#define CM4TIMER_CTRL1_TMR1POL0_Msk       (0x4UL)                   /*!< TMR1POL0 (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_CTRL1_TMR1CLR_Pos        (1UL)                     /*!< TMR1CLR (Bit 1)                                       */
#define CM4TIMER_CTRL1_TMR1CLR_Msk        (0x2UL)                   /*!< TMR1CLR (Bitfield-Mask: 0x01)                         */
#define CM4TIMER_CTRL1_TMR1EN_Pos         (0UL)                     /*!< TMR1EN (Bit 0)                                        */
#define CM4TIMER_CTRL1_TMR1EN_Msk         (0x1UL)                   /*!< TMR1EN (Bitfield-Mask: 0x01)                          */
/* ========================================================  TIMER1  ========================================================= */
#define CM4TIMER_TIMER1_TIMER1_Pos        (0UL)                     /*!< TIMER1 (Bit 0)                                        */
#define CM4TIMER_TIMER1_TIMER1_Msk        (0xffffffffUL)            /*!< TIMER1 (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  TMR1CMP0  ======================================================== */
#define CM4TIMER_TMR1CMP0_TMR1CMP0_Pos    (0UL)                     /*!< TMR1CMP0 (Bit 0)                                      */
#define CM4TIMER_TMR1CMP0_TMR1CMP0_Msk    (0xffffffffUL)            /*!< TMR1CMP0 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  TMR1CMP1  ======================================================== */
#define CM4TIMER_TMR1CMP1_TMR1CMP1_Pos    (0UL)                     /*!< TMR1CMP1 (Bit 0)                                      */
#define CM4TIMER_TMR1CMP1_TMR1CMP1_Msk    (0xffffffffUL)            /*!< TMR1CMP1 (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  MODE1  ========================================================= */
#define CM4TIMER_MODE1_TMR1TRIGSEL_Pos    (8UL)                     /*!< TMR1TRIGSEL (Bit 8)                                   */
#define CM4TIMER_MODE1_TMR1TRIGSEL_Msk    (0xff00UL)                /*!< TMR1TRIGSEL (Bitfield-Mask: 0xff)                     */
/* ======================================================  TMR1LMTVAL  ======================================================= */
#define CM4TIMER_TMR1LMTVAL_TMR1LMTVAL_Pos (0UL)                    /*!< TMR1LMTVAL (Bit 0)                                    */
#define CM4TIMER_TMR1LMTVAL_TMR1LMTVAL_Msk (0xffUL)                 /*!< TMR1LMTVAL (Bitfield-Mask: 0xff)                      */
/* =========================================================  CTRL2  ========================================================= */
#define CM4TIMER_CTRL2_TMR2LMT_Pos        (24UL)                    /*!< TMR2LMT (Bit 24)                                      */
#define CM4TIMER_CTRL2_TMR2LMT_Msk        (0xff000000UL)            /*!< TMR2LMT (Bitfield-Mask: 0xff)                         */
#define CM4TIMER_CTRL2_TMR2TMODE_Pos      (16UL)                    /*!< TMR2TMODE (Bit 16)                                    */
#define CM4TIMER_CTRL2_TMR2TMODE_Msk      (0x30000UL)               /*!< TMR2TMODE (Bitfield-Mask: 0x03)                       */
#define CM4TIMER_CTRL2_TMR2CLK_Pos        (8UL)                     /*!< TMR2CLK (Bit 8)                                       */
#define CM4TIMER_CTRL2_TMR2CLK_Msk        (0xff00UL)                /*!< TMR2CLK (Bitfield-Mask: 0xff)                         */
#define CM4TIMER_CTRL2_TMR2FN_Pos         (4UL)                     /*!< TMR2FN (Bit 4)                                        */
#define CM4TIMER_CTRL2_TMR2FN_Msk         (0xf0UL)                  /*!< TMR2FN (Bitfield-Mask: 0x0f)                          */
#define CM4TIMER_CTRL2_TMR2POL1_Pos       (3UL)                     /*!< TMR2POL1 (Bit 3)                                      */
#define CM4TIMER_CTRL2_TMR2POL1_Msk       (0x8UL)                   /*!< TMR2POL1 (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_CTRL2_TMR2POL0_Pos       (2UL)                     /*!< TMR2POL0 (Bit 2)                                      */
#define CM4TIMER_CTRL2_TMR2POL0_Msk       (0x4UL)                   /*!< TMR2POL0 (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_CTRL2_TMR2CLR_Pos        (1UL)                     /*!< TMR2CLR (Bit 1)                                       */
#define CM4TIMER_CTRL2_TMR2CLR_Msk        (0x2UL)                   /*!< TMR2CLR (Bitfield-Mask: 0x01)                         */
#define CM4TIMER_CTRL2_TMR2EN_Pos         (0UL)                     /*!< TMR2EN (Bit 0)                                        */
#define CM4TIMER_CTRL2_TMR2EN_Msk         (0x1UL)                   /*!< TMR2EN (Bitfield-Mask: 0x01)                          */
/* ========================================================  TIMER2  ========================================================= */
#define CM4TIMER_TIMER2_TIMER2_Pos        (0UL)                     /*!< TIMER2 (Bit 0)                                        */
#define CM4TIMER_TIMER2_TIMER2_Msk        (0xffffffffUL)            /*!< TIMER2 (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  TMR2CMP0  ======================================================== */
#define CM4TIMER_TMR2CMP0_TMR2CMP0_Pos    (0UL)                     /*!< TMR2CMP0 (Bit 0)                                      */
#define CM4TIMER_TMR2CMP0_TMR2CMP0_Msk    (0xffffffffUL)            /*!< TMR2CMP0 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  TMR2CMP1  ======================================================== */
#define CM4TIMER_TMR2CMP1_TMR2CMP1_Pos    (0UL)                     /*!< TMR2CMP1 (Bit 0)                                      */
#define CM4TIMER_TMR2CMP1_TMR2CMP1_Msk    (0xffffffffUL)            /*!< TMR2CMP1 (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  MODE2  ========================================================= */
#define CM4TIMER_MODE2_TMR2TRIGSEL_Pos    (8UL)                     /*!< TMR2TRIGSEL (Bit 8)                                   */
#define CM4TIMER_MODE2_TMR2TRIGSEL_Msk    (0xff00UL)                /*!< TMR2TRIGSEL (Bitfield-Mask: 0xff)                     */
/* ======================================================  TMR2LMTVAL  ======================================================= */
#define CM4TIMER_TMR2LMTVAL_TMR2LMTVAL_Pos (0UL)                    /*!< TMR2LMTVAL (Bit 0)                                    */
#define CM4TIMER_TMR2LMTVAL_TMR2LMTVAL_Msk (0xffUL)                 /*!< TMR2LMTVAL (Bitfield-Mask: 0xff)                      */
/* =========================================================  CTRL3  ========================================================= */
#define CM4TIMER_CTRL3_TMR3LMT_Pos        (24UL)                    /*!< TMR3LMT (Bit 24)                                      */
#define CM4TIMER_CTRL3_TMR3LMT_Msk        (0xff000000UL)            /*!< TMR3LMT (Bitfield-Mask: 0xff)                         */
#define CM4TIMER_CTRL3_TMR3TMODE_Pos      (16UL)                    /*!< TMR3TMODE (Bit 16)                                    */
#define CM4TIMER_CTRL3_TMR3TMODE_Msk      (0x30000UL)               /*!< TMR3TMODE (Bitfield-Mask: 0x03)                       */
#define CM4TIMER_CTRL3_TMR3CLK_Pos        (8UL)                     /*!< TMR3CLK (Bit 8)                                       */
#define CM4TIMER_CTRL3_TMR3CLK_Msk        (0xff00UL)                /*!< TMR3CLK (Bitfield-Mask: 0xff)                         */
#define CM4TIMER_CTRL3_TMR3FN_Pos         (4UL)                     /*!< TMR3FN (Bit 4)                                        */
#define CM4TIMER_CTRL3_TMR3FN_Msk         (0xf0UL)                  /*!< TMR3FN (Bitfield-Mask: 0x0f)                          */
#define CM4TIMER_CTRL3_TMR3POL1_Pos       (3UL)                     /*!< TMR3POL1 (Bit 3)                                      */
#define CM4TIMER_CTRL3_TMR3POL1_Msk       (0x8UL)                   /*!< TMR3POL1 (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_CTRL3_TMR3POL0_Pos       (2UL)                     /*!< TMR3POL0 (Bit 2)                                      */
#define CM4TIMER_CTRL3_TMR3POL0_Msk       (0x4UL)                   /*!< TMR3POL0 (Bitfield-Mask: 0x01)                        */
#define CM4TIMER_CTRL3_TMR3CLR_Pos        (1UL)                     /*!< TMR3CLR (Bit 1)                                       */
#define CM4TIMER_CTRL3_TMR3CLR_Msk        (0x2UL)                   /*!< TMR3CLR (Bitfield-Mask: 0x01)                         */
#define CM4TIMER_CTRL3_TMR3EN_Pos         (0UL)                     /*!< TMR3EN (Bit 0)                                        */
#define CM4TIMER_CTRL3_TMR3EN_Msk         (0x1UL)                   /*!< TMR3EN (Bitfield-Mask: 0x01)                          */
/* ========================================================  TIMER3  ========================================================= */
#define CM4TIMER_TIMER3_TIMER3_Pos        (0UL)                     /*!< TIMER3 (Bit 0)                                        */
#define CM4TIMER_TIMER3_TIMER3_Msk        (0xffffffffUL)            /*!< TIMER3 (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  TMR3CMP0  ======================================================== */
#define CM4TIMER_TMR3CMP0_TMR3CMP0_Pos    (0UL)                     /*!< TMR3CMP0 (Bit 0)                                      */
#define CM4TIMER_TMR3CMP0_TMR3CMP0_Msk    (0xffffffffUL)            /*!< TMR3CMP0 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  TMR3CMP1  ======================================================== */
#define CM4TIMER_TMR3CMP1_TMR3CMP1_Pos    (0UL)                     /*!< TMR3CMP1 (Bit 0)                                      */
#define CM4TIMER_TMR3CMP1_TMR3CMP1_Msk    (0xffffffffUL)            /*!< TMR3CMP1 (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  MODE3  ========================================================= */
#define CM4TIMER_MODE3_TMR3TRIGSEL_Pos    (8UL)                     /*!< TMR3TRIGSEL (Bit 8)                                   */
#define CM4TIMER_MODE3_TMR3TRIGSEL_Msk    (0xff00UL)                /*!< TMR3TRIGSEL (Bitfield-Mask: 0xff)                     */
/* ======================================================  TMR3LMTVAL  ======================================================= */
#define CM4TIMER_TMR3LMTVAL_TMR3LMTVAL_Pos (0UL)                    /*!< TMR3LMTVAL (Bit 0)                                    */
#define CM4TIMER_TMR3LMTVAL_TMR3LMTVAL_Msk (0xffUL)                 /*!< TMR3LMTVAL (Bitfield-Mask: 0xff)                      */
/* ======================================================  TIMERSPARES  ====================================================== */
#define CM4TIMER_TIMERSPARES_TMRSPARES_Pos (0UL)                    /*!< TMRSPARES (Bit 0)                                     */
#define CM4TIMER_TIMERSPARES_TMRSPARES_Msk (0xffffffffUL)           /*!< TMRSPARES (Bitfield-Mask: 0xffffffff)                 */


/* =========================================================================================================================== */
/* ================                                          CM4WDT                                           ================ */
/* =========================================================================================================================== */

