AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ==========================================================  CFG  ========================================================== */
#define CM4WDT_CFG_CLKSEL_Pos             (24UL)                    /*!< CLKSEL (Bit 24)                                       */
#define CM4WDT_CFG_CLKSEL_Msk             (0x7000000UL)             /*!< CLKSEL (Bitfield-Mask: 0x07)                          */
#define CM4WDT_CFG_INTVAL_Pos             (16UL)                    /*!< INTVAL (Bit 16)                                       */
#define CM4WDT_CFG_INTVAL_Msk             (0xff0000UL)              /*!< INTVAL (Bitfield-Mask: 0xff)                          */
#define CM4WDT_CFG_RESVAL_Pos             (8UL)                     /*!< RESVAL (Bit 8)                                        */
#define CM4WDT_CFG_RESVAL_Msk             (0xff00UL)                /*!< RESVAL (Bitfield-Mask: 0xff)                          */
#define CM4WDT_CFG_RESEN_Pos              (2UL)                     /*!< RESEN (Bit 2)                                         */
#define CM4WDT_CFG_RESEN_Msk              (0x4UL)                   /*!< RESEN (Bitfield-Mask: 0x01)                           */
#define CM4WDT_CFG_INTEN_Pos              (1UL)                     /*!< INTEN (Bit 1)                                         */
#define CM4WDT_CFG_INTEN_Msk              (0x2UL)                   /*!< INTEN (Bitfield-Mask: 0x01)                           */
#define CM4WDT_CFG_WDTEN_Pos              (0UL)                     /*!< WDTEN (Bit 0)                                         */
#define CM4WDT_CFG_WDTEN_Msk              (0x1UL)                   /*!< WDTEN (Bitfield-Mask: 0x01)                           */
/* =========================================================  RSTRT  ========================================================= */
#define CM4WDT_RSTRT_RSTRT_Pos            (0UL)                     /*!< RSTRT (Bit 0)                                         */
#define CM4WDT_RSTRT_RSTRT_Msk            (0xffUL)                  /*!< RSTRT (Bitfield-Mask: 0xff)                           */
/* =========================================================  LOCK  ========================================================== */
#define CM4WDT_LOCK_LOCK_Pos              (0UL)                     /*!< LOCK (Bit 0)                                          */
#define CM4WDT_LOCK_LOCK_Msk              (0xffUL)                  /*!< LOCK (Bitfield-Mask: 0xff)                            */
/* =========================================================  COUNT  ========================================================= */
#define CM4WDT_COUNT_COUNT_Pos            (0UL)                     /*!< COUNT (Bit 0)                                         */
#define CM4WDT_COUNT_COUNT_Msk            (0xffUL)                  /*!< COUNT (Bitfield-Mask: 0xff)                           */
/* =======================================================  WDTIEREN  ======================================================== */
#define CM4WDT_WDTIEREN_WDTINT_Pos        (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define CM4WDT_WDTIEREN_WDTINT_Msk        (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */
/* ======================================================  WDTIERSTAT  ======================================================= */
#define CM4WDT_WDTIERSTAT_WDTINT_Pos      (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define CM4WDT_WDTIERSTAT_WDTINT_Msk      (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */
/* =======================================================  WDTIERCLR  ======================================================= */
#define CM4WDT_WDTIERCLR_WDTINT_Pos       (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define CM4WDT_WDTIERCLR_WDTINT_Msk       (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */
/* =======================================================  WDTIERSET  ======================================================= */
#define CM4WDT_WDTIERSET_WDTINT_Pos       (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define CM4WDT_WDTIERSET_WDTINT_Msk       (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */

/** @} */ /* End of group PosMask_peripherals */


/* =========================================================================================================================== */
/* ================                           Enumerated Values Peripheral Section                            ================ */
/* =========================================================================================================================== */


/** @addtogroup EnumValue_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                          CM4IPC                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  M2DDATA  ======================================================== */
/* ========================================================  D2MDATA  ======================================================== */
/* ========================================================  STATUS  ========================================================= */
/* =======================================================  M2DERROR  ======================================================== */
/* =========================================================  M2DIT  ========================================================= */
/* =========================================================  M2DIS  ========================================================= */
/* =========================================================  M2DIE  ========================================================= */
/* =========================================================  D2MIT  ========================================================= */
/* =========================================================  D2MIS  ========================================================= */
/* =========================================================  D2MIE  ========================================================= */


/* =========================================================================================================================== */
/* ================                                        CM4MCUCTRL                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  OBSSEL  ========================================================= */
/* ===========================================  CM4MCUCTRL OBSSEL OBSSEL1 [6..10]  =========================================== */
typedef enum {                                  /*!< CM4MCUCTRL_OBSSEL_OBSSEL1                                                 */
  CM4MCUCTRL_OBSSEL_OBSSEL1_BTDBG01    = 0,     /*!< BTDBG01 : bt_dbg0[7:0] and bt_dbg1[7:0] from RW-MM                        */
  CM4MCUCTRL_OBSSEL_OBSSEL1_BTDBG23    = 1,     /*!< BTDBG23 : bt_dbg2[7:0] and bt_dbg3[7:0] from RW-MM                        */
  CM4MCUCTRL_OBSSEL_OBSSEL1_MAC154DBG01 = 2,    /*!< MAC154DBG01 : mac154_dbg0[7:0] and mac154_dbg1[7:0] from RW-MM            */
  CM4MCUCTRL_OBSSEL_OBSSEL1_MAC154DBG23 = 3,    /*!< MAC154DBG23 : mac154_dbg2[7:0] and mac154_dbg3[7:0] from RW-MM            */
  CM4MCUCTRL_OBSSEL_OBSSEL1_BLEDBG01   = 4,     /*!< BLEDBG01 : ble_dbg0[7:0] and ble_dbg1[7:0] from RW-MM                     */
  CM4MCUCTRL_OBSSEL_OBSSEL1_BLEDBG23   = 5,     /*!< BLEDBG23 : ble_dbg2[7:0] and ble_dbg3[7:0] from RW-MM                     */
  CM4MCUCTRL_OBSSEL_OBSSEL1_MMDBG01    = 6,     /*!< MMDBG01 : mm_dbg0[7:0] and mm_dbg1[7:0] from RW-MM                        */
  CM4MCUCTRL_OBSSEL_OBSSEL1_MMDBG23    = 7,     /*!< MMDBG23 : mm_dbg2[7:0] and mm_dbg3[7:0] from RW-MM                        */
  CM4MCUCTRL_OBSSEL_OBSSEL1_GPIO0      = 8,     /*!< GPIO0 : GPIO_OUT[7:0] from IcyTRX                                         */
  CM4MCUCTRL_OBSSEL_OBSSEL1_GPIO1      = 9,     /*!< GPIO1 : GPIO_OUT[15:8] from IcyTRX                                        */
  CM4MCUCTRL_OBSSEL_OBSSEL1_PMUSTATE   = 10,    /*!< PMUSTATE : pmu_state[3:0] from Radio PMU                                  */
  CM4MCUCTRL_OBSSEL_OBSSEL1_CM4TIMINGBT = 11,   /*!< CM4TIMINGBT : CM4 Timing (8-bits) and bt_dbg0[7:0]                        */
  CM4MCUCTRL_OBSSEL_OBSSEL1_CM4TIMINGBLE = 12,  /*!< CM4TIMINGBLE : CM4 Timing (8-bits) and ble_dbg0[7:0]                      */
  CM4MCUCTRL_OBSSEL_OBSSEL1_CM4TIMINGMAC154 = 13,/*!< CM4TIMINGMAC154 : CM4 Timing (8-bits) and mac154_dbg0[7:0]               */
  CM4MCUCTRL_OBSSEL_OBSSEL1_CM4TIMINGMM = 14,   /*!< CM4TIMINGMM : CM4 Timing (8-bits) and mm_dbg0[7:0]                        */
} CM4MCUCTRL_OBSSEL_OBSSEL1_Enum;

/* ===========================================  CM4MCUCTRL OBSSEL OBSSEL0 [1..5]  ============================================ */
typedef enum {                                  /*!< CM4MCUCTRL_OBSSEL_OBSSEL0                                                 */
  CM4MCUCTRL_OBSSEL_OBSSEL0_BTDBG01    = 0,     /*!< BTDBG01 : bt_dbg0[7:0] and bt_dbg1[7:0] from RW-MM                        */
  CM4MCUCTRL_OBSSEL_OBSSEL0_BTDBG23    = 1,     /*!< BTDBG23 : bt_dbg2[7:0] and bt_dbg3[7:0] from RW-MM                        */
  CM4MCUCTRL_OBSSEL_OBSSEL0_MAC154DBG01 = 2,    /*!< MAC154DBG01 : mac154_dbg0[7:0] and mac154_dbg1[7:0] from RW-MM            */
  CM4MCUCTRL_OBSSEL_OBSSEL0_MAC154DBG23 = 3,    /*!< MAC154DBG23 : mac154_dbg2[7:0] and mac154_dbg3[7:0] from RW-MM            */
  CM4MCUCTRL_OBSSEL_OBSSEL0_BLEDBG01   = 4,     /*!< BLEDBG01 : ble_dbg0[7:0] and ble_dbg1[7:0] from RW-MM                     */
  CM4MCUCTRL_OBSSEL_OBSSEL0_BLEDBG23   = 5,     /*!< BLEDBG23 : ble_dbg2[7:0] and ble_dbg3[7:0] from RW-MM                     */
  CM4MCUCTRL_OBSSEL_OBSSEL0_MMDBG01    = 6,     /*!< MMDBG01 : mm_dbg0[7:0] and mm_dbg1[7:0] from RW-MM                        */
  CM4MCUCTRL_OBSSEL_OBSSEL0_MMDBG23    = 7,     /*!< MMDBG23 : mm_dbg2[7:0] and mm_dbg3[7:0] from RW-MM                        */
  CM4MCUCTRL_OBSSEL_OBSSEL0_GPIO0      = 8,     /*!< GPIO0 : GPIO_OUT[7:0] from IcyTRX                                         */
  CM4MCUCTRL_OBSSEL_OBSSEL0_GPIO1      = 9,     /*!< GPIO1 : GPIO_OUT[15:8] from IcyTRX                                        */
  CM4MCUCTRL_OBSSEL_OBSSEL0_PMUSTATE   = 10,    /*!< PMUSTATE : pmu_state[3:0] from Radio PMU                                  */
  CM4MCUCTRL_OBSSEL_OBSSEL0_CM4TIMINGBT = 11,   /*!< CM4TIMINGBT : CM4 Timing (8-bits) and bt_dbg0[7:0]                        */
  CM4MCUCTRL_OBSSEL_OBSSEL0_CM4TIMINGBLE = 12,  /*!< CM4TIMINGBLE : CM4 Timing (8-bits) and ble_dbg0[7:0]                      */
  CM4MCUCTRL_OBSSEL_OBSSEL0_CM4TIMINGMAC154 = 13,/*!< CM4TIMINGMAC154 : CM4 Timing (8-bits) and mac154_dbg0[7:0]               */
  CM4MCUCTRL_OBSSEL_OBSSEL0_CM4TIMINGMM = 14,   /*!< CM4TIMINGMM : CM4 Timing (8-bits) and mm_dbg0[7:0]                        */
} CM4MCUCTRL_OBSSEL_OBSSEL0_Enum;

/* ======================================================  CQFLAGSOUT  ======================================================= */
/* =======================================================  CQFLAGSIN  ======================================================= */
/* =======================================================  TCMWPROT  ======================================================== */
/* =======================================================  TCMRPROT  ======================================================== */
/* ======================================================  CPUPWRCTRL  ======================================================= */
/* =========================================  CM4MCUCTRL CPUPWRCTRL CM4NVMEN [6..6]  ========================================= */
typedef enum {                                  /*!< CM4MCUCTRL_CPUPWRCTRL_CM4NVMEN                                            */
  CM4MCUCTRL_CPUPWRCTRL_CM4NVMEN_EN    = 1,     /*!< EN : ENABLE                                                               */
  CM4MCUCTRL_CPUPWRCTRL_CM4NVMEN_DIS   = 0,     /*!< DIS : DISABLE                                                             */
} CM4MCUCTRL_CPUPWRCTRL_CM4NVMEN_Enum;

/* ==========================================  CM4MCUCTRL CPUPWRCTRL PMUEN [5..5]  =========================================== */
typedef enum {                                  /*!< CM4MCUCTRL_CPUPWRCTRL_PMUEN                                               */
  CM4MCUCTRL_CPUPWRCTRL_PMUEN_EN       = 1,     /*!< EN : ENABLE                                                               */
  CM4MCUCTRL_CPUPWRCTRL_PMUEN_DIS      = 0,     /*!< DIS : DISABLE                                                             */
} CM4MCUCTRL_CPUPWRCTRL_PMUEN_Enum;

