AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* =======================================  CM4MCUCTRL CPUPWRCTRL CPUCLKOVEREN [4..4]  ======================================= */
typedef enum {                                  /*!< CM4MCUCTRL_CPUPWRCTRL_CPUCLKOVEREN                                        */
  CM4MCUCTRL_CPUPWRCTRL_CPUCLKOVEREN_EN = 1,    /*!< EN : ENABLE                                                               */
  CM4MCUCTRL_CPUPWRCTRL_CPUCLKOVEREN_DIS = 0,   /*!< DIS : DISABLE                                                             */
} CM4MCUCTRL_CPUPWRCTRL_CPUCLKOVEREN_Enum;

/* ========================================  CM4MCUCTRL CPUPWRCTRL FCLKSTATE [3..3]  ========================================= */
typedef enum {                                  /*!< CM4MCUCTRL_CPUPWRCTRL_FCLKSTATE                                           */
  CM4MCUCTRL_CPUPWRCTRL_FCLKSTATE_ON   = 1,     /*!< ON : CPU CLOCK IS RUNNING (ON).                                           */
  CM4MCUCTRL_CPUPWRCTRL_FCLKSTATE_OFF  = 0,     /*!< OFF : CPU CLOCK IS NOT RUNNING (OFF).                                     */
} CM4MCUCTRL_CPUPWRCTRL_FCLKSTATE_Enum;

/* =======================================  CM4MCUCTRL CPUPWRCTRL PMUCLKSTATE [2..2]  ======================================== */
typedef enum {                                  /*!< CM4MCUCTRL_CPUPWRCTRL_PMUCLKSTATE                                         */
  CM4MCUCTRL_CPUPWRCTRL_PMUCLKSTATE_ON = 1,     /*!< ON : PMU CLOCK IS RUNNING (ON).                                           */
  CM4MCUCTRL_CPUPWRCTRL_PMUCLKSTATE_OFF = 0,    /*!< OFF : PMU CLOCK IS NOT RUNNING (OFF).                                     */
} CM4MCUCTRL_CPUPWRCTRL_PMUCLKSTATE_Enum;

/* ========================================  CM4MCUCTRL CPUPWRCTRL SLEEPMODE [1..1]  ========================================= */
typedef enum {                                  /*!< CM4MCUCTRL_CPUPWRCTRL_SLEEPMODE                                           */
  CM4MCUCTRL_CPUPWRCTRL_SLEEPMODE_ARMSLEEP = 1, /*!< ARMSLEEP : Indicated CM4 is in ARM light sleep with CLKIN/FCLK
                                                     enabled                                                                   */
  CM4MCUCTRL_CPUPWRCTRL_SLEEPMODE_AMBIQSLEEP = 0,/*!< AMBIQSLEEP : Indicated CM4 is in AMBIQ light sleep with CLKIN/FCLK
                                                     disabled                                                                  */
} CM4MCUCTRL_CPUPWRCTRL_SLEEPMODE_Enum;

/* ======================================================  COREPWROFF  ======================================================= */
/* ========================================  CM4MCUCTRL COREPWROFF CPUPWROFF [0..0]  ========================================= */
typedef enum {                                  /*!< CM4MCUCTRL_COREPWROFF_CPUPWROFF                                           */
  CM4MCUCTRL_COREPWROFF_CPUPWROFF_OFF  = 1,     /*!< OFF : POWER OFF CM4                                                       */
} CM4MCUCTRL_COREPWROFF_CPUPWROFF_Enum;

/* ======================================================  CM4TIMING0  ======================================================= */
/* ======================================================  CM4TIMING1  ======================================================= */
/* ======================================================  CM4TIMING2  ======================================================= */
/* ======================================================  CM4TIMING3  ======================================================= */
/* ======================================================  CM4TIMING4  ======================================================= */
/* ======================================================  CM4TIMING5  ======================================================= */
/* ======================================================  CM4TIMING6  ======================================================= */
/* ======================================================  CM4TIMING7  ======================================================= */
/* ====================================================  CM4TIMINGENABLE  ==================================================== */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */


/* =========================================================================================================================== */
/* ================                                         CM4RADIO                                          ================ */
/* =========================================================================================================================== */

/* ======================================================  RCLKCONTROL  ====================================================== */
/* =========================================  CM4RADIO RCLKCONTROL TPIUCLKEN [6..6]  ========================================= */
typedef enum {                                  /*!< CM4RADIO_RCLKCONTROL_TPIUCLKEN                                            */
  CM4RADIO_RCLKCONTROL_TPIUCLKEN_DISABLE = 0,   /*!< DISABLE : Disable TPIU clock                                              */
  CM4RADIO_RCLKCONTROL_TPIUCLKEN_ENABLE = 1,    /*!< ENABLE : Enable TPIU clock                                                */
} CM4RADIO_RCLKCONTROL_TPIUCLKEN_Enum;

/* ========================================  CM4RADIO RCLKCONTROL TPIUCLKSEL [4..5]  ========================================= */
typedef enum {                                  /*!< CM4RADIO_RCLKCONTROL_TPIUCLKSEL                                           */
  CM4RADIO_RCLKCONTROL_TPIUCLKSEL_HFRC_24MHz = 0,/*!< HFRC_24MHz : Select 24MHz HFRC clock                                     */
  CM4RADIO_RCLKCONTROL_TPIUCLKSEL_HFRC_12MHz = 1,/*!< HFRC_12MHz : Select 12MHz HFRC clock                                     */
  CM4RADIO_RCLKCONTROL_TPIUCLKSEL_HFRC_3MHz = 2,/*!< HFRC_3MHz : Select 3MHz HFRC clock                                        */
  CM4RADIO_RCLKCONTROL_TPIUCLKSEL_HFRC_1_5MHz = 3,/*!< HFRC_1_5MHz : Select 1.5MHz HFRC clock                                  */
} CM4RADIO_RCLKCONTROL_TPIUCLKSEL_Enum;

/* =========================================  CM4RADIO RCLKCONTROL MCUCLKSEL [3..3]  ========================================= */
typedef enum {                                  /*!< CM4RADIO_RCLKCONTROL_MCUCLKSEL                                            */
  CM4RADIO_RCLKCONTROL_MCUCLKSEL_HFRC_96MHz = 0,/*!< HFRC_96MHz : Select 96MHz HFRC clock                                      */
  CM4RADIO_RCLKCONTROL_MCUCLKSEL_HFRC_48MHz = 1,/*!< HFRC_48MHz : Select 48MHz HFRC clock                                      */
} CM4RADIO_RCLKCONTROL_MCUCLKSEL_Enum;

