AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* =======================================  CM4RADIO RCLKCONTROL BBCLKOVERRIDE [2..2]  ======================================= */
typedef enum {                                  /*!< CM4RADIO_RCLKCONTROL_BBCLKOVERRIDE                                        */
  CM4RADIO_RCLKCONTROL_BBCLKOVERRIDE_NORMALOP = 0,/*!< NORMALOP : Normal operation                                             */
  CM4RADIO_RCLKCONTROL_BBCLKOVERRIDE_ALWAYSON = 1,/*!< ALWAYSON : Baseband master clock always on                              */
} CM4RADIO_RCLKCONTROL_BBCLKOVERRIDE_Enum;

/* =========================================  CM4RADIO RCLKCONTROL BBCLKSEL [0..1]  ========================================== */
typedef enum {                                  /*!< CM4RADIO_RCLKCONTROL_BBCLKSEL                                             */
  CM4RADIO_RCLKCONTROL_BBCLKSEL_HFRC_12MHz = 0, /*!< HFRC_12MHz : Select 12MHz HFRC clock                                      */
  CM4RADIO_RCLKCONTROL_BBCLKSEL_HFRC_24MHz = 1, /*!< HFRC_24MHz : Select 24MHz HFRC clock                                      */
  CM4RADIO_RCLKCONTROL_BBCLKSEL_RF_XTAL_12MHz = 2,/*!< RF_XTAL_12MHz : Select 12MHz RF XTAL clock                              */
  CM4RADIO_RCLKCONTROL_BBCLKSEL_RF_XTAL_24MHz = 3,/*!< RF_XTAL_24MHz : Select 24MHz RF XTAL clock                              */
} CM4RADIO_RCLKCONTROL_BBCLKSEL_Enum;

/* =======================================================  RCONTROL  ======================================================== */
/* ===========================================  CM4RADIO RCONTROL OSCEN [26..26]  ============================================ */
typedef enum {                                  /*!< CM4RADIO_RCONTROL_OSCEN                                                   */
  CM4RADIO_RCONTROL_OSCEN_OFF          = 0,     /*!< OFF : HW controls the RF XTAL oscillator                                  */
  CM4RADIO_RCONTROL_OSCEN_ON           = 1,     /*!< ON : RF XTAL oscillator is turned on                                      */
} CM4RADIO_RCONTROL_OSCEN_Enum;

/* =======================================================  BBCONTROL  ======================================================= */
/* ==========================================  CM4RADIO BBCONTROL WAKEUPREQ [0..0]  ========================================== */
typedef enum {                                  /*!< CM4RADIO_BBCONTROL_WAKEUPREQ                                              */
  CM4RADIO_BBCONTROL_WAKEUPREQ_OFF     = 0,     /*!< OFF : Normal operation                                                    */
  CM4RADIO_BBCONTROL_WAKEUPREQ_WAKEUP  = 1,     /*!< WAKEUP : Request wakeup                                                   */
} CM4RADIO_BBCONTROL_WAKEUPREQ_Enum;

/* =======================================================  NPCONTROL  ======================================================= */
/* =========================================  CM4RADIO NPCONTROL NPSWRSTDBG [0..0]  ========================================== */
typedef enum {                                  /*!< CM4RADIO_NPCONTROL_NPSWRSTDBG                                             */
  CM4RADIO_NPCONTROL_NPSWRSTDBG_NORMALOP = 0,   /*!< NORMALOP : Normal operation                                               */
  CM4RADIO_NPCONTROL_NPSWRSTDBG_RESET  = 1,     /*!< RESET : Hold CM4 DEBUG feature in reset                                   */
} CM4RADIO_NPCONTROL_NPSWRSTDBG_Enum;

/* =======================================================  RADIOSTAT  ======================================================= */
/* ========================================================  NPSWPOR  ======================================================== */
/* ==========================================  CM4RADIO NPSWPOR NPSWPORKEY [0..7]  =========================================== */
typedef enum {                                  /*!< CM4RADIO_NPSWPOR_NPSWPORKEY                                               */
  CM4RADIO_NPSWPOR_NPSWPORKEY_KEYVALUE = 212,   /*!< KEYVALUE : Writing 0xD4 key value generates a CM4 software POR
                                                     reset                                                                     */
  CM4RADIO_NPSWPOR_NPSWPORKEY_DEFAULT  = 0,     /*!< DEFAULT : Default value                                                   */
} CM4RADIO_NPSWPOR_NPSWPORKEY_Enum;

/* =========================================================  RTUNE  ========================================================= */
/* ========================================================  DBGCTRL  ======================================================== */
/* =============================================  CM4RADIO DBGCTRL OBSEN [4..4]  ============================================= */
typedef enum {                                  /*!< CM4RADIO_DBGCTRL_OBSEN                                                    */
  CM4RADIO_DBGCTRL_OBSEN_DISABLE       = 0,     /*!< DISABLE : Disable observe bus                                             */
  CM4RADIO_DBGCTRL_OBSEN_ENABLE        = 1,     /*!< ENABLE : Enable observe bus                                               */
} CM4RADIO_DBGCTRL_OBSEN_Enum;

/* ============================================  CM4RADIO DBGCTRL OBSSEL [0..3]  ============================================= */
typedef enum {                                  /*!< CM4RADIO_DBGCTRL_OBSSEL                                                   */
  CM4RADIO_DBGCTRL_OBSSEL_BTLSB        = 0,     /*!< BTLSB : bt_dbg0[7:0] and bt_dbg1[7:0] from RW-MM                          */
  CM4RADIO_DBGCTRL_OBSSEL_BTMSB        = 1,     /*!< BTMSB : bt_dbg2[7:0] and bt_dbg3[7:0] from RW-MM                          */
  CM4RADIO_DBGCTRL_OBSSEL_MAC154LSB    = 2,     /*!< MAC154LSB : mac154_dbg0[7:0] and mac154_dbg1[7:0] from RW-MM              */
  CM4RADIO_DBGCTRL_OBSSEL_MAC154MSB    = 3,     /*!< MAC154MSB : mac154_dbg2[7:0] and mac154_dbg3[7:0] from RW-MM              */
  CM4RADIO_DBGCTRL_OBSSEL_BLELSB       = 4,     /*!< BLELSB : ble_dbg0[7:0] and ble_dbg1[7:0] from RW-MM                       */
  CM4RADIO_DBGCTRL_OBSSEL_BLEMSB       = 5,     /*!< BLEMSB : ble_dbg2[7:0] and ble_dbg3[7:0] from RW-MM                       */
  CM4RADIO_DBGCTRL_OBSSEL_MMLSB        = 6,     /*!< MMLSB : mm_dbg0[7:0] and mm_dbg1[7:0] from RW-MM                          */
  CM4RADIO_DBGCTRL_OBSSEL_MMMSB        = 7,     /*!< MMMSB : mm_dbg2[7:0] and mm_dbg3[7:0] from RW-MM                          */
  CM4RADIO_DBGCTRL_OBSSEL_ICYTRX       = 8,     /*!< ICYTRX : gpio_out[9:0] from IcyTRX-DM                                     */
  CM4RADIO_DBGCTRL_OBSSEL_RADIOPMU     = 9,     /*!< RADIOPMU : pmu_state[3:0] from Radio PMU                                  */
  CM4RADIO_DBGCTRL_OBSSEL_CM4BT        = 10,    /*!< CM4BT : CM4 timing (8-bits) and bt_dbg0[7:0]                              */
  CM4RADIO_DBGCTRL_OBSSEL_CM4BLE       = 11,    /*!< CM4BLE : CM4 timing (8-bits) and ble_dbg0[7:0]                            */
  CM4RADIO_DBGCTRL_OBSSEL_CM4MAC154    = 12,    /*!< CM4MAC154 : CM4 timing (8-bits) and mac154_dbg0[7:0]                      */
  CM4RADIO_DBGCTRL_OBSSEL_CM4MM        = 13,    /*!< CM4MM : CM4 timing (8-bits) and mm_dbg0[7:0]                              */
} CM4RADIO_DBGCTRL_OBSSEL_Enum;

