AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* =====================================================  WLANCOEXCTRL  ====================================================== */
/* ======================================================  WCICOEXCTRL  ====================================================== */
/* =======================================  CM4RADIO WCICOEXCTRL WCICOEXIFSEL [0..1]  ======================================== */
typedef enum {                                  /*!< CM4RADIO_WCICOEXCTRL_WCICOEXIFSEL                                         */
  CM4RADIO_WCICOEXCTRL_WCICOEXIFSEL_NONE = 0,   /*!< NONE : WCI COEX interface not enabled                                     */
  CM4RADIO_WCICOEXCTRL_WCICOEXIFSEL_WCI1WIRE = 1,/*!< WCI1WIRE : Select WCI 1-Wire interface                                   */
  CM4RADIO_WCICOEXCTRL_WCICOEXIFSEL_WCI2WIRE = 2,/*!< WCI2WIRE : Select WCI 2-Wire interface                                   */
} CM4RADIO_WCICOEXCTRL_WCICOEXIFSEL_Enum;

/* =====================================================  EXTRFDIRCTRL  ====================================================== */
/* ========================================  CM4RADIO EXTRFDIRCTRL RXENSEL [27..28]  ========================================= */
typedef enum {                                  /*!< CM4RADIO_EXTRFDIRCTRL_RXENSEL                                             */
  CM4RADIO_EXTRFDIRCTRL_RXENSEL_LOGIC0 = 0,     /*!< LOGIC0 : Select logic 0                                                   */
  CM4RADIO_EXTRFDIRCTRL_RXENSEL_REGBIT1 = 1,    /*!< REGBIT1 : Select bit 1 from this register                                 */
  CM4RADIO_EXTRFDIRCTRL_RXENSEL_RADIO7 = 2,     /*!< RADIO7 : IcyTRX radio_out[7]                                              */
  CM4RADIO_EXTRFDIRCTRL_RXENSEL_RADIO7ANDGPIO5 = 3,/*!< RADIO7ANDGPIO5 : IcyTRX radio_out[7] ANDed with IcyTRX GPIO[5]         */
} CM4RADIO_EXTRFDIRCTRL_RXENSEL_Enum;

/* ========================================  CM4RADIO EXTRFDIRCTRL TXENSEL [25..26]  ========================================= */
typedef enum {                                  /*!< CM4RADIO_EXTRFDIRCTRL_TXENSEL                                             */
  CM4RADIO_EXTRFDIRCTRL_TXENSEL_LOGIC0 = 0,     /*!< LOGIC0 : Select logic 0                                                   */
  CM4RADIO_EXTRFDIRCTRL_TXENSEL_REGBIT0 = 1,    /*!< REGBIT0 : Select bit 0 from this register                                 */
  CM4RADIO_EXTRFDIRCTRL_TXENSEL_RADIO6 = 2,     /*!< RADIO6 : IcyTRX radio_out[6]                                              */
  CM4RADIO_EXTRFDIRCTRL_TXENSEL_RADIO6ANDGPIO5 = 3,/*!< RADIO6ANDGPIO5 : IcyTRX radio_out[6] ANDed with IcyTRX GPIO[5]         */
} CM4RADIO_EXTRFDIRCTRL_TXENSEL_Enum;



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  RTCCTL  ========================================================= */
/* ===============================================  RTC RTCCTL HR1224 [5..5]  ================================================ */
typedef enum {                                  /*!< RTC_RTCCTL_HR1224                                                         */
  RTC_RTCCTL_HR1224_24HR               = 0,     /*!< 24HR : Hours in 24 hour mode                                              */
  RTC_RTCCTL_HR1224_DISABLED           = 1,     /*!< DISABLED : Disable the 24 hour mode                                       */
} RTC_RTCCTL_HR1224_Enum;

/* ================================================  RTC RTCCTL RSTOP [4..4]  ================================================ */
typedef enum {                                  /*!< RTC_RTCCTL_RSTOP                                                          */
  RTC_RTCCTL_RSTOP_RUN                 = 0,     /*!< RUN : Allow the RTC input clock to run                                    */
  RTC_RTCCTL_RSTOP_STOP                = 1,     /*!< STOP : Stop the RTC input clock                                           */
} RTC_RTCCTL_RSTOP_Enum;

/* =================================================  RTC RTCCTL RPT [1..3]  ================================================= */
typedef enum {                                  /*!< RTC_RTCCTL_RPT                                                            */
  RTC_RTCCTL_RPT_DIS                   = 0,     /*!< DIS : Alarm interrupt disabled                                            */
  RTC_RTCCTL_RPT_YEAR                  = 1,     /*!< YEAR : Interrupt every year                                               */
  RTC_RTCCTL_RPT_MONTH                 = 2,     /*!< MONTH : Interrupt every month                                             */
  RTC_RTCCTL_RPT_WEEK                  = 3,     /*!< WEEK : Interrupt every week                                               */
  RTC_RTCCTL_RPT_DAY                   = 4,     /*!< DAY : Interrupt every day                                                 */
  RTC_RTCCTL_RPT_HR                    = 5,     /*!< HR : Interrupt every hour                                                 */
  RTC_RTCCTL_RPT_MIN                   = 6,     /*!< MIN : Interrupt every minute                                              */
  RTC_RTCCTL_RPT_SEC                   = 7,     /*!< SEC : Interrupt every second/10th/100th                                   */
} RTC_RTCCTL_RPT_Enum;

/* ================================================  RTC RTCCTL WRTC [0..0]  ================================================= */
typedef enum {                                  /*!< RTC_RTCCTL_WRTC                                                           */
  RTC_RTCCTL_WRTC_DIS                  = 0,     /*!< DIS : Counter writes are disabled                                         */
  RTC_RTCCTL_WRTC_EN                   = 1,     /*!< EN : Counter writes are enabled                                           */
} RTC_RTCCTL_WRTC_Enum;

/* ========================================================  RTCSTAT  ======================================================== */
/* ========================================================  CTRLOW  ========================================================= */
/* =========================================================  CTRUP  ========================================================= */
/* ===============================================  RTC CTRUP CTERR [31..31]  ================================================ */
typedef enum {                                  /*!< RTC_CTRUP_CTERR                                                           */
  RTC_CTRUP_CTERR_NOERR                = 0,     /*!< NOERR : No read error occurred                                            */
  RTC_CTRUP_CTERR_RDERR                = 1,     /*!< RDERR : Read error occurred                                               */
} RTC_CTRUP_CTERR_Enum;

/* ================================================  RTC CTRUP CEB [29..29]  ================================================= */
typedef enum {                                  /*!< RTC_CTRUP_CEB                                                             */
  RTC_CTRUP_CEB_DIS                    = 0,     /*!< DIS : Disable the Century bit from changing                               */
  RTC_CTRUP_CEB_EN                     = 1,     /*!< EN : Enable the Century bit to change                                     */
} RTC_CTRUP_CEB_Enum;

/* =================================================  RTC CTRUP CB [28..28]  ================================================= */
typedef enum {                                  /*!< RTC_CTRUP_CB                                                              */
  RTC_CTRUP_CB_2000                    = 0,     /*!< 2000 : Century is 2000s                                                   */
  RTC_CTRUP_CB_1900_2100               = 1,     /*!< 1900_2100 : Century is 1900s/2100s                                        */
} RTC_CTRUP_CB_Enum;

/* ========================================================  ALMLOW  ========================================================= */
/* =========================================================  ALMUP  ========================================================= */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */


/* =========================================================================================================================== */
/* ================                                         CM4STIMER                                         ================ */
/* =========================================================================================================================== */

/* =========================================================  STCFG  ========================================================= */
/* ============================================  CM4STIMER STCFG FREEZE [31..31]  ============================================ */
typedef enum {                                  /*!< CM4STIMER_STCFG_FREEZE                                                    */
  CM4STIMER_STCFG_FREEZE_THAW          = 0,     /*!< THAW : Let the COUNTER register run on its input clock.                   */
  CM4STIMER_STCFG_FREEZE_FREEZE        = 1,     /*!< FREEZE : Stop the COUNTER register for loading.                           */
} CM4STIMER_STCFG_FREEZE_Enum;

/* ============================================  CM4STIMER STCFG CLEAR [30..30]  ============================================= */
typedef enum {                                  /*!< CM4STIMER_STCFG_CLEAR                                                     */
  CM4STIMER_STCFG_CLEAR_RUN            = 0,     /*!< RUN : Let the COUNTER register run on its input clock.                    */
  CM4STIMER_STCFG_CLEAR_CLEAR          = 1,     /*!< CLEAR : Stop the COUNTER register for loading.                            */
} CM4STIMER_STCFG_CLEAR_Enum;

/* ==========================================  CM4STIMER STCFG COMPAREHEN [15..15]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STCFG_COMPAREHEN                                                */
  CM4STIMER_STCFG_COMPAREHEN_DISABLE   = 0,     /*!< DISABLE : Compare H disabled.                                             */
  CM4STIMER_STCFG_COMPAREHEN_ENABLE    = 1,     /*!< ENABLE : Compare H enabled.                                               */
} CM4STIMER_STCFG_COMPAREHEN_Enum;

