AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ==========================================  CM4STIMER STCFG COMPAREGEN [14..14]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STCFG_COMPAREGEN                                                */
  CM4STIMER_STCFG_COMPAREGEN_DISABLE   = 0,     /*!< DISABLE : Compare G disabled.                                             */
  CM4STIMER_STCFG_COMPAREGEN_ENABLE    = 1,     /*!< ENABLE : Compare G enabled.                                               */
} CM4STIMER_STCFG_COMPAREGEN_Enum;

/* ==========================================  CM4STIMER STCFG COMPAREFEN [13..13]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STCFG_COMPAREFEN                                                */
  CM4STIMER_STCFG_COMPAREFEN_DISABLE   = 0,     /*!< DISABLE : Compare F disabled.                                             */
  CM4STIMER_STCFG_COMPAREFEN_ENABLE    = 1,     /*!< ENABLE : Compare F enabled.                                               */
} CM4STIMER_STCFG_COMPAREFEN_Enum;

/* ==========================================  CM4STIMER STCFG COMPAREEEN [12..12]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STCFG_COMPAREEEN                                                */
  CM4STIMER_STCFG_COMPAREEEN_DISABLE   = 0,     /*!< DISABLE : Compare E disabled.                                             */
  CM4STIMER_STCFG_COMPAREEEN_ENABLE    = 1,     /*!< ENABLE : Compare E enabled.                                               */
} CM4STIMER_STCFG_COMPAREEEN_Enum;

/* ==========================================  CM4STIMER STCFG COMPAREDEN [11..11]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STCFG_COMPAREDEN                                                */
  CM4STIMER_STCFG_COMPAREDEN_DISABLE   = 0,     /*!< DISABLE : Compare D disabled.                                             */
  CM4STIMER_STCFG_COMPAREDEN_ENABLE    = 1,     /*!< ENABLE : Compare D enabled.                                               */
} CM4STIMER_STCFG_COMPAREDEN_Enum;

/* ==========================================  CM4STIMER STCFG COMPARECEN [10..10]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STCFG_COMPARECEN                                                */
  CM4STIMER_STCFG_COMPARECEN_DISABLE   = 0,     /*!< DISABLE : Compare C disabled.                                             */
  CM4STIMER_STCFG_COMPARECEN_ENABLE    = 1,     /*!< ENABLE : Compare C enabled.                                               */
} CM4STIMER_STCFG_COMPARECEN_Enum;

/* ===========================================  CM4STIMER STCFG COMPAREBEN [9..9]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_STCFG_COMPAREBEN                                                */
  CM4STIMER_STCFG_COMPAREBEN_DISABLE   = 0,     /*!< DISABLE : Compare B disabled.                                             */
  CM4STIMER_STCFG_COMPAREBEN_ENABLE    = 1,     /*!< ENABLE : Compare B enabled.                                               */
} CM4STIMER_STCFG_COMPAREBEN_Enum;

/* ===========================================  CM4STIMER STCFG COMPAREAEN [8..8]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_STCFG_COMPAREAEN                                                */
  CM4STIMER_STCFG_COMPAREAEN_DISABLE   = 0,     /*!< DISABLE : Compare A disabled.                                             */
  CM4STIMER_STCFG_COMPAREAEN_ENABLE    = 1,     /*!< ENABLE : Compare A enabled.                                               */
} CM4STIMER_STCFG_COMPAREAEN_Enum;

/* =============================================  CM4STIMER STCFG CLKSEL [0..3]  ============================================= */
typedef enum {                                  /*!< CM4STIMER_STCFG_CLKSEL                                                    */
  CM4STIMER_STCFG_CLKSEL_NOCLK         = 0,     /*!< NOCLK : No clock enabled.                                                 */
  CM4STIMER_STCFG_CLKSEL_HFRC_3MHz     = 1,     /*!< HFRC_3MHz : 3M from HFRC clock divider.                                   */
  CM4STIMER_STCFG_CLKSEL_HFRC_187KHz   = 2,     /*!< HFRC_187KHz : 187K from the HFRC clock divider.                           */
  CM4STIMER_STCFG_CLKSEL_XT_32K        = 3,     /*!< XT_32K : 32768Hz from the crystal oscillator                              */
  CM4STIMER_STCFG_CLKSEL_XT_16K        = 4,     /*!< XT_16K : 16384Hz from the crystal oscillator                              */
  CM4STIMER_STCFG_CLKSEL_XT_1K         = 5,     /*!< XT_1K : 1024Hz from the crystal oscillator.                               */
  CM4STIMER_STCFG_CLKSEL_LFRC_1KHZ     = 6,     /*!< LFRC_1KHZ : Approximately 1KHz from the LFRC oscillator (uncalibrated).   */
} CM4STIMER_STCFG_CLKSEL_Enum;

/* =========================================================  STTMR  ========================================================= */
/* =======================================================  SCAPCTRL0  ======================================================= */
/* ==========================================  CM4STIMER SCAPCTRL0 CAPTURE0 [9..9]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_SCAPCTRL0_CAPTURE0                                              */
  CM4STIMER_SCAPCTRL0_CAPTURE0_DISABLE = 0,     /*!< DISABLE : Capture function disabled.                                      */
  CM4STIMER_SCAPCTRL0_CAPTURE0_ENABLE  = 1,     /*!< ENABLE : Capture function enabled.                                        */
} CM4STIMER_SCAPCTRL0_CAPTURE0_Enum;

/* ===========================================  CM4STIMER SCAPCTRL0 STPOL0 [8..8]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_SCAPCTRL0_STPOL0                                                */
  CM4STIMER_SCAPCTRL0_STPOL0_CAPLH     = 0,     /*!< CAPLH : Capture on low to high GPIO transition                            */
  CM4STIMER_SCAPCTRL0_STPOL0_CAPHL     = 1,     /*!< CAPHL : Capture on high to low GPIO transition                            */
} CM4STIMER_SCAPCTRL0_STPOL0_Enum;

