AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* =======================================================  SCAPCTRL1  ======================================================= */
/* ==========================================  CM4STIMER SCAPCTRL1 CAPTURE1 [9..9]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_SCAPCTRL1_CAPTURE1                                              */
  CM4STIMER_SCAPCTRL1_CAPTURE1_DISABLE = 0,     /*!< DISABLE : Capture function disabled.                                      */
  CM4STIMER_SCAPCTRL1_CAPTURE1_ENABLE  = 1,     /*!< ENABLE : Capture function enabled.                                        */
} CM4STIMER_SCAPCTRL1_CAPTURE1_Enum;

/* ===========================================  CM4STIMER SCAPCTRL1 STPOL1 [8..8]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_SCAPCTRL1_STPOL1                                                */
  CM4STIMER_SCAPCTRL1_STPOL1_CAPLH     = 0,     /*!< CAPLH : Capture on low to high GPIO transition                            */
  CM4STIMER_SCAPCTRL1_STPOL1_CAPHL     = 1,     /*!< CAPHL : Capture on high to low GPIO transition                            */
} CM4STIMER_SCAPCTRL1_STPOL1_Enum;

/* =======================================================  SCAPCTRL2  ======================================================= */
/* ==========================================  CM4STIMER SCAPCTRL2 CAPTURE2 [9..9]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_SCAPCTRL2_CAPTURE2                                              */
  CM4STIMER_SCAPCTRL2_CAPTURE2_DISABLE = 0,     /*!< DISABLE : Capture function disabled.                                      */
  CM4STIMER_SCAPCTRL2_CAPTURE2_ENABLE  = 1,     /*!< ENABLE : Capture function enabled.                                        */
} CM4STIMER_SCAPCTRL2_CAPTURE2_Enum;

/* ===========================================  CM4STIMER SCAPCTRL2 STPOL2 [8..8]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_SCAPCTRL2_STPOL2                                                */
  CM4STIMER_SCAPCTRL2_STPOL2_CAPLH     = 0,     /*!< CAPLH : Capture on low to high GPIO transition                            */
  CM4STIMER_SCAPCTRL2_STPOL2_CAPHL     = 1,     /*!< CAPHL : Capture on high to low GPIO transition                            */
} CM4STIMER_SCAPCTRL2_STPOL2_Enum;

/* =======================================================  SCAPCTRL3  ======================================================= */
/* ==========================================  CM4STIMER SCAPCTRL3 CAPTURE3 [9..9]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_SCAPCTRL3_CAPTURE3                                              */
  CM4STIMER_SCAPCTRL3_CAPTURE3_DISABLE = 0,     /*!< DISABLE : Capture function disabled.                                      */
  CM4STIMER_SCAPCTRL3_CAPTURE3_ENABLE  = 1,     /*!< ENABLE : Capture function enabled.                                        */
} CM4STIMER_SCAPCTRL3_CAPTURE3_Enum;

/* ===========================================  CM4STIMER SCAPCTRL3 STPOL3 [8..8]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_SCAPCTRL3_STPOL3                                                */
  CM4STIMER_SCAPCTRL3_STPOL3_CAPLH     = 0,     /*!< CAPLH : Capture on low to high GPIO transition                            */
  CM4STIMER_SCAPCTRL3_STPOL3_CAPHL     = 1,     /*!< CAPHL : Capture on high to low GPIO transition                            */
} CM4STIMER_SCAPCTRL3_STPOL3_Enum;

/* ========================================================  SCMPR0  ========================================================= */
/* ========================================================  SCMPR1  ========================================================= */
/* ========================================================  SCMPR2  ========================================================= */
/* ========================================================  SCMPR3  ========================================================= */
/* ========================================================  SCMPR4  ========================================================= */
/* ========================================================  SCMPR5  ========================================================= */
/* ========================================================  SCMPR6  ========================================================= */
/* ========================================================  SCMPR7  ========================================================= */
/* ========================================================  SCAPT0  ========================================================= */
/* ========================================================  SCAPT1  ========================================================= */
/* ========================================================  SCAPT2  ========================================================= */
/* ========================================================  SCAPT3  ========================================================= */
/* =========================================================  SNVR0  ========================================================= */
/* =========================================================  SNVR1  ========================================================= */
/* =========================================================  SNVR2  ========================================================= */
/* =========================================================  SNVR3  ========================================================= */
/* =======================================================  STMINTEN  ======================================================== */
/* =========================================  CM4STIMER STMINTEN CAPTURED [12..12]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTEN_CAPTURED                                               */
  CM4STIMER_STMINTEN_CAPTURED_CAPD_INT = 1,     /*!< CAPD_INT : Capture D interrupt status bit was set.                        */
  CM4STIMER_STMINTEN_CAPTURED_CAPD_DEFAULT = 0, /*!< CAPD_DEFAULT : Capture D interrupt status default/not set.                */
} CM4STIMER_STMINTEN_CAPTURED_Enum;

/* =========================================  CM4STIMER STMINTEN CAPTUREC [11..11]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTEN_CAPTUREC                                               */
  CM4STIMER_STMINTEN_CAPTUREC_CAPC_INT = 1,     /*!< CAPC_INT : CAPTURE C interrupt status bit was set.                        */
  CM4STIMER_STMINTEN_CAPTUREC_CAPC_DEFAULT = 0, /*!< CAPC_DEFAULT : CAPTURE C interrupt status default/not set.                */
} CM4STIMER_STMINTEN_CAPTUREC_Enum;

/* =========================================  CM4STIMER STMINTEN CAPTUREB [10..10]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTEN_CAPTUREB                                               */
  CM4STIMER_STMINTEN_CAPTUREB_CAPB_INT = 1,     /*!< CAPB_INT : CAPTURE B interrupt status bit was set.                        */
  CM4STIMER_STMINTEN_CAPTUREB_CAPB_DEFAULT = 0, /*!< CAPB_DEFAULT : CAPTURE B interrupt status default/not set.                */
} CM4STIMER_STMINTEN_CAPTUREB_Enum;

/* ==========================================  CM4STIMER STMINTEN CAPTUREA [9..9]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTEN_CAPTUREA                                               */
  CM4STIMER_STMINTEN_CAPTUREA_CAPA_INT = 1,     /*!< CAPA_INT : CAPTURE A interrupt status bit was set.                        */
  CM4STIMER_STMINTEN_CAPTUREA_CAPA_DEFAULT = 0, /*!< CAPA_DEFAULT : CAPTURE A interrupt status default/not set.                */
} CM4STIMER_STMINTEN_CAPTUREA_Enum;

/* ==========================================  CM4STIMER STMINTEN OVERFLOW [8..8]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTEN_OVERFLOW                                               */
  CM4STIMER_STMINTEN_OVERFLOW_OFLOW_INT = 1,    /*!< OFLOW_INT : Overflow interrupt status bit was set.                        */
  CM4STIMER_STMINTEN_OVERFLOW_OFLOW_DEFAULT = 0,/*!< OFLOW_DEFAULT : Overflow interrupt status bit default/not set.            */
} CM4STIMER_STMINTEN_OVERFLOW_Enum;

/* ==========================================  CM4STIMER STMINTEN COMPAREH [7..7]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTEN_COMPAREH                                               */
  CM4STIMER_STMINTEN_COMPAREH_COMPARED = 1,     /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTEN_COMPAREH_DEFAULT  = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTEN_COMPAREH_Enum;

