AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ==========================================  CM4STIMER STMINTEN COMPAREG [6..6]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTEN_COMPAREG                                               */
  CM4STIMER_STMINTEN_COMPAREG_COMPARED = 1,     /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTEN_COMPAREG_DEFAULT  = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTEN_COMPAREG_Enum;

/* ==========================================  CM4STIMER STMINTEN COMPAREF [5..5]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTEN_COMPAREF                                               */
  CM4STIMER_STMINTEN_COMPAREF_COMPARED = 1,     /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTEN_COMPAREF_DEFAULT  = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTEN_COMPAREF_Enum;

/* ==========================================  CM4STIMER STMINTEN COMPAREE [4..4]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTEN_COMPAREE                                               */
  CM4STIMER_STMINTEN_COMPAREE_COMPARED = 1,     /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTEN_COMPAREE_DEFAULT  = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTEN_COMPAREE_Enum;

/* ==========================================  CM4STIMER STMINTEN COMPARED [3..3]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTEN_COMPARED                                               */
  CM4STIMER_STMINTEN_COMPARED_COMPARED = 1,     /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTEN_COMPARED_DEFAULT  = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTEN_COMPARED_Enum;

/* ==========================================  CM4STIMER STMINTEN COMPAREC [2..2]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTEN_COMPAREC                                               */
  CM4STIMER_STMINTEN_COMPAREC_COMPARED = 1,     /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTEN_COMPAREC_DEFAULT  = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTEN_COMPAREC_Enum;

/* ==========================================  CM4STIMER STMINTEN COMPAREB [1..1]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTEN_COMPAREB                                               */
  CM4STIMER_STMINTEN_COMPAREB_COMPARED = 1,     /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTEN_COMPAREB_DEFAULT  = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTEN_COMPAREB_Enum;

/* ==========================================  CM4STIMER STMINTEN COMPAREA [0..0]  =========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTEN_COMPAREA                                               */
  CM4STIMER_STMINTEN_COMPAREA_COMPARED = 1,     /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTEN_COMPAREA_DEFAULT  = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTEN_COMPAREA_Enum;

/* ======================================================  STMINTSTAT  ======================================================= */
/* ========================================  CM4STIMER STMINTSTAT CAPTURED [12..12]  ========================================= */
typedef enum {                                  /*!< CM4STIMER_STMINTSTAT_CAPTURED                                             */
  CM4STIMER_STMINTSTAT_CAPTURED_CAPD_INT = 1,   /*!< CAPD_INT : Capture D interrupt status bit was set.                        */
  CM4STIMER_STMINTSTAT_CAPTURED_CAPD_DEFAULT = 0,/*!< CAPD_DEFAULT : Capture D interrupt status default/not set.               */
} CM4STIMER_STMINTSTAT_CAPTURED_Enum;

/* ========================================  CM4STIMER STMINTSTAT CAPTUREC [11..11]  ========================================= */
typedef enum {                                  /*!< CM4STIMER_STMINTSTAT_CAPTUREC                                             */
  CM4STIMER_STMINTSTAT_CAPTUREC_CAPC_INT = 1,   /*!< CAPC_INT : CAPTURE C interrupt status bit was set.                        */
  CM4STIMER_STMINTSTAT_CAPTUREC_CAPC_DEFAULT = 0,/*!< CAPC_DEFAULT : CAPTURE C interrupt status default/not set.               */
} CM4STIMER_STMINTSTAT_CAPTUREC_Enum;

/* ========================================  CM4STIMER STMINTSTAT CAPTUREB [10..10]  ========================================= */
typedef enum {                                  /*!< CM4STIMER_STMINTSTAT_CAPTUREB                                             */
  CM4STIMER_STMINTSTAT_CAPTUREB_CAPB_INT = 1,   /*!< CAPB_INT : CAPTURE B interrupt status bit was set.                        */
  CM4STIMER_STMINTSTAT_CAPTUREB_CAPB_DEFAULT = 0,/*!< CAPB_DEFAULT : CAPTURE B interrupt status default/not set.               */
} CM4STIMER_STMINTSTAT_CAPTUREB_Enum;

/* =========================================  CM4STIMER STMINTSTAT CAPTUREA [9..9]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSTAT_CAPTUREA                                             */
  CM4STIMER_STMINTSTAT_CAPTUREA_CAPA_INT = 1,   /*!< CAPA_INT : CAPTURE A interrupt status bit was set.                        */
  CM4STIMER_STMINTSTAT_CAPTUREA_CAPA_DEFAULT = 0,/*!< CAPA_DEFAULT : CAPTURE A interrupt status default/not set.               */
} CM4STIMER_STMINTSTAT_CAPTUREA_Enum;

/* =========================================  CM4STIMER STMINTSTAT OVERFLOW [8..8]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSTAT_OVERFLOW                                             */
  CM4STIMER_STMINTSTAT_OVERFLOW_OFLOW_INT = 1,  /*!< OFLOW_INT : Overflow interrupt status bit was set.                        */
  CM4STIMER_STMINTSTAT_OVERFLOW_OFLOW_DEFAULT = 0,/*!< OFLOW_DEFAULT : Overflow interrupt status bit default/not set.          */
} CM4STIMER_STMINTSTAT_OVERFLOW_Enum;

/* =========================================  CM4STIMER STMINTSTAT COMPAREH [7..7]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSTAT_COMPAREH                                             */
  CM4STIMER_STMINTSTAT_COMPAREH_COMPARED = 1,   /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSTAT_COMPAREH_DEFAULT = 0,    /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSTAT_COMPAREH_Enum;

