AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* =========================================  CM4STIMER STMINTSTAT COMPAREG [6..6]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSTAT_COMPAREG                                             */
  CM4STIMER_STMINTSTAT_COMPAREG_COMPARED = 1,   /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSTAT_COMPAREG_DEFAULT = 0,    /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSTAT_COMPAREG_Enum;

/* =========================================  CM4STIMER STMINTSTAT COMPAREF [5..5]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSTAT_COMPAREF                                             */
  CM4STIMER_STMINTSTAT_COMPAREF_COMPARED = 1,   /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSTAT_COMPAREF_DEFAULT = 0,    /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSTAT_COMPAREF_Enum;

/* =========================================  CM4STIMER STMINTSTAT COMPAREE [4..4]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSTAT_COMPAREE                                             */
  CM4STIMER_STMINTSTAT_COMPAREE_COMPARED = 1,   /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSTAT_COMPAREE_DEFAULT = 0,    /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSTAT_COMPAREE_Enum;

/* =========================================  CM4STIMER STMINTSTAT COMPARED [3..3]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSTAT_COMPARED                                             */
  CM4STIMER_STMINTSTAT_COMPARED_COMPARED = 1,   /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSTAT_COMPARED_DEFAULT = 0,    /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSTAT_COMPARED_Enum;

/* =========================================  CM4STIMER STMINTSTAT COMPAREC [2..2]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSTAT_COMPAREC                                             */
  CM4STIMER_STMINTSTAT_COMPAREC_COMPARED = 1,   /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSTAT_COMPAREC_DEFAULT = 0,    /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSTAT_COMPAREC_Enum;

/* =========================================  CM4STIMER STMINTSTAT COMPAREB [1..1]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSTAT_COMPAREB                                             */
  CM4STIMER_STMINTSTAT_COMPAREB_COMPARED = 1,   /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSTAT_COMPAREB_DEFAULT = 0,    /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSTAT_COMPAREB_Enum;

/* =========================================  CM4STIMER STMINTSTAT COMPAREA [0..0]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSTAT_COMPAREA                                             */
  CM4STIMER_STMINTSTAT_COMPAREA_COMPARED = 1,   /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSTAT_COMPAREA_DEFAULT = 0,    /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSTAT_COMPAREA_Enum;

/* =======================================================  STMINTCLR  ======================================================= */
/* =========================================  CM4STIMER STMINTCLR CAPTURED [12..12]  ========================================= */
typedef enum {                                  /*!< CM4STIMER_STMINTCLR_CAPTURED                                              */
  CM4STIMER_STMINTCLR_CAPTURED_CAPD_INT = 1,    /*!< CAPD_INT : Capture D interrupt status bit was set.                        */
  CM4STIMER_STMINTCLR_CAPTURED_CAPD_DEFAULT = 0,/*!< CAPD_DEFAULT : Capture D interrupt status default/not set.                */
} CM4STIMER_STMINTCLR_CAPTURED_Enum;

/* =========================================  CM4STIMER STMINTCLR CAPTUREC [11..11]  ========================================= */
typedef enum {                                  /*!< CM4STIMER_STMINTCLR_CAPTUREC                                              */
  CM4STIMER_STMINTCLR_CAPTUREC_CAPC_INT = 1,    /*!< CAPC_INT : CAPTURE C interrupt status bit was set.                        */
  CM4STIMER_STMINTCLR_CAPTUREC_CAPC_DEFAULT = 0,/*!< CAPC_DEFAULT : CAPTURE C interrupt status default/not set.                */
} CM4STIMER_STMINTCLR_CAPTUREC_Enum;

/* =========================================  CM4STIMER STMINTCLR CAPTUREB [10..10]  ========================================= */
typedef enum {                                  /*!< CM4STIMER_STMINTCLR_CAPTUREB                                              */
  CM4STIMER_STMINTCLR_CAPTUREB_CAPB_INT = 1,    /*!< CAPB_INT : CAPTURE B interrupt status bit was set.                        */
  CM4STIMER_STMINTCLR_CAPTUREB_CAPB_DEFAULT = 0,/*!< CAPB_DEFAULT : CAPTURE B interrupt status default/not set.                */
} CM4STIMER_STMINTCLR_CAPTUREB_Enum;

/* ==========================================  CM4STIMER STMINTCLR CAPTUREA [9..9]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTCLR_CAPTUREA                                              */
  CM4STIMER_STMINTCLR_CAPTUREA_CAPA_INT = 1,    /*!< CAPA_INT : CAPTURE A interrupt status bit was set.                        */
  CM4STIMER_STMINTCLR_CAPTUREA_CAPA_DEFAULT = 0,/*!< CAPA_DEFAULT : CAPTURE A interrupt status default/not set.                */
} CM4STIMER_STMINTCLR_CAPTUREA_Enum;

/* ==========================================  CM4STIMER STMINTCLR OVERFLOW [8..8]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTCLR_OVERFLOW                                              */
  CM4STIMER_STMINTCLR_OVERFLOW_OFLOW_INT = 1,   /*!< OFLOW_INT : Overflow interrupt status bit was set.                        */
  CM4STIMER_STMINTCLR_OVERFLOW_OFLOW_DEFAULT = 0,/*!< OFLOW_DEFAULT : Overflow interrupt status bit default/not set.           */
} CM4STIMER_STMINTCLR_OVERFLOW_Enum;

/* ==========================================  CM4STIMER STMINTCLR COMPAREH [7..7]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTCLR_COMPAREH                                              */
  CM4STIMER_STMINTCLR_COMPAREH_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTCLR_COMPAREH_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTCLR_COMPAREH_Enum;

/* ==========================================  CM4STIMER STMINTCLR COMPAREG [6..6]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTCLR_COMPAREG                                              */
  CM4STIMER_STMINTCLR_COMPAREG_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTCLR_COMPAREG_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTCLR_COMPAREG_Enum;

/* ==========================================  CM4STIMER STMINTCLR COMPAREF [5..5]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTCLR_COMPAREF                                              */
  CM4STIMER_STMINTCLR_COMPAREF_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTCLR_COMPAREF_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTCLR_COMPAREF_Enum;

/* ==========================================  CM4STIMER STMINTCLR COMPAREE [4..4]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTCLR_COMPAREE                                              */
  CM4STIMER_STMINTCLR_COMPAREE_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTCLR_COMPAREE_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTCLR_COMPAREE_Enum;

/* ==========================================  CM4STIMER STMINTCLR COMPARED [3..3]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTCLR_COMPARED                                              */
  CM4STIMER_STMINTCLR_COMPARED_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTCLR_COMPARED_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTCLR_COMPARED_Enum;

