AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ==========================================  CM4STIMER STMINTCLR COMPAREC [2..2]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTCLR_COMPAREC                                              */
  CM4STIMER_STMINTCLR_COMPAREC_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTCLR_COMPAREC_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTCLR_COMPAREC_Enum;

/* ==========================================  CM4STIMER STMINTCLR COMPAREB [1..1]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTCLR_COMPAREB                                              */
  CM4STIMER_STMINTCLR_COMPAREB_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTCLR_COMPAREB_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTCLR_COMPAREB_Enum;

/* ==========================================  CM4STIMER STMINTCLR COMPAREA [0..0]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTCLR_COMPAREA                                              */
  CM4STIMER_STMINTCLR_COMPAREA_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTCLR_COMPAREA_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTCLR_COMPAREA_Enum;

/* =======================================================  STMINTSET  ======================================================= */
/* =========================================  CM4STIMER STMINTSET CAPTURED [12..12]  ========================================= */
typedef enum {                                  /*!< CM4STIMER_STMINTSET_CAPTURED                                              */
  CM4STIMER_STMINTSET_CAPTURED_CAPD_INT = 1,    /*!< CAPD_INT : Capture D interrupt status bit was set.                        */
  CM4STIMER_STMINTSET_CAPTURED_CAPD_DEFAULT = 0,/*!< CAPD_DEFAULT : Capture D interrupt status default/not set.                */
} CM4STIMER_STMINTSET_CAPTURED_Enum;

/* =========================================  CM4STIMER STMINTSET CAPTUREC [11..11]  ========================================= */
typedef enum {                                  /*!< CM4STIMER_STMINTSET_CAPTUREC                                              */
  CM4STIMER_STMINTSET_CAPTUREC_CAPC_INT = 1,    /*!< CAPC_INT : CAPTURE C interrupt status bit was set.                        */
  CM4STIMER_STMINTSET_CAPTUREC_CAPC_DEFAULT = 0,/*!< CAPC_DEFAULT : CAPTURE C interrupt status default/not set.                */
} CM4STIMER_STMINTSET_CAPTUREC_Enum;

/* =========================================  CM4STIMER STMINTSET CAPTUREB [10..10]  ========================================= */
typedef enum {                                  /*!< CM4STIMER_STMINTSET_CAPTUREB                                              */
  CM4STIMER_STMINTSET_CAPTUREB_CAPB_INT = 1,    /*!< CAPB_INT : CAPTURE B interrupt status bit was set.                        */
  CM4STIMER_STMINTSET_CAPTUREB_CAPB_DEFAULT = 0,/*!< CAPB_DEFAULT : CAPTURE B interrupt status default/not set.                */
} CM4STIMER_STMINTSET_CAPTUREB_Enum;

/* ==========================================  CM4STIMER STMINTSET CAPTUREA [9..9]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSET_CAPTUREA                                              */
  CM4STIMER_STMINTSET_CAPTUREA_CAPA_INT = 1,    /*!< CAPA_INT : CAPTURE A interrupt status bit was set.                        */
  CM4STIMER_STMINTSET_CAPTUREA_CAPA_DEFAULT = 0,/*!< CAPA_DEFAULT : CAPTURE A interrupt status default/not set.                */
} CM4STIMER_STMINTSET_CAPTUREA_Enum;

/* ==========================================  CM4STIMER STMINTSET OVERFLOW [8..8]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSET_OVERFLOW                                              */
  CM4STIMER_STMINTSET_OVERFLOW_OFLOW_INT = 1,   /*!< OFLOW_INT : Overflow interrupt status bit was set.                        */
  CM4STIMER_STMINTSET_OVERFLOW_OFLOW_DEFAULT = 0,/*!< OFLOW_DEFAULT : Overflow interrupt status bit default/not set.           */
} CM4STIMER_STMINTSET_OVERFLOW_Enum;

/* ==========================================  CM4STIMER STMINTSET COMPAREH [7..7]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSET_COMPAREH                                              */
  CM4STIMER_STMINTSET_COMPAREH_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSET_COMPAREH_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSET_COMPAREH_Enum;

/* ==========================================  CM4STIMER STMINTSET COMPAREG [6..6]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSET_COMPAREG                                              */
  CM4STIMER_STMINTSET_COMPAREG_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSET_COMPAREG_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSET_COMPAREG_Enum;

/* ==========================================  CM4STIMER STMINTSET COMPAREF [5..5]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSET_COMPAREF                                              */
  CM4STIMER_STMINTSET_COMPAREF_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSET_COMPAREF_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSET_COMPAREF_Enum;

/* ==========================================  CM4STIMER STMINTSET COMPAREE [4..4]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSET_COMPAREE                                              */
  CM4STIMER_STMINTSET_COMPAREE_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSET_COMPAREE_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSET_COMPAREE_Enum;

