AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ==========================================  CM4STIMER STMINTSET COMPARED [3..3]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSET_COMPARED                                              */
  CM4STIMER_STMINTSET_COMPARED_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSET_COMPARED_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSET_COMPARED_Enum;

/* ==========================================  CM4STIMER STMINTSET COMPAREC [2..2]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSET_COMPAREC                                              */
  CM4STIMER_STMINTSET_COMPAREC_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSET_COMPAREC_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSET_COMPAREC_Enum;

/* ==========================================  CM4STIMER STMINTSET COMPAREB [1..1]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSET_COMPAREB                                              */
  CM4STIMER_STMINTSET_COMPAREB_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSET_COMPAREB_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSET_COMPAREB_Enum;

/* ==========================================  CM4STIMER STMINTSET COMPAREA [0..0]  ========================================== */
typedef enum {                                  /*!< CM4STIMER_STMINTSET_COMPAREA                                              */
  CM4STIMER_STMINTSET_COMPAREA_COMPARED = 1,    /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  CM4STIMER_STMINTSET_COMPAREA_DEFAULT = 0,     /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} CM4STIMER_STMINTSET_COMPAREA_Enum;



/* =========================================================================================================================== */
/* ================                                         CM4TIMER                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* ========================================================  STATUS  ========================================================= */
/* ========================================================  GLOBEN  ========================================================= */
/* ============================================  CM4TIMER GLOBEN ADCEN [30..30]  ============================================= */
typedef enum {                                  /*!< CM4TIMER_GLOBEN_ADCEN                                                     */
  CM4TIMER_GLOBEN_ADCEN_EN             = 1,     /*!< EN : Timer Enabled. TMREN enable is used.                                 */
  CM4TIMER_GLOBEN_ADCEN_DIS            = 0,     /*!< DIS : Disable TIMER .                                                     */
} CM4TIMER_GLOBEN_ADCEN_Enum;

/* =======================================  CM4TIMER GLOBEN ENABLEALLINPUTS [29..29]  ======================================== */
typedef enum {                                  /*!< CM4TIMER_GLOBEN_ENABLEALLINPUTS                                           */
  CM4TIMER_GLOBEN_ENABLEALLINPUTS_EN   = 1,     /*!< EN : Override to enable all inputs from GPIO                              */
  CM4TIMER_GLOBEN_ENABLEALLINPUTS_DIS  = 0,     /*!< DIS : Normal mode where inputs from GPIO are enabled based on
                                                     enabled clock and triggers.                                               */
} CM4TIMER_GLOBEN_ENABLEALLINPUTS_Enum;

/* ==============================================  CM4TIMER GLOBEN ENB3 [3..3]  ============================================== */
typedef enum {                                  /*!< CM4TIMER_GLOBEN_ENB3                                                      */
  CM4TIMER_GLOBEN_ENB3_EN              = 1,     /*!< EN : Timer Enabled. TMR3EN enable is used.                                */
  CM4TIMER_GLOBEN_ENB3_DIS             = 0,     /*!< DIS : Disable TIMER 3.                                                    */
} CM4TIMER_GLOBEN_ENB3_Enum;

/* ==============================================  CM4TIMER GLOBEN ENB2 [2..2]  ============================================== */
typedef enum {                                  /*!< CM4TIMER_GLOBEN_ENB2                                                      */
  CM4TIMER_GLOBEN_ENB2_EN              = 1,     /*!< EN : Timer Enabled. TMR2EN enable is used.                                */
  CM4TIMER_GLOBEN_ENB2_DIS             = 0,     /*!< DIS : Disable TIMER 2.                                                    */
} CM4TIMER_GLOBEN_ENB2_Enum;

/* ==============================================  CM4TIMER GLOBEN ENB1 [1..1]  ============================================== */
typedef enum {                                  /*!< CM4TIMER_GLOBEN_ENB1                                                      */
  CM4TIMER_GLOBEN_ENB1_EN              = 1,     /*!< EN : Timer Enabled. TMR1EN enable is used.                                */
  CM4TIMER_GLOBEN_ENB1_DIS             = 0,     /*!< DIS : Disable TIMER 1.                                                    */
} CM4TIMER_GLOBEN_ENB1_Enum;

/* ==============================================  CM4TIMER GLOBEN ENB0 [0..0]  ============================================== */
typedef enum {                                  /*!< CM4TIMER_GLOBEN_ENB0                                                      */
  CM4TIMER_GLOBEN_ENB0_EN              = 1,     /*!< EN : Timer Enabled. TMR0EN enable is used.                                */
  CM4TIMER_GLOBEN_ENB0_DIS             = 0,     /*!< DIS : Disable TIMER 0.                                                    */
} CM4TIMER_GLOBEN_ENB0_Enum;

