AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* ========================================================  OUTCFG0  ======================================================== */
/* ===========================================  CM4TIMER OUTCFG0 OUTCFG3 [24..29]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG0_OUTCFG3                                                  */
  CM4TIMER_OUTCFG0_OUTCFG3_TIMER00     = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG3_TIMER01     = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG3_TIMER10     = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG3_TIMER11     = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG3_TIMER20     = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG3_TIMER21     = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG3_TIMER30     = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG3_TIMER31     = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG3_STIMER0     = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG0_OUTCFG3_STIMER1     = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG0_OUTCFG3_STIMER2     = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG0_OUTCFG3_STIMER3     = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG0_OUTCFG3_STIMER4     = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG0_OUTCFG3_STIMER5     = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG0_OUTCFG3_STIMER6     = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG0_OUTCFG3_STIMER7     = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG0_OUTCFG3_DISABLED    = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG0_OUTCFG3_Enum;

/* ===========================================  CM4TIMER OUTCFG0 OUTCFG2 [16..21]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG0_OUTCFG2                                                  */
  CM4TIMER_OUTCFG0_OUTCFG2_TIMER00     = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG2_TIMER01     = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG2_TIMER10     = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG2_TIMER11     = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG2_TIMER20     = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG2_TIMER21     = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG2_TIMER30     = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG2_TIMER31     = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG2_STIMER0     = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG0_OUTCFG2_STIMER1     = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG0_OUTCFG2_STIMER2     = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG0_OUTCFG2_STIMER3     = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG0_OUTCFG2_STIMER4     = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG0_OUTCFG2_STIMER5     = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG0_OUTCFG2_STIMER6     = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG0_OUTCFG2_STIMER7     = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG0_OUTCFG2_DISABLED    = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG0_OUTCFG2_Enum;

/* ===========================================  CM4TIMER OUTCFG0 OUTCFG1 [8..13]  ============================================ */
typedef enum {                                  /*!< CM4TIMER_OUTCFG0_OUTCFG1                                                  */
  CM4TIMER_OUTCFG0_OUTCFG1_TIMER00     = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG1_TIMER01     = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG1_TIMER10     = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG1_TIMER11     = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG1_TIMER20     = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG1_TIMER21     = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG1_TIMER30     = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG1_TIMER31     = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG1_STIMER0     = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG0_OUTCFG1_STIMER1     = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG0_OUTCFG1_STIMER2     = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG0_OUTCFG1_STIMER3     = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG0_OUTCFG1_STIMER4     = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG0_OUTCFG1_STIMER5     = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG0_OUTCFG1_STIMER6     = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG0_OUTCFG1_STIMER7     = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG0_OUTCFG1_DISABLED    = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG0_OUTCFG1_Enum;

/* ============================================  CM4TIMER OUTCFG0 OUTCFG0 [0..5]  ============================================ */
typedef enum {                                  /*!< CM4TIMER_OUTCFG0_OUTCFG0                                                  */
  CM4TIMER_OUTCFG0_OUTCFG0_TIMER00     = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG0_TIMER01     = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG0_TIMER10     = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG0_TIMER11     = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG0_TIMER20     = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG0_TIMER21     = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG0_TIMER30     = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG0_OUTCFG0_TIMER31     = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG0_OUTCFG0_STIMER0     = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG0_OUTCFG0_STIMER1     = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG0_OUTCFG0_STIMER2     = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG0_OUTCFG0_STIMER3     = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG0_OUTCFG0_STIMER4     = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG0_OUTCFG0_STIMER5     = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG0_OUTCFG0_STIMER6     = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG0_OUTCFG0_STIMER7     = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG0_OUTCFG0_DISABLED    = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG0_OUTCFG0_Enum;

/* ========================================================  OUTCFG1  ======================================================== */
/* ===========================================  CM4TIMER OUTCFG1 OUTCFG7 [24..29]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG1_OUTCFG7                                                  */
  CM4TIMER_OUTCFG1_OUTCFG7_TIMER00     = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG1_OUTCFG7_TIMER01     = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG1_OUTCFG7_TIMER10     = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG1_OUTCFG7_TIMER11     = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG1_OUTCFG7_TIMER20     = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG1_OUTCFG7_TIMER21     = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG1_OUTCFG7_TIMER30     = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG1_OUTCFG7_TIMER31     = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG1_OUTCFG7_STIMER0     = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG1_OUTCFG7_STIMER1     = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG1_OUTCFG7_STIMER2     = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG1_OUTCFG7_STIMER3     = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG1_OUTCFG7_STIMER4     = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG1_OUTCFG7_STIMER5     = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG1_OUTCFG7_STIMER6     = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG1_OUTCFG7_STIMER7     = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG1_OUTCFG7_DISABLED    = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG1_OUTCFG7_Enum;

