AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ========================================================  OUTCFG2  ======================================================== */
/* ==========================================  CM4TIMER OUTCFG2 OUTCFG11 [24..29]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG2_OUTCFG11                                                 */
  CM4TIMER_OUTCFG2_OUTCFG11_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG11_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG11_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG11_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG11_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG11_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG11_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG11_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG11_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG2_OUTCFG11_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG2_OUTCFG11_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG2_OUTCFG11_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG2_OUTCFG11_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG2_OUTCFG11_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG2_OUTCFG11_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG2_OUTCFG11_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG2_OUTCFG11_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG2_OUTCFG11_Enum;

/* ==========================================  CM4TIMER OUTCFG2 OUTCFG10 [16..21]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG2_OUTCFG10                                                 */
  CM4TIMER_OUTCFG2_OUTCFG10_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG10_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG10_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG10_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG10_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG10_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG10_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG10_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG10_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG2_OUTCFG10_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG2_OUTCFG10_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG2_OUTCFG10_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG2_OUTCFG10_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG2_OUTCFG10_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG2_OUTCFG10_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG2_OUTCFG10_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG2_OUTCFG10_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG2_OUTCFG10_Enum;

/* ===========================================  CM4TIMER OUTCFG2 OUTCFG9 [8..13]  ============================================ */
typedef enum {                                  /*!< CM4TIMER_OUTCFG2_OUTCFG9                                                  */
  CM4TIMER_OUTCFG2_OUTCFG9_TIMER00     = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG9_TIMER01     = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG9_TIMER10     = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG9_TIMER11     = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG9_TIMER20     = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG9_TIMER21     = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG9_TIMER30     = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG9_TIMER31     = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG9_STIMER0     = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG2_OUTCFG9_STIMER1     = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG2_OUTCFG9_STIMER2     = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG2_OUTCFG9_STIMER3     = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG2_OUTCFG9_STIMER4     = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG2_OUTCFG9_STIMER5     = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG2_OUTCFG9_STIMER6     = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG2_OUTCFG9_STIMER7     = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG2_OUTCFG9_DISABLED    = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG2_OUTCFG9_Enum;

