AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ============================================  CM4TIMER OUTCFG2 OUTCFG8 [0..5]  ============================================ */
typedef enum {                                  /*!< CM4TIMER_OUTCFG2_OUTCFG8                                                  */
  CM4TIMER_OUTCFG2_OUTCFG8_TIMER00     = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG8_TIMER01     = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG8_TIMER10     = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG8_TIMER11     = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG8_TIMER20     = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG8_TIMER21     = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG8_TIMER30     = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG2_OUTCFG8_TIMER31     = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG2_OUTCFG8_STIMER0     = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG2_OUTCFG8_STIMER1     = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG2_OUTCFG8_STIMER2     = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG2_OUTCFG8_STIMER3     = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG2_OUTCFG8_STIMER4     = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG2_OUTCFG8_STIMER5     = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG2_OUTCFG8_STIMER6     = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG2_OUTCFG8_STIMER7     = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG2_OUTCFG8_DISABLED    = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG2_OUTCFG8_Enum;

/* ========================================================  OUTCFG3  ======================================================== */
/* ==========================================  CM4TIMER OUTCFG3 OUTCFG15 [24..29]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG3_OUTCFG15                                                 */
  CM4TIMER_OUTCFG3_OUTCFG15_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG3_OUTCFG15_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG3_OUTCFG15_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG3_OUTCFG15_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG3_OUTCFG15_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG3_OUTCFG15_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG3_OUTCFG15_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG3_OUTCFG15_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG3_OUTCFG15_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG3_OUTCFG15_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG3_OUTCFG15_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG3_OUTCFG15_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG3_OUTCFG15_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG3_OUTCFG15_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG3_OUTCFG15_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG3_OUTCFG15_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG3_OUTCFG15_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG3_OUTCFG15_Enum;

/* ==========================================  CM4TIMER OUTCFG3 OUTCFG14 [16..21]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG3_OUTCFG14                                                 */
  CM4TIMER_OUTCFG3_OUTCFG14_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG3_OUTCFG14_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG3_OUTCFG14_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG3_OUTCFG14_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG3_OUTCFG14_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG3_OUTCFG14_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG3_OUTCFG14_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG3_OUTCFG14_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG3_OUTCFG14_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG3_OUTCFG14_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG3_OUTCFG14_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG3_OUTCFG14_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG3_OUTCFG14_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG3_OUTCFG14_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG3_OUTCFG14_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG3_OUTCFG14_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG3_OUTCFG14_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG3_OUTCFG14_Enum;

