AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ===========================================  CM4TIMER OUTCFG7 OUTCFG29 [8..13]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG7_OUTCFG29                                                 */
  CM4TIMER_OUTCFG7_OUTCFG29_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG7_OUTCFG29_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG7_OUTCFG29_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG7_OUTCFG29_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG7_OUTCFG29_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG7_OUTCFG29_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG7_OUTCFG29_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG7_OUTCFG29_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG7_OUTCFG29_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG7_OUTCFG29_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG7_OUTCFG29_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG7_OUTCFG29_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG7_OUTCFG29_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG7_OUTCFG29_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG7_OUTCFG29_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG7_OUTCFG29_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG7_OUTCFG29_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG7_OUTCFG29_Enum;

/* ===========================================  CM4TIMER OUTCFG7 OUTCFG28 [0..5]  ============================================ */
typedef enum {                                  /*!< CM4TIMER_OUTCFG7_OUTCFG28                                                 */
  CM4TIMER_OUTCFG7_OUTCFG28_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG7_OUTCFG28_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG7_OUTCFG28_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG7_OUTCFG28_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG7_OUTCFG28_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG7_OUTCFG28_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG7_OUTCFG28_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG7_OUTCFG28_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG7_OUTCFG28_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG7_OUTCFG28_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG7_OUTCFG28_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG7_OUTCFG28_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG7_OUTCFG28_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG7_OUTCFG28_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG7_OUTCFG28_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG7_OUTCFG28_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG7_OUTCFG28_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG7_OUTCFG28_Enum;

/* ========================================================  OUTCFG8  ======================================================== */
/* ==========================================  CM4TIMER OUTCFG8 OUTCFG35 [24..29]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG8_OUTCFG35                                                 */
  CM4TIMER_OUTCFG8_OUTCFG35_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG35_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG35_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG35_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG35_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG35_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG35_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG35_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG35_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG8_OUTCFG35_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG8_OUTCFG35_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG8_OUTCFG35_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG8_OUTCFG35_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG8_OUTCFG35_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG8_OUTCFG35_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG8_OUTCFG35_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG8_OUTCFG35_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG8_OUTCFG35_Enum;

/* ==========================================  CM4TIMER OUTCFG8 OUTCFG34 [16..21]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG8_OUTCFG34                                                 */
  CM4TIMER_OUTCFG8_OUTCFG34_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG34_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG34_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG34_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG34_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG34_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG34_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG34_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG34_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG8_OUTCFG34_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG8_OUTCFG34_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG8_OUTCFG34_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG8_OUTCFG34_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG8_OUTCFG34_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG8_OUTCFG34_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG8_OUTCFG34_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG8_OUTCFG34_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG8_OUTCFG34_Enum;

