AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ===========================================  CM4TIMER OUTCFG8 OUTCFG33 [8..13]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG8_OUTCFG33                                                 */
  CM4TIMER_OUTCFG8_OUTCFG33_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG33_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG33_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG33_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG33_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG33_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG33_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG33_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG33_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG8_OUTCFG33_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG8_OUTCFG33_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG8_OUTCFG33_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG8_OUTCFG33_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG8_OUTCFG33_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG8_OUTCFG33_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG8_OUTCFG33_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG8_OUTCFG33_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG8_OUTCFG33_Enum;

/* ===========================================  CM4TIMER OUTCFG8 OUTCFG32 [0..5]  ============================================ */
typedef enum {                                  /*!< CM4TIMER_OUTCFG8_OUTCFG32                                                 */
  CM4TIMER_OUTCFG8_OUTCFG32_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG32_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG32_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG32_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG32_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG32_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG32_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG8_OUTCFG32_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG8_OUTCFG32_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG8_OUTCFG32_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG8_OUTCFG32_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG8_OUTCFG32_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG8_OUTCFG32_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG8_OUTCFG32_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG8_OUTCFG32_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG8_OUTCFG32_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG8_OUTCFG32_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG8_OUTCFG32_Enum;

/* ========================================================  OUTCFG9  ======================================================== */
/* ==========================================  CM4TIMER OUTCFG9 OUTCFG39 [24..29]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG9_OUTCFG39                                                 */
  CM4TIMER_OUTCFG9_OUTCFG39_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG39_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG39_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG39_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG39_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG39_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG39_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG39_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG39_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG9_OUTCFG39_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG9_OUTCFG39_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG9_OUTCFG39_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG9_OUTCFG39_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG9_OUTCFG39_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG9_OUTCFG39_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG9_OUTCFG39_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG9_OUTCFG39_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG9_OUTCFG39_Enum;

