AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ==========================================  CM4TIMER OUTCFG9 OUTCFG38 [16..21]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG9_OUTCFG38                                                 */
  CM4TIMER_OUTCFG9_OUTCFG38_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG38_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG38_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG38_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG38_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG38_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG38_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG38_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG38_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG9_OUTCFG38_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG9_OUTCFG38_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG9_OUTCFG38_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG9_OUTCFG38_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG9_OUTCFG38_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG9_OUTCFG38_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG9_OUTCFG38_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG9_OUTCFG38_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG9_OUTCFG38_Enum;

/* ===========================================  CM4TIMER OUTCFG9 OUTCFG37 [8..13]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG9_OUTCFG37                                                 */
  CM4TIMER_OUTCFG9_OUTCFG37_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG37_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG37_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG37_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG37_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG37_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG37_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG37_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG37_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG9_OUTCFG37_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG9_OUTCFG37_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG9_OUTCFG37_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG9_OUTCFG37_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG9_OUTCFG37_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG9_OUTCFG37_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG9_OUTCFG37_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG9_OUTCFG37_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG9_OUTCFG37_Enum;

/* ===========================================  CM4TIMER OUTCFG9 OUTCFG36 [0..5]  ============================================ */
typedef enum {                                  /*!< CM4TIMER_OUTCFG9_OUTCFG36                                                 */
  CM4TIMER_OUTCFG9_OUTCFG36_TIMER00    = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG36_TIMER01    = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG36_TIMER10    = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG36_TIMER11    = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG36_TIMER20    = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG36_TIMER21    = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG36_TIMER30    = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG9_OUTCFG36_TIMER31    = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG9_OUTCFG36_STIMER0    = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG9_OUTCFG36_STIMER1    = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG9_OUTCFG36_STIMER2    = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG9_OUTCFG36_STIMER3    = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG9_OUTCFG36_STIMER4    = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG9_OUTCFG36_STIMER5    = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG9_OUTCFG36_STIMER6    = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG9_OUTCFG36_STIMER7    = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG9_OUTCFG36_DISABLED   = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG9_OUTCFG36_Enum;

/* =======================================================  OUTCFG10  ======================================================== */
/* ==========================================  CM4TIMER OUTCFG10 OUTCFG43 [24..29]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG10_OUTCFG43                                                */
  CM4TIMER_OUTCFG10_OUTCFG43_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG43_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG43_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG43_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG43_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG43_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG43_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG43_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG43_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG10_OUTCFG43_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG10_OUTCFG43_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG10_OUTCFG43_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG10_OUTCFG43_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG10_OUTCFG43_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG10_OUTCFG43_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG10_OUTCFG43_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG10_OUTCFG43_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG10_OUTCFG43_Enum;

/* ==========================================  CM4TIMER OUTCFG10 OUTCFG42 [16..21]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG10_OUTCFG42                                                */
  CM4TIMER_OUTCFG10_OUTCFG42_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG42_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG42_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG42_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG42_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG42_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG42_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG42_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG42_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG10_OUTCFG42_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG10_OUTCFG42_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG10_OUTCFG42_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG10_OUTCFG42_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG10_OUTCFG42_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG10_OUTCFG42_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG10_OUTCFG42_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG10_OUTCFG42_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG10_OUTCFG42_Enum;

/* ==========================================  CM4TIMER OUTCFG10 OUTCFG41 [8..13]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG10_OUTCFG41                                                */
  CM4TIMER_OUTCFG10_OUTCFG41_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG41_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG41_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG41_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG41_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG41_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG41_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG41_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG41_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG10_OUTCFG41_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG10_OUTCFG41_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG10_OUTCFG41_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG10_OUTCFG41_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG10_OUTCFG41_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG10_OUTCFG41_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG10_OUTCFG41_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG10_OUTCFG41_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG10_OUTCFG41_Enum;

/* ===========================================  CM4TIMER OUTCFG10 OUTCFG40 [0..5]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG10_OUTCFG40                                                */
  CM4TIMER_OUTCFG10_OUTCFG40_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG40_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG40_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG40_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG40_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG40_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG40_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG10_OUTCFG40_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG10_OUTCFG40_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG10_OUTCFG40_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG10_OUTCFG40_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG10_OUTCFG40_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG10_OUTCFG40_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG10_OUTCFG40_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG10_OUTCFG40_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG10_OUTCFG40_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG10_OUTCFG40_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG10_OUTCFG40_Enum;

/* =======================================================  OUTCFG11  ======================================================== */
/* ==========================================  CM4TIMER OUTCFG11 OUTCFG47 [24..29]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG11_OUTCFG47                                                */
  CM4TIMER_OUTCFG11_OUTCFG47_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG47_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG47_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG47_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG47_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG47_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG47_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG47_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG47_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG11_OUTCFG47_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG11_OUTCFG47_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG11_OUTCFG47_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG11_OUTCFG47_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG11_OUTCFG47_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG11_OUTCFG47_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG11_OUTCFG47_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG11_OUTCFG47_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG11_OUTCFG47_Enum;

/* ==========================================  CM4TIMER OUTCFG11 OUTCFG46 [16..21]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG11_OUTCFG46                                                */
  CM4TIMER_OUTCFG11_OUTCFG46_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG46_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG46_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG46_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG46_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG46_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG46_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG46_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG46_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG11_OUTCFG46_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG11_OUTCFG46_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG11_OUTCFG46_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG11_OUTCFG46_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG11_OUTCFG46_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG11_OUTCFG46_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG11_OUTCFG46_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG11_OUTCFG46_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG11_OUTCFG46_Enum;

