AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ==========================================  CM4TIMER OUTCFG11 OUTCFG45 [8..13]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG11_OUTCFG45                                                */
  CM4TIMER_OUTCFG11_OUTCFG45_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG45_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG45_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG45_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG45_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG45_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG45_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG45_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG45_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG11_OUTCFG45_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG11_OUTCFG45_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG11_OUTCFG45_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG11_OUTCFG45_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG11_OUTCFG45_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG11_OUTCFG45_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG11_OUTCFG45_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG11_OUTCFG45_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG11_OUTCFG45_Enum;

/* ===========================================  CM4TIMER OUTCFG11 OUTCFG44 [0..5]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG11_OUTCFG44                                                */
  CM4TIMER_OUTCFG11_OUTCFG44_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG44_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG44_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG44_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG44_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG44_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG44_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG11_OUTCFG44_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG11_OUTCFG44_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG11_OUTCFG44_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG11_OUTCFG44_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG11_OUTCFG44_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG11_OUTCFG44_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG11_OUTCFG44_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG11_OUTCFG44_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG11_OUTCFG44_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG11_OUTCFG44_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG11_OUTCFG44_Enum;

/* =======================================================  OUTCFG12  ======================================================== */
/* ==========================================  CM4TIMER OUTCFG12 OUTCFG51 [24..29]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG12_OUTCFG51                                                */
  CM4TIMER_OUTCFG12_OUTCFG51_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG12_OUTCFG51_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG12_OUTCFG51_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG12_OUTCFG51_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG12_OUTCFG51_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG12_OUTCFG51_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG12_OUTCFG51_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG12_OUTCFG51_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG12_OUTCFG51_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG12_OUTCFG51_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG12_OUTCFG51_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG12_OUTCFG51_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG12_OUTCFG51_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG12_OUTCFG51_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG12_OUTCFG51_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG12_OUTCFG51_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG12_OUTCFG51_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG12_OUTCFG51_Enum;

