AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* =======================================================  OUTCFG14  ======================================================== */
/* ==========================================  CM4TIMER OUTCFG14 OUTCFG59 [24..29]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG14_OUTCFG59                                                */
  CM4TIMER_OUTCFG14_OUTCFG59_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG59_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG59_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG59_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG59_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG59_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG59_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG59_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG59_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG14_OUTCFG59_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG14_OUTCFG59_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG14_OUTCFG59_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG14_OUTCFG59_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG14_OUTCFG59_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG14_OUTCFG59_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG14_OUTCFG59_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG14_OUTCFG59_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG14_OUTCFG59_Enum;

/* ==========================================  CM4TIMER OUTCFG14 OUTCFG58 [16..21]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG14_OUTCFG58                                                */
  CM4TIMER_OUTCFG14_OUTCFG58_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG58_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG58_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG58_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG58_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG58_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG58_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG58_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG58_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG14_OUTCFG58_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG14_OUTCFG58_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG14_OUTCFG58_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG14_OUTCFG58_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG14_OUTCFG58_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG14_OUTCFG58_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG14_OUTCFG58_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG14_OUTCFG58_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG14_OUTCFG58_Enum;

/* ==========================================  CM4TIMER OUTCFG14 OUTCFG57 [8..13]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG14_OUTCFG57                                                */
  CM4TIMER_OUTCFG14_OUTCFG57_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG57_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG57_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG57_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG57_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG57_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG57_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG57_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG57_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG14_OUTCFG57_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG14_OUTCFG57_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG14_OUTCFG57_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG14_OUTCFG57_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG14_OUTCFG57_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG14_OUTCFG57_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG14_OUTCFG57_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG14_OUTCFG57_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG14_OUTCFG57_Enum;

/* ===========================================  CM4TIMER OUTCFG14 OUTCFG56 [0..5]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG14_OUTCFG56                                                */
  CM4TIMER_OUTCFG14_OUTCFG56_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG56_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG56_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG56_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG56_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG56_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG56_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG14_OUTCFG56_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG14_OUTCFG56_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG14_OUTCFG56_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG14_OUTCFG56_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG14_OUTCFG56_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG14_OUTCFG56_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG14_OUTCFG56_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG14_OUTCFG56_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG14_OUTCFG56_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG14_OUTCFG56_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG14_OUTCFG56_Enum;

