AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ===========================================  CM4TIMER OUTCFG21 OUTCFG84 [0..5]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG21_OUTCFG84                                                */
  CM4TIMER_OUTCFG21_OUTCFG84_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG21_OUTCFG84_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG21_OUTCFG84_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG21_OUTCFG84_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG21_OUTCFG84_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG21_OUTCFG84_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG21_OUTCFG84_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG21_OUTCFG84_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG21_OUTCFG84_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG21_OUTCFG84_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG21_OUTCFG84_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG21_OUTCFG84_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG21_OUTCFG84_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG21_OUTCFG84_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG21_OUTCFG84_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG21_OUTCFG84_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG21_OUTCFG84_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG21_OUTCFG84_Enum;

/* =======================================================  OUTCFG22  ======================================================== */
/* ==========================================  CM4TIMER OUTCFG22 OUTCFG91 [24..29]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG22_OUTCFG91                                                */
  CM4TIMER_OUTCFG22_OUTCFG91_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG91_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG91_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG91_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG91_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG91_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG91_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG91_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG91_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG22_OUTCFG91_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG22_OUTCFG91_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG22_OUTCFG91_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG22_OUTCFG91_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG22_OUTCFG91_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG22_OUTCFG91_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG22_OUTCFG91_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG22_OUTCFG91_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG22_OUTCFG91_Enum;

/* ==========================================  CM4TIMER OUTCFG22 OUTCFG90 [16..21]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG22_OUTCFG90                                                */
  CM4TIMER_OUTCFG22_OUTCFG90_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG90_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG90_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG90_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG90_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG90_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG90_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG90_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG90_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG22_OUTCFG90_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG22_OUTCFG90_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG22_OUTCFG90_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG22_OUTCFG90_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG22_OUTCFG90_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG22_OUTCFG90_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG22_OUTCFG90_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG22_OUTCFG90_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG22_OUTCFG90_Enum;

/* ==========================================  CM4TIMER OUTCFG22 OUTCFG89 [8..13]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG22_OUTCFG89                                                */
  CM4TIMER_OUTCFG22_OUTCFG89_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG89_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG89_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG89_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG89_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG89_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG89_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG89_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG89_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG22_OUTCFG89_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG22_OUTCFG89_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG22_OUTCFG89_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG22_OUTCFG89_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG22_OUTCFG89_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG22_OUTCFG89_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG22_OUTCFG89_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG22_OUTCFG89_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG22_OUTCFG89_Enum;

/* ===========================================  CM4TIMER OUTCFG22 OUTCFG88 [0..5]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG22_OUTCFG88                                                */
  CM4TIMER_OUTCFG22_OUTCFG88_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG88_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG88_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG88_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG88_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG88_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG88_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG22_OUTCFG88_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG22_OUTCFG88_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG22_OUTCFG88_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG22_OUTCFG88_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG22_OUTCFG88_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG22_OUTCFG88_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG22_OUTCFG88_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG22_OUTCFG88_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG22_OUTCFG88_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG22_OUTCFG88_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG22_OUTCFG88_Enum;

/* =======================================================  OUTCFG23  ======================================================== */
/* ==========================================  CM4TIMER OUTCFG23 OUTCFG95 [24..29]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG23_OUTCFG95                                                */
  CM4TIMER_OUTCFG23_OUTCFG95_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG95_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG95_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG95_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG95_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG95_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG95_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG95_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG95_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG23_OUTCFG95_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG23_OUTCFG95_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG23_OUTCFG95_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG23_OUTCFG95_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG23_OUTCFG95_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG23_OUTCFG95_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG23_OUTCFG95_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG23_OUTCFG95_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG23_OUTCFG95_Enum;

