AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ==========================================  CM4TIMER OUTCFG23 OUTCFG94 [16..21]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG23_OUTCFG94                                                */
  CM4TIMER_OUTCFG23_OUTCFG94_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG94_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG94_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG94_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG94_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG94_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG94_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG94_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG94_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG23_OUTCFG94_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG23_OUTCFG94_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG23_OUTCFG94_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG23_OUTCFG94_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG23_OUTCFG94_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG23_OUTCFG94_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG23_OUTCFG94_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG23_OUTCFG94_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG23_OUTCFG94_Enum;

/* ==========================================  CM4TIMER OUTCFG23 OUTCFG93 [8..13]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG23_OUTCFG93                                                */
  CM4TIMER_OUTCFG23_OUTCFG93_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG93_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG93_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG93_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG93_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG93_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG93_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG93_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG93_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG23_OUTCFG93_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG23_OUTCFG93_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG23_OUTCFG93_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG23_OUTCFG93_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG23_OUTCFG93_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG23_OUTCFG93_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG23_OUTCFG93_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG23_OUTCFG93_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG23_OUTCFG93_Enum;

/* ===========================================  CM4TIMER OUTCFG23 OUTCFG92 [0..5]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG23_OUTCFG92                                                */
  CM4TIMER_OUTCFG23_OUTCFG92_TIMER00   = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG92_TIMER01   = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG92_TIMER10   = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG92_TIMER11   = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG92_TIMER20   = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG92_TIMER21   = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG92_TIMER30   = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG23_OUTCFG92_TIMER31   = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG23_OUTCFG92_STIMER0   = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG23_OUTCFG92_STIMER1   = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG23_OUTCFG92_STIMER2   = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG23_OUTCFG92_STIMER3   = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG23_OUTCFG92_STIMER4   = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG23_OUTCFG92_STIMER5   = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG23_OUTCFG92_STIMER6   = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG23_OUTCFG92_STIMER7   = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG23_OUTCFG92_DISABLED  = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG23_OUTCFG92_Enum;

