AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ==========================================  CM4TIMER OUTCFG26 OUTCFG104 [0..5]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG26_OUTCFG104                                               */
  CM4TIMER_OUTCFG26_OUTCFG104_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG26_OUTCFG104_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG26_OUTCFG104_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG26_OUTCFG104_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG26_OUTCFG104_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG26_OUTCFG104_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG26_OUTCFG104_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG26_OUTCFG104_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG26_OUTCFG104_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG26_OUTCFG104_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG26_OUTCFG104_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG26_OUTCFG104_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG26_OUTCFG104_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG26_OUTCFG104_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG26_OUTCFG104_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG26_OUTCFG104_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG26_OUTCFG104_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG26_OUTCFG104_Enum;

/* =======================================================  OUTCFG27  ======================================================== */
/* =========================================  CM4TIMER OUTCFG27 OUTCFG111 [24..29]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG27_OUTCFG111                                               */
  CM4TIMER_OUTCFG27_OUTCFG111_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG111_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG111_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG111_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG111_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG111_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG111_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG111_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG111_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG27_OUTCFG111_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG27_OUTCFG111_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG27_OUTCFG111_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG27_OUTCFG111_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG27_OUTCFG111_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG27_OUTCFG111_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG27_OUTCFG111_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG27_OUTCFG111_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG27_OUTCFG111_Enum;

/* =========================================  CM4TIMER OUTCFG27 OUTCFG110 [16..21]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG27_OUTCFG110                                               */
  CM4TIMER_OUTCFG27_OUTCFG110_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG110_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG110_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG110_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG110_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG110_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG110_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG110_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG110_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG27_OUTCFG110_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG27_OUTCFG110_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG27_OUTCFG110_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG27_OUTCFG110_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG27_OUTCFG110_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG27_OUTCFG110_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG27_OUTCFG110_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG27_OUTCFG110_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG27_OUTCFG110_Enum;

/* ==========================================  CM4TIMER OUTCFG27 OUTCFG109 [8..13]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG27_OUTCFG109                                               */
  CM4TIMER_OUTCFG27_OUTCFG109_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG109_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG109_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG109_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG109_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG109_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG109_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG109_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG109_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG27_OUTCFG109_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG27_OUTCFG109_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG27_OUTCFG109_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG27_OUTCFG109_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG27_OUTCFG109_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG27_OUTCFG109_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG27_OUTCFG109_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG27_OUTCFG109_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG27_OUTCFG109_Enum;

/* ==========================================  CM4TIMER OUTCFG27 OUTCFG108 [0..5]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG27_OUTCFG108                                               */
  CM4TIMER_OUTCFG27_OUTCFG108_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG108_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG108_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG108_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG108_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG108_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG108_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG27_OUTCFG108_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG27_OUTCFG108_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG27_OUTCFG108_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG27_OUTCFG108_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG27_OUTCFG108_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG27_OUTCFG108_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG27_OUTCFG108_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG27_OUTCFG108_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG27_OUTCFG108_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG27_OUTCFG108_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG27_OUTCFG108_Enum;

