AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* =======================================================  OUTCFG29  ======================================================== */
/* =========================================  CM4TIMER OUTCFG29 OUTCFG119 [24..29]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG29_OUTCFG119                                               */
  CM4TIMER_OUTCFG29_OUTCFG119_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG119_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG119_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG119_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG119_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG119_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG119_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG119_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG119_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG29_OUTCFG119_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG29_OUTCFG119_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG29_OUTCFG119_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG29_OUTCFG119_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG29_OUTCFG119_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG29_OUTCFG119_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG29_OUTCFG119_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG29_OUTCFG119_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG29_OUTCFG119_Enum;

/* =========================================  CM4TIMER OUTCFG29 OUTCFG118 [16..21]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG29_OUTCFG118                                               */
  CM4TIMER_OUTCFG29_OUTCFG118_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG118_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG118_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG118_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG118_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG118_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG118_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG118_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG118_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG29_OUTCFG118_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG29_OUTCFG118_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG29_OUTCFG118_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG29_OUTCFG118_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG29_OUTCFG118_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG29_OUTCFG118_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG29_OUTCFG118_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG29_OUTCFG118_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG29_OUTCFG118_Enum;

/* ==========================================  CM4TIMER OUTCFG29 OUTCFG117 [8..13]  ========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG29_OUTCFG117                                               */
  CM4TIMER_OUTCFG29_OUTCFG117_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG117_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG117_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG117_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG117_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG117_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG117_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG117_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG117_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG29_OUTCFG117_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG29_OUTCFG117_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG29_OUTCFG117_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG29_OUTCFG117_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG29_OUTCFG117_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG29_OUTCFG117_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG29_OUTCFG117_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG29_OUTCFG117_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG29_OUTCFG117_Enum;

/* ==========================================  CM4TIMER OUTCFG29 OUTCFG116 [0..5]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_OUTCFG29_OUTCFG116                                               */
  CM4TIMER_OUTCFG29_OUTCFG116_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG116_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG116_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG116_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG116_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG116_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG116_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  CM4TIMER_OUTCFG29_OUTCFG116_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  CM4TIMER_OUTCFG29_OUTCFG116_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  CM4TIMER_OUTCFG29_OUTCFG116_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  CM4TIMER_OUTCFG29_OUTCFG116_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  CM4TIMER_OUTCFG29_OUTCFG116_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  CM4TIMER_OUTCFG29_OUTCFG116_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  CM4TIMER_OUTCFG29_OUTCFG116_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  CM4TIMER_OUTCFG29_OUTCFG116_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  CM4TIMER_OUTCFG29_OUTCFG116_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  CM4TIMER_OUTCFG29_OUTCFG116_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} CM4TIMER_OUTCFG29_OUTCFG116_Enum;

/* =========================================================  CTRL0  ========================================================= */
/* ===========================================  CM4TIMER CTRL0 TMR0TMODE [16..17]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_CTRL0_TMR0TMODE                                                  */
  CM4TIMER_CTRL0_TMR0TMODE_DIS         = 0,     /*!< DIS : Trigger not enabled                                                 */
  CM4TIMER_CTRL0_TMR0TMODE_RISE        = 1,     /*!< RISE : Trigger on rising edge of TRIGSEL source                           */
  CM4TIMER_CTRL0_TMR0TMODE_FALL        = 2,     /*!< FALL : Trigger on falling edge of TRIGSEL source                          */
  CM4TIMER_CTRL0_TMR0TMODE_BOTH        = 3,     /*!< BOTH : Trigger on either edge of TRIGSEL source                           */
} CM4TIMER_CTRL0_TMR0TMODE_Enum;

/* ============================================  CM4TIMER CTRL0 TMR0CLK [8..15]  ============================================= */
typedef enum {                                  /*!< CM4TIMER_CTRL0_TMR0CLK                                                    */
  CM4TIMER_CTRL0_TMR0CLK_HFRC_3MHz     = 0,     /*!< HFRC_3MHz : 3M from HFRC clock divider.                                   */
  CM4TIMER_CTRL0_TMR0CLK_HFRC_187KHz   = 1,     /*!< HFRC_187KHz : 187K from the HFRC clock divider.                           */
  CM4TIMER_CTRL0_TMR0CLK_XT_32K        = 2,     /*!< XT_32K : 32768Hz from the crystal oscillator                              */
  CM4TIMER_CTRL0_TMR0CLK_XT_16K        = 3,     /*!< XT_16K : 16384Hz from the crystal oscillator                              */
  CM4TIMER_CTRL0_TMR0CLK_XT_1K         = 4,     /*!< XT_1K : 1024Hz from the crystal oscillator.                               */
  CM4TIMER_CTRL0_TMR0CLK_LFRC_1KHZ     = 5,     /*!< LFRC_1KHZ : Approximately 1KHz from the LFRC oscillator (uncalibrated).   */
  CM4TIMER_CTRL0_TMR0CLK_TMR00         = 32,    /*!< TMR00 : Clock source is TIMER 0 Output 0                                  */
  CM4TIMER_CTRL0_TMR0CLK_TMR01         = 33,    /*!< TMR01 : Clock source is TIMER 0 Output 1                                  */
  CM4TIMER_CTRL0_TMR0CLK_TMR10         = 34,    /*!< TMR10 : Clock source is TIMER 1 Output 0                                  */
  CM4TIMER_CTRL0_TMR0CLK_TMR11         = 35,    /*!< TMR11 : Clock source is TIMER 1 Output 1                                  */
  CM4TIMER_CTRL0_TMR0CLK_TMR20         = 36,    /*!< TMR20 : Clock source is TIMER 2 Output 0                                  */
  CM4TIMER_CTRL0_TMR0CLK_TMR21         = 37,    /*!< TMR21 : Clock source is TIMER 2 Output 1                                  */
  CM4TIMER_CTRL0_TMR0CLK_TMR30         = 38,    /*!< TMR30 : Clock source is TIMER 3 Output 0                                  */
  CM4TIMER_CTRL0_TMR0CLK_TMR31         = 39,    /*!< TMR31 : Clock source is TIMER 3 Output 1                                  */
  CM4TIMER_CTRL0_TMR0CLK_GPIO0         = 128,   /*!< GPIO0 : GPIO #0 is clock source                                           */
  CM4TIMER_CTRL0_TMR0CLK_GPIOn         = 129,   /*!< GPIOn : GPIO #n is clock source where n ranges from 1 thru 98.
                                                     The values for GPIO1 - GPIO98 are in the range 0x81 - 0xE2.
                                                     i.e., GPIO0 + n                                                           */
  CM4TIMER_CTRL0_TMR0CLK_GPIO99        = 227,   /*!< GPIO99 : GPIO #99 is clock source                                         */
} CM4TIMER_CTRL0_TMR0CLK_Enum;

/* =============================================  CM4TIMER CTRL0 TMR0FN [4..7]  ============================================== */
typedef enum {                                  /*!< CM4TIMER_CTRL0_TMR0FN                                                     */
  CM4TIMER_CTRL0_TMR0FN_EDGE           = 1,     /*!< EDGE : This Mode generates a single edge on OUT0/OUT1 when TIMER
                                                     value hits CMP0/CMP1 respectively. OUT[0]=0, counter increments
                                                     to CMP0, OUT[0]=1, counter stops. OUT[1] follows CMP1.                    */
  CM4TIMER_CTRL0_TMR0FN_UPCOUNT        = 2,     /*!< UPCOUNT : This mode is run up counter generating a pulse on
                                                     CMP. OUT[0]/OUT[1] is pulsed for one source clock period
                                                     when TIMER matches CMP0/CMP1 respectively. Timer repeats
                                                     for TMR_LMT iterations.                                                   */
  CM4TIMER_CTRL0_TMR0FN_PWM            = 4,     /*!< PWM : PWM mode. OUT0 and OUT1 are waveforms, and not just one
                                                     clock pulse. CMP1 dictates the low phase of the output
                                                     and CMP0 dictates the period. OUT[1]=~OUT[0].                             */
  CM4TIMER_CTRL0_TMR0FN_SINGLEPATTERN  = 12,    /*!< SINGLEPATTERN : Single pattern. OUT0=CMP0[TIMER], OUT1=CMP1[TIMER].
                                                     LMT field specifies length of pattern. When LMT GT 32 OUT0
                                                     and OUT1 is the same 64-bit pattern consisting of concatenated
                                                     CMP1,CMP0. When LMT LT 32 OUT0 and OUT1 are independent.
                                                     Both OUT0 and OUT1 can be inverted individually applications
                                                     with POL0/POL1 = 0x1.                                                     */
  CM4TIMER_CTRL0_TMR0FN_REPEATPATTERN  = 13,    /*!< REPEATPATTERN : Repeated pattern. Like SINGLEPATTERN mode, but
                                                     pattern repeats after reaching LMT.                                       */
} CM4TIMER_CTRL0_TMR0FN_Enum;

