AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ============================================  CM4TIMER CTRL0 TMR0POL1 [3..3]  ============================================= */
typedef enum {                                  /*!< CM4TIMER_CTRL0_TMR0POL1                                                   */
  CM4TIMER_CTRL0_TMR0POL1_NORMAL       = 0,     /*!< NORMAL : The polarity of the TMR0OUT1 pin is the same as the
                                                     timer output.                                                             */
  CM4TIMER_CTRL0_TMR0POL1_INVERTED     = 1,     /*!< INVERTED : The polarity of the TMR0OUT1 pin is the inverse of
                                                     the timer output.                                                         */
} CM4TIMER_CTRL0_TMR0POL1_Enum;

/* ============================================  CM4TIMER CTRL0 TMR0POL0 [2..2]  ============================================= */
typedef enum {                                  /*!< CM4TIMER_CTRL0_TMR0POL0                                                   */
  CM4TIMER_CTRL0_TMR0POL0_NORMAL       = 0,     /*!< NORMAL : The polarity of the TMR0OUT0 pin is the same as the
                                                     timer output.                                                             */
  CM4TIMER_CTRL0_TMR0POL0_INVERTED     = 1,     /*!< INVERTED : The polarity of the TMR0OUT0 pin is the inverse of
                                                     the timer output.                                                         */
} CM4TIMER_CTRL0_TMR0POL0_Enum;

/* =============================================  CM4TIMER CTRL0 TMR0CLR [1..1]  ============================================= */
typedef enum {                                  /*!< CM4TIMER_CTRL0_TMR0CLR                                                    */
  CM4TIMER_CTRL0_TMR0CLR_CLEAR         = 1,     /*!< CLEAR : When written to a 1, the timer will automatically be
                                                     cleared to its reset state # (0 for count up counter, CMP0
                                                     for down counter)                                                         */
  CM4TIMER_CTRL0_TMR0CLR_DEFAULT       = 0,     /*!< DEFAULT : Default value set to 0. Timer works normally.                   */
} CM4TIMER_CTRL0_TMR0CLR_Enum;

/* =============================================  CM4TIMER CTRL0 TMR0EN [0..0]  ============================================== */
typedef enum {                                  /*!< CM4TIMER_CTRL0_TMR0EN                                                     */
  CM4TIMER_CTRL0_TMR0EN_DIS            = 0,     /*!< DIS : Counter/Timer 0 Disable.                                            */
  CM4TIMER_CTRL0_TMR0EN_EN             = 1,     /*!< EN : Counter/Timer 0 Enable.                                              */
} CM4TIMER_CTRL0_TMR0EN_Enum;

/* ========================================================  TIMER0  ========================================================= */
/* =======================================================  TMR0CMP0  ======================================================== */
/* =======================================================  TMR0CMP1  ======================================================== */
/* =========================================================  MODE0  ========================================================= */
/* ==========================================  CM4TIMER MODE0 TMR0TRIGSEL [8..15]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_MODE0_TMR0TRIGSEL                                                */
  CM4TIMER_MODE0_TMR0TRIGSEL_TMR00     = 0,     /*!< TMR00 : Trigger source is TIMER 0 Output 0                                */
  CM4TIMER_MODE0_TMR0TRIGSEL_TMR01     = 1,     /*!< TMR01 : Trigger source is TIMER 0 Output 1                                */
  CM4TIMER_MODE0_TMR0TRIGSEL_TMR10     = 2,     /*!< TMR10 : Trigger source is TIMER 1 Output 0                                */
  CM4TIMER_MODE0_TMR0TRIGSEL_TMR11     = 3,     /*!< TMR11 : Trigger source is TIMER 1 Output 1                                */
  CM4TIMER_MODE0_TMR0TRIGSEL_TMR20     = 4,     /*!< TMR20 : Trigger source is TIMER 2 Output 0                                */
  CM4TIMER_MODE0_TMR0TRIGSEL_TMR21     = 5,     /*!< TMR21 : Trigger source is TIMER 2 Output 1                                */
  CM4TIMER_MODE0_TMR0TRIGSEL_TMR30     = 6,     /*!< TMR30 : Trigger source is TIMER 3 Output 0                                */
  CM4TIMER_MODE0_TMR0TRIGSEL_TMR31     = 7,     /*!< TMR31 : Trigger source is TIMER 3 Output 1                                */
  CM4TIMER_MODE0_TMR0TRIGSEL_STMRCMP00 = 48,    /*!< STMRCMP00 : Trigger source is STIMER Compare 0                            */
  CM4TIMER_MODE0_TMR0TRIGSEL_STMRCMP10 = 49,    /*!< STMRCMP10 : Trigger source is STIMER Compare 1                            */
  CM4TIMER_MODE0_TMR0TRIGSEL_STMRCMP20 = 50,    /*!< STMRCMP20 : Trigger source is STIMER Compare 2                            */
  CM4TIMER_MODE0_TMR0TRIGSEL_STMRCMP30 = 51,    /*!< STMRCMP30 : Trigger source is STIMER Compare 3                            */
  CM4TIMER_MODE0_TMR0TRIGSEL_STMRCMP40 = 52,    /*!< STMRCMP40 : Trigger source is STIMER Compare 4                            */
  CM4TIMER_MODE0_TMR0TRIGSEL_STMRCMP50 = 53,    /*!< STMRCMP50 : Trigger source is STIMER Compare 5                            */
  CM4TIMER_MODE0_TMR0TRIGSEL_STMRCMP60 = 54,    /*!< STMRCMP60 : Trigger source is STIMER Compare 6                            */
  CM4TIMER_MODE0_TMR0TRIGSEL_STMRCMP70 = 55,    /*!< STMRCMP70 : Trigger source is STIMER Compare 7                            */
  CM4TIMER_MODE0_TMR0TRIGSEL_STMRCAP00 = 56,    /*!< STMRCAP00 : Trigger source is STIMER Capture 0                            */
  CM4TIMER_MODE0_TMR0TRIGSEL_STMRCAP10 = 57,    /*!< STMRCAP10 : Trigger source is STIMER Capture 1                            */
  CM4TIMER_MODE0_TMR0TRIGSEL_STMRCAP20 = 58,    /*!< STMRCAP20 : Trigger source is STIMER Capture 2                            */
  CM4TIMER_MODE0_TMR0TRIGSEL_STMRCAP30 = 59,    /*!< STMRCAP30 : Trigger source is STIMER Capture 3                            */
  CM4TIMER_MODE0_TMR0TRIGSEL_GPIO0     = 128,   /*!< GPIO0 : Trigger source is GPIO #0                                         */
  CM4TIMER_MODE0_TMR0TRIGSEL_GPIO123   = 251,   /*!< GPIO123 : Trigger source is GPIO #123                                     */
  CM4TIMER_MODE0_TMR0TRIGSEL_GPIO127   = 255,   /*!< GPIO127 : Trigger source is GPIO #127                                     */
} CM4TIMER_MODE0_TMR0TRIGSEL_Enum;

/* ======================================================  TMR0LMTVAL  ======================================================= */
/* =========================================================  CTRL1  ========================================================= */
/* ===========================================  CM4TIMER CTRL1 TMR1TMODE [16..17]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_CTRL1_TMR1TMODE                                                  */
  CM4TIMER_CTRL1_TMR1TMODE_DIS         = 0,     /*!< DIS : Trigger not enabled                                                 */
  CM4TIMER_CTRL1_TMR1TMODE_RISE        = 1,     /*!< RISE : Trigger on rising edge of TRIGSEL source                           */
  CM4TIMER_CTRL1_TMR1TMODE_FALL        = 2,     /*!< FALL : Trigger on falling edge of TRIGSEL source                          */
  CM4TIMER_CTRL1_TMR1TMODE_BOTH        = 3,     /*!< BOTH : Trigger on either edge of TRIGSEL source                           */
} CM4TIMER_CTRL1_TMR1TMODE_Enum;

/* ============================================  CM4TIMER CTRL1 TMR1CLK [8..15]  ============================================= */
typedef enum {                                  /*!< CM4TIMER_CTRL1_TMR1CLK                                                    */
  CM4TIMER_CTRL1_TMR1CLK_HFRC_3MHz     = 0,     /*!< HFRC_3MHz : 3M from HFRC clock divider.                                   */
  CM4TIMER_CTRL1_TMR1CLK_HFRC_187KHz   = 1,     /*!< HFRC_187KHz : 187K from the HFRC clock divider.                           */
  CM4TIMER_CTRL1_TMR1CLK_XT_32K        = 2,     /*!< XT_32K : 32768Hz from the crystal oscillator                              */
  CM4TIMER_CTRL1_TMR1CLK_XT_16K        = 3,     /*!< XT_16K : 16384Hz from the crystal oscillator                              */
  CM4TIMER_CTRL1_TMR1CLK_XT_1K         = 4,     /*!< XT_1K : 1024Hz from the crystal oscillator.                               */
  CM4TIMER_CTRL1_TMR1CLK_LFRC_1KHZ     = 5,     /*!< LFRC_1KHZ : Approximately 1KHz from the LFRC oscillator (uncalibrated).   */
  CM4TIMER_CTRL1_TMR1CLK_TMR00         = 32,    /*!< TMR00 : Clock source is TIMER 0 Output 0                                  */
  CM4TIMER_CTRL1_TMR1CLK_TMR01         = 33,    /*!< TMR01 : Clock source is TIMER 0 Output 1                                  */
  CM4TIMER_CTRL1_TMR1CLK_TMR10         = 34,    /*!< TMR10 : Clock source is TIMER 1 Output 0                                  */
  CM4TIMER_CTRL1_TMR1CLK_TMR11         = 35,    /*!< TMR11 : Clock source is TIMER 1 Output 1                                  */
  CM4TIMER_CTRL1_TMR1CLK_TMR20         = 36,    /*!< TMR20 : Clock source is TIMER 2 Output 0                                  */
  CM4TIMER_CTRL1_TMR1CLK_TMR21         = 37,    /*!< TMR21 : Clock source is TIMER 2 Output 1                                  */
  CM4TIMER_CTRL1_TMR1CLK_TMR30         = 38,    /*!< TMR30 : Clock source is TIMER 3 Output 0                                  */
  CM4TIMER_CTRL1_TMR1CLK_TMR31         = 39,    /*!< TMR31 : Clock source is TIMER 3 Output 1                                  */
  CM4TIMER_CTRL1_TMR1CLK_GPIO0         = 128,   /*!< GPIO0 : GPIO #0 is clock source                                           */
  CM4TIMER_CTRL1_TMR1CLK_GPIOn         = 129,   /*!< GPIOn : GPIO #n is clock source where n ranges from 1 thru 98.
                                                     The values for GPIO1 - GPIO98 are in the range 0x81 - 0xE2.
                                                     i.e., GPIO0 + n                                                           */
  CM4TIMER_CTRL1_TMR1CLK_GPIO99        = 227,   /*!< GPIO99 : GPIO #99 is clock source                                         */
} CM4TIMER_CTRL1_TMR1CLK_Enum;

/* =============================================  CM4TIMER CTRL1 TMR1FN [4..7]  ============================================== */
typedef enum {                                  /*!< CM4TIMER_CTRL1_TMR1FN                                                     */
  CM4TIMER_CTRL1_TMR1FN_EDGE           = 1,     /*!< EDGE : This Mode generates a single edge on OUT0/OUT1 when TIMER
                                                     value hits CMP0/CMP1 respectively. OUT[0]=0, counter increments
                                                     to CMP0, OUT[0]=1, counter stops. OUT[1] follows CMP1.                    */
  CM4TIMER_CTRL1_TMR1FN_UPCOUNT        = 2,     /*!< UPCOUNT : This mode is run up counter generating a pulse on
                                                     CMP. OUT[0]/OUT[1] is pulsed for one source clock period
                                                     when TIMER matches CMP0/CMP1 respectively. Timer repeats
                                                     for TMR_LMT iterations.                                                   */
  CM4TIMER_CTRL1_TMR1FN_PWM            = 4,     /*!< PWM : PWM mode. OUT0 and OUT1 are waveforms, and not just one
                                                     clock pulse. CMP1 dictates the low phase of the output
                                                     and CMP0 dictates the period. OUT[1]=~OUT[0].                             */
  CM4TIMER_CTRL1_TMR1FN_SINGLEPATTERN  = 12,    /*!< SINGLEPATTERN : Single pattern. OUT0=CMP0[TIMER], OUT1=CMP1[TIMER].
                                                     LMT field specifies length of pattern. When LMT GT 32 OUT0
                                                     and OUT1 is the same 64-bit pattern consisting of concatenated
                                                     CMP1,CMP0. When LMT LT 32 OUT0 and OUT1 are independent.
                                                     Both OUT0 and OUT1 can be inverted individually applications
                                                     with POL0/POL1 = 0x1.                                                     */
  CM4TIMER_CTRL1_TMR1FN_REPEATPATTERN  = 13,    /*!< REPEATPATTERN : Repeated pattern. Like SINGLEPATTERN mode, but
                                                     pattern repeats after reaching LMT.                                       */
} CM4TIMER_CTRL1_TMR1FN_Enum;

