AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ============================================  CM4TIMER CTRL3 TMR3POL1 [3..3]  ============================================= */
typedef enum {                                  /*!< CM4TIMER_CTRL3_TMR3POL1                                                   */
  CM4TIMER_CTRL3_TMR3POL1_NORMAL       = 0,     /*!< NORMAL : The polarity of the TMR3OUT1 pin is the same as the
                                                     timer output.                                                             */
  CM4TIMER_CTRL3_TMR3POL1_INVERTED     = 1,     /*!< INVERTED : The polarity of the TMR3OUT1 pin is the inverse of
                                                     the timer output.                                                         */
} CM4TIMER_CTRL3_TMR3POL1_Enum;

/* ============================================  CM4TIMER CTRL3 TMR3POL0 [2..2]  ============================================= */
typedef enum {                                  /*!< CM4TIMER_CTRL3_TMR3POL0                                                   */
  CM4TIMER_CTRL3_TMR3POL0_NORMAL       = 0,     /*!< NORMAL : The polarity of the TMR3OUT0 pin is the same as the
                                                     timer output.                                                             */
  CM4TIMER_CTRL3_TMR3POL0_INVERTED     = 1,     /*!< INVERTED : The polarity of the TMR3OUT0 pin is the inverse of
                                                     the timer output.                                                         */
} CM4TIMER_CTRL3_TMR3POL0_Enum;

/* =============================================  CM4TIMER CTRL3 TMR3CLR [1..1]  ============================================= */
typedef enum {                                  /*!< CM4TIMER_CTRL3_TMR3CLR                                                    */
  CM4TIMER_CTRL3_TMR3CLR_CLEAR         = 1,     /*!< CLEAR : When written to a 1, the timer will automatically be
                                                     cleared to its reset state # (0 for count up counter, CMP0
                                                     for down counter)                                                         */
  CM4TIMER_CTRL3_TMR3CLR_DEFAULT       = 0,     /*!< DEFAULT : Default value set to 0. Timer works normally.                   */
} CM4TIMER_CTRL3_TMR3CLR_Enum;

/* =============================================  CM4TIMER CTRL3 TMR3EN [0..0]  ============================================== */
typedef enum {                                  /*!< CM4TIMER_CTRL3_TMR3EN                                                     */
  CM4TIMER_CTRL3_TMR3EN_DIS            = 0,     /*!< DIS : Counter/Timer 3 Disable.                                            */
  CM4TIMER_CTRL3_TMR3EN_EN             = 1,     /*!< EN : Counter/Timer 3 Enable.                                              */
} CM4TIMER_CTRL3_TMR3EN_Enum;

/* ========================================================  TIMER3  ========================================================= */
/* =======================================================  TMR3CMP0  ======================================================== */
/* =======================================================  TMR3CMP1  ======================================================== */
/* =========================================================  MODE3  ========================================================= */
/* ==========================================  CM4TIMER MODE3 TMR3TRIGSEL [8..15]  =========================================== */
typedef enum {                                  /*!< CM4TIMER_MODE3_TMR3TRIGSEL                                                */
  CM4TIMER_MODE3_TMR3TRIGSEL_TMR00     = 0,     /*!< TMR00 : Trigger source is TIMER 0 Output 0                                */
  CM4TIMER_MODE3_TMR3TRIGSEL_TMR01     = 1,     /*!< TMR01 : Trigger source is TIMER 0 Output 1                                */
  CM4TIMER_MODE3_TMR3TRIGSEL_TMR10     = 2,     /*!< TMR10 : Trigger source is TIMER 1 Output 0                                */
  CM4TIMER_MODE3_TMR3TRIGSEL_TMR11     = 3,     /*!< TMR11 : Trigger source is TIMER 1 Output 1                                */
  CM4TIMER_MODE3_TMR3TRIGSEL_TMR20     = 4,     /*!< TMR20 : Trigger source is TIMER 2 Output 0                                */
  CM4TIMER_MODE3_TMR3TRIGSEL_TMR21     = 5,     /*!< TMR21 : Trigger source is TIMER 2 Output 1                                */
  CM4TIMER_MODE3_TMR3TRIGSEL_TMR30     = 6,     /*!< TMR30 : Trigger source is TIMER 3 Output 0                                */
  CM4TIMER_MODE3_TMR3TRIGSEL_TMR31     = 7,     /*!< TMR31 : Trigger source is TIMER 3 Output 1                                */
  CM4TIMER_MODE3_TMR3TRIGSEL_STMRCMP00 = 48,    /*!< STMRCMP00 : Trigger source is STIMER Compare 0                            */
  CM4TIMER_MODE3_TMR3TRIGSEL_STMRCMP10 = 49,    /*!< STMRCMP10 : Trigger source is STIMER Compare 1                            */
  CM4TIMER_MODE3_TMR3TRIGSEL_STMRCMP20 = 50,    /*!< STMRCMP20 : Trigger source is STIMER Compare 2                            */
  CM4TIMER_MODE3_TMR3TRIGSEL_STMRCMP30 = 51,    /*!< STMRCMP30 : Trigger source is STIMER Compare 3                            */
  CM4TIMER_MODE3_TMR3TRIGSEL_STMRCMP40 = 52,    /*!< STMRCMP40 : Trigger source is STIMER Compare 4                            */
  CM4TIMER_MODE3_TMR3TRIGSEL_STMRCMP50 = 53,    /*!< STMRCMP50 : Trigger source is STIMER Compare 5                            */
  CM4TIMER_MODE3_TMR3TRIGSEL_STMRCMP60 = 54,    /*!< STMRCMP60 : Trigger source is STIMER Compare 6                            */
  CM4TIMER_MODE3_TMR3TRIGSEL_STMRCMP70 = 55,    /*!< STMRCMP70 : Trigger source is STIMER Compare 7                            */
  CM4TIMER_MODE3_TMR3TRIGSEL_STMRCAP00 = 56,    /*!< STMRCAP00 : Trigger source is STIMER Capture 0                            */
  CM4TIMER_MODE3_TMR3TRIGSEL_STMRCAP10 = 57,    /*!< STMRCAP10 : Trigger source is STIMER Capture 1                            */
  CM4TIMER_MODE3_TMR3TRIGSEL_STMRCAP20 = 58,    /*!< STMRCAP20 : Trigger source is STIMER Capture 2                            */
  CM4TIMER_MODE3_TMR3TRIGSEL_STMRCAP30 = 59,    /*!< STMRCAP30 : Trigger source is STIMER Capture 3                            */
  CM4TIMER_MODE3_TMR3TRIGSEL_GPIO0     = 128,   /*!< GPIO0 : Trigger source is GPIO #0                                         */
  CM4TIMER_MODE3_TMR3TRIGSEL_GPIO123   = 251,   /*!< GPIO123 : Trigger source is GPIO #123                                     */
  CM4TIMER_MODE3_TMR3TRIGSEL_GPIO127   = 255,   /*!< GPIO127 : Trigger source is GPIO #127                                     */
} CM4TIMER_MODE3_TMR3TRIGSEL_Enum;

