AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/CMSIS/AmbiqMicro/Include/apollo510L_cm4.h
/* ======================================================  TMR3LMTVAL  ======================================================= */
/* ======================================================  TIMERSPARES  ====================================================== */


/* =========================================================================================================================== */
/* ================                                          CM4WDT                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
/* ==============================================  CM4WDT CFG CLKSEL [24..26]  =============================================== */
typedef enum {                                  /*!< CM4WDT_CFG_CLKSEL                                                         */
  CM4WDT_CFG_CLKSEL_OFF                = 0,     /*!< OFF : Low Power Mode. This setting disables the watch dog timer.          */
  CM4WDT_CFG_CLKSEL_LFRC_128HZ         = 1,     /*!< LFRC_128HZ : 128 Hz LFRC clock.                                           */
  CM4WDT_CFG_CLKSEL_LFRC_16HZ          = 2,     /*!< LFRC_16HZ : 16 Hz LFRC clock.                                             */
  CM4WDT_CFG_CLKSEL_LFRC_1HZ           = 3,     /*!< LFRC_1HZ : 1 Hz LFRC clock.                                               */
  CM4WDT_CFG_CLKSEL_LFRC_1_16HZ        = 4,     /*!< LFRC_1_16HZ : 1/16th Hz LFRC clock.                                       */
} CM4WDT_CFG_CLKSEL_Enum;

/* =========================================================  RSTRT  ========================================================= */
/* ===============================================  CM4WDT RSTRT RSTRT [0..7]  =============================================== */
typedef enum {                                  /*!< CM4WDT_RSTRT_RSTRT                                                        */
  CM4WDT_RSTRT_RSTRT_KEYVALUE          = 178,   /*!< KEYVALUE : This is the key value to write to WDTRSTRT to restart
                                                     the WDT. This is a write only register.                                   */
  CM4WDT_RSTRT_RSTRT_DEFAULT           = 0,     /*!< DEFAULT : Default/Reset value. This is a write only register.             */
} CM4WDT_RSTRT_RSTRT_Enum;

/* =========================================================  LOCK  ========================================================== */
/* ================================================  CM4WDT LOCK LOCK [0..7]  ================================================ */
typedef enum {                                  /*!< CM4WDT_LOCK_LOCK                                                          */
  CM4WDT_LOCK_LOCK_KEYVALUE            = 58,    /*!< KEYVALUE : This is the key value to write to WDTLOCK to lock
                                                     the WDT.                                                                  */
  CM4WDT_LOCK_LOCK_DEFAULT             = 0,     /*!< DEFAULT : Default/Reset value.                                            */
} CM4WDT_LOCK_LOCK_Enum;

/* =========================================================  COUNT  ========================================================= */
/* =======================================================  WDTIEREN  ======================================================== */
/* ======================================================  WDTIERSTAT  ======================================================= */
/* =======================================================  WDTIERCLR  ======================================================= */
/* =======================================================  WDTIERSET  ======================================================= */

/** @} */ /* End of group EnumValue_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* APOLLO510L_CM4_H */


/** @} */ /* End of group apollo510L_cm4 */

/** @} */ /* End of group Ambiq Micro */
